espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/**
 * SPDX-FileCopyrightText: 2021-2022 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/* The value that needs to be written to RTC_CNTL_WDT_WKEY to write-enable the wdt registers */
#define RTC_CNTL_WDT_WKEY_VALUE 0x50D83AA1
/* The value that needs to be written to RTC_CNTL_SWD_WPROTECT_REG to write-enable the wdt registers */
#define RTC_CNTL_SWD_WKEY_VALUE 0x8F1D312A

/* Possible values for RTC_CNTL_WDT_CPU_RESET_LENGTH and RTC_CNTL_WDT_SYS_RESET_LENGTH */
#define RTC_WDT_RESET_LENGTH_100_NS    0
#define RTC_WDT_RESET_LENGTH_200_NS    1
#define RTC_WDT_RESET_LENGTH_300_NS    2
#define RTC_WDT_RESET_LENGTH_400_NS    3
#define RTC_WDT_RESET_LENGTH_500_NS    4
#define RTC_WDT_RESET_LENGTH_800_NS    5
#define RTC_WDT_RESET_LENGTH_1600_NS   6
#define RTC_WDT_RESET_LENGTH_3200_NS   7

#define RTC_CNTL_TIME0_REG		RTC_CNTL_TIME_LOW0_REG
#define RTC_CNTL_TIME1_REG		RTC_CNTL_TIME_HIGH0_REG

/** RTC_CNTL_OPTIONS0_REG register
 *  register description
 */
#define RTC_CNTL_OPTIONS0_REG (DR_REG_RTCCNTL_BASE + 0x0)
/** RTC_CNTL_SW_STALL_APPCPU_C0 : R/W; bitpos: [1:0]; default: 0;
 *  {reg_sw_stall_appcpu_c1[5:0],  reg_sw_stall_appcpu_c0[1:0]} == 0x86 will stall APP
 *  CPU
 */
#define RTC_CNTL_SW_STALL_APPCPU_C0    0x00000003U
#define RTC_CNTL_SW_STALL_APPCPU_C0_M  (RTC_CNTL_SW_STALL_APPCPU_C0_V << RTC_CNTL_SW_STALL_APPCPU_C0_S)
#define RTC_CNTL_SW_STALL_APPCPU_C0_V  0x00000003U
#define RTC_CNTL_SW_STALL_APPCPU_C0_S  0
/** RTC_CNTL_SW_STALL_PROCPU_C0 : R/W; bitpos: [3:2]; default: 0;
 *  {reg_sw_stall_procpu_c1[5:0],  reg_sw_stall_procpu_c0[1:0]} == 0x86 will stall PRO
 *  CPU
 */
#define RTC_CNTL_SW_STALL_PROCPU_C0    0x00000003U
#define RTC_CNTL_SW_STALL_PROCPU_C0_M  (RTC_CNTL_SW_STALL_PROCPU_C0_V << RTC_CNTL_SW_STALL_PROCPU_C0_S)
#define RTC_CNTL_SW_STALL_PROCPU_C0_V  0x00000003U
#define RTC_CNTL_SW_STALL_PROCPU_C0_S  2
/** RTC_CNTL_SW_APPCPU_RST : WO; bitpos: [4]; default: 0;
 *  APP CPU SW reset
 */
#define RTC_CNTL_SW_APPCPU_RST    (BIT(4))
#define RTC_CNTL_SW_APPCPU_RST_M  (RTC_CNTL_SW_APPCPU_RST_V << RTC_CNTL_SW_APPCPU_RST_S)
#define RTC_CNTL_SW_APPCPU_RST_V  0x00000001U
#define RTC_CNTL_SW_APPCPU_RST_S  4
/** RTC_CNTL_SW_PROCPU_RST : WO; bitpos: [5]; default: 0;
 *  PRO CPU SW reset
 */
#define RTC_CNTL_SW_PROCPU_RST    (BIT(5))
#define RTC_CNTL_SW_PROCPU_RST_M  (RTC_CNTL_SW_PROCPU_RST_V << RTC_CNTL_SW_PROCPU_RST_S)
#define RTC_CNTL_SW_PROCPU_RST_V  0x00000001U
#define RTC_CNTL_SW_PROCPU_RST_S  5
/** RTC_CNTL_BB_I2C_FORCE_PD : R/W; bitpos: [6]; default: 0;
 *  BB_I2C force power down
 */
#define RTC_CNTL_BB_I2C_FORCE_PD    (BIT(6))
#define RTC_CNTL_BB_I2C_FORCE_PD_M  (RTC_CNTL_BB_I2C_FORCE_PD_V << RTC_CNTL_BB_I2C_FORCE_PD_S)
#define RTC_CNTL_BB_I2C_FORCE_PD_V  0x00000001U
#define RTC_CNTL_BB_I2C_FORCE_PD_S  6
/** RTC_CNTL_BB_I2C_FORCE_PU : R/W; bitpos: [7]; default: 0;
 *  BB_I2C force power up
 */
#define RTC_CNTL_BB_I2C_FORCE_PU    (BIT(7))
#define RTC_CNTL_BB_I2C_FORCE_PU_M  (RTC_CNTL_BB_I2C_FORCE_PU_V << RTC_CNTL_BB_I2C_FORCE_PU_S)
#define RTC_CNTL_BB_I2C_FORCE_PU_V  0x00000001U
#define RTC_CNTL_BB_I2C_FORCE_PU_S  7
/** RTC_CNTL_BBPLL_I2C_FORCE_PD : R/W; bitpos: [8]; default: 0;
 *  BB_PLL _I2C force power down
 */
#define RTC_CNTL_BBPLL_I2C_FORCE_PD    (BIT(8))
#define RTC_CNTL_BBPLL_I2C_FORCE_PD_M  (RTC_CNTL_BBPLL_I2C_FORCE_PD_V << RTC_CNTL_BBPLL_I2C_FORCE_PD_S)
#define RTC_CNTL_BBPLL_I2C_FORCE_PD_V  0x00000001U
#define RTC_CNTL_BBPLL_I2C_FORCE_PD_S  8
/** RTC_CNTL_BBPLL_I2C_FORCE_PU : R/W; bitpos: [9]; default: 0;
 *  BB_PLL_I2C force power up
 */
#define RTC_CNTL_BBPLL_I2C_FORCE_PU    (BIT(9))
#define RTC_CNTL_BBPLL_I2C_FORCE_PU_M  (RTC_CNTL_BBPLL_I2C_FORCE_PU_V << RTC_CNTL_BBPLL_I2C_FORCE_PU_S)
#define RTC_CNTL_BBPLL_I2C_FORCE_PU_V  0x00000001U
#define RTC_CNTL_BBPLL_I2C_FORCE_PU_S  9
/** RTC_CNTL_BBPLL_FORCE_PD : R/W; bitpos: [10]; default: 0;
 *  BB_PLL force power down
 */
#define RTC_CNTL_BBPLL_FORCE_PD    (BIT(10))
#define RTC_CNTL_BBPLL_FORCE_PD_M  (RTC_CNTL_BBPLL_FORCE_PD_V << RTC_CNTL_BBPLL_FORCE_PD_S)
#define RTC_CNTL_BBPLL_FORCE_PD_V  0x00000001U
#define RTC_CNTL_BBPLL_FORCE_PD_S  10
/** RTC_CNTL_BBPLL_FORCE_PU : R/W; bitpos: [11]; default: 0;
 *  BB_PLL force power up
 */
#define RTC_CNTL_BBPLL_FORCE_PU    (BIT(11))
#define RTC_CNTL_BBPLL_FORCE_PU_M  (RTC_CNTL_BBPLL_FORCE_PU_V << RTC_CNTL_BBPLL_FORCE_PU_S)
#define RTC_CNTL_BBPLL_FORCE_PU_V  0x00000001U
#define RTC_CNTL_BBPLL_FORCE_PU_S  11
/** RTC_CNTL_XTL_FORCE_PD : R/W; bitpos: [12]; default: 0;
 *  crystall force power down
 */
#define RTC_CNTL_XTL_FORCE_PD    (BIT(12))
#define RTC_CNTL_XTL_FORCE_PD_M  (RTC_CNTL_XTL_FORCE_PD_V << RTC_CNTL_XTL_FORCE_PD_S)
#define RTC_CNTL_XTL_FORCE_PD_V  0x00000001U
#define RTC_CNTL_XTL_FORCE_PD_S  12
/** RTC_CNTL_XTL_FORCE_PU : R/W; bitpos: [13]; default: 1;
 *  crystall force power up
 */
#define RTC_CNTL_XTL_FORCE_PU    (BIT(13))
#define RTC_CNTL_XTL_FORCE_PU_M  (RTC_CNTL_XTL_FORCE_PU_V << RTC_CNTL_XTL_FORCE_PU_S)
#define RTC_CNTL_XTL_FORCE_PU_V  0x00000001U
#define RTC_CNTL_XTL_FORCE_PU_S  13
/** RTC_CNTL_XTL_EN_WAIT : R/W; bitpos: [17:14]; default: 2;
 *  wait bias_sleep and current source wakeup
 */
#define RTC_CNTL_XTL_EN_WAIT    0x0000000FU
#define RTC_CNTL_XTL_EN_WAIT_M  (RTC_CNTL_XTL_EN_WAIT_V << RTC_CNTL_XTL_EN_WAIT_S)
#define RTC_CNTL_XTL_EN_WAIT_V  0x0000000FU
#define RTC_CNTL_XTL_EN_WAIT_S  14
/** RTC_CNTL_XPD_RFPLL : R/W; bitpos: [18]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XPD_RFPLL    (BIT(18))
#define RTC_CNTL_XPD_RFPLL_M  (RTC_CNTL_XPD_RFPLL_V << RTC_CNTL_XPD_RFPLL_S)
#define RTC_CNTL_XPD_RFPLL_V  0x00000001U
#define RTC_CNTL_XPD_RFPLL_S  18
/** RTC_CNTL_XPD_RFPLL_FORCE : R/W; bitpos: [19]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XPD_RFPLL_FORCE    (BIT(19))
#define RTC_CNTL_XPD_RFPLL_FORCE_M  (RTC_CNTL_XPD_RFPLL_FORCE_V << RTC_CNTL_XPD_RFPLL_FORCE_S)
#define RTC_CNTL_XPD_RFPLL_FORCE_V  0x00000001U
#define RTC_CNTL_XPD_RFPLL_FORCE_S  19
/** RTC_CNTL_XTL_EXT_CTR_SEL : R/W; bitpos: [22:20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XTL_EXT_CTR_SEL    0x00000007U
#define RTC_CNTL_XTL_EXT_CTR_SEL_M  (RTC_CNTL_XTL_EXT_CTR_SEL_V << RTC_CNTL_XTL_EXT_CTR_SEL_S)
#define RTC_CNTL_XTL_EXT_CTR_SEL_V  0x00000007U
#define RTC_CNTL_XTL_EXT_CTR_SEL_S  20
/** RTC_CNTL_XTL_FORCE_ISO : R/W; bitpos: [23]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XTL_FORCE_ISO    (BIT(23))
#define RTC_CNTL_XTL_FORCE_ISO_M  (RTC_CNTL_XTL_FORCE_ISO_V << RTC_CNTL_XTL_FORCE_ISO_S)
#define RTC_CNTL_XTL_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_XTL_FORCE_ISO_S  23
/** RTC_CNTL_PLL_FORCE_ISO : R/W; bitpos: [24]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_PLL_FORCE_ISO    (BIT(24))
#define RTC_CNTL_PLL_FORCE_ISO_M  (RTC_CNTL_PLL_FORCE_ISO_V << RTC_CNTL_PLL_FORCE_ISO_S)
#define RTC_CNTL_PLL_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_PLL_FORCE_ISO_S  24
/** RTC_CNTL_ANALOG_FORCE_ISO : R/W; bitpos: [25]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_ANALOG_FORCE_ISO    (BIT(25))
#define RTC_CNTL_ANALOG_FORCE_ISO_M  (RTC_CNTL_ANALOG_FORCE_ISO_V << RTC_CNTL_ANALOG_FORCE_ISO_S)
#define RTC_CNTL_ANALOG_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_ANALOG_FORCE_ISO_S  25
/** RTC_CNTL_XTL_FORCE_NOISO : R/W; bitpos: [26]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_XTL_FORCE_NOISO    (BIT(26))
#define RTC_CNTL_XTL_FORCE_NOISO_M  (RTC_CNTL_XTL_FORCE_NOISO_V << RTC_CNTL_XTL_FORCE_NOISO_S)
#define RTC_CNTL_XTL_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_XTL_FORCE_NOISO_S  26
/** RTC_CNTL_PLL_FORCE_NOISO : R/W; bitpos: [27]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_PLL_FORCE_NOISO    (BIT(27))
#define RTC_CNTL_PLL_FORCE_NOISO_M  (RTC_CNTL_PLL_FORCE_NOISO_V << RTC_CNTL_PLL_FORCE_NOISO_S)
#define RTC_CNTL_PLL_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_PLL_FORCE_NOISO_S  27
/** RTC_CNTL_ANALOG_FORCE_NOISO : R/W; bitpos: [28]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_ANALOG_FORCE_NOISO    (BIT(28))
#define RTC_CNTL_ANALOG_FORCE_NOISO_M  (RTC_CNTL_ANALOG_FORCE_NOISO_V << RTC_CNTL_ANALOG_FORCE_NOISO_S)
#define RTC_CNTL_ANALOG_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_ANALOG_FORCE_NOISO_S  28
/** RTC_CNTL_DG_WRAP_FORCE_RST : R/W; bitpos: [29]; default: 0;
 *  digital wrap force reset in deep sleep
 */
#define RTC_CNTL_DG_WRAP_FORCE_RST    (BIT(29))
#define RTC_CNTL_DG_WRAP_FORCE_RST_M  (RTC_CNTL_DG_WRAP_FORCE_RST_V << RTC_CNTL_DG_WRAP_FORCE_RST_S)
#define RTC_CNTL_DG_WRAP_FORCE_RST_V  0x00000001U
#define RTC_CNTL_DG_WRAP_FORCE_RST_S  29
/** RTC_CNTL_DG_WRAP_FORCE_NORST : R/W; bitpos: [30]; default: 0;
 *  digital core force no reset in deep sleep
 */
#define RTC_CNTL_DG_WRAP_FORCE_NORST    (BIT(30))
#define RTC_CNTL_DG_WRAP_FORCE_NORST_M  (RTC_CNTL_DG_WRAP_FORCE_NORST_V << RTC_CNTL_DG_WRAP_FORCE_NORST_S)
#define RTC_CNTL_DG_WRAP_FORCE_NORST_V  0x00000001U
#define RTC_CNTL_DG_WRAP_FORCE_NORST_S  30
/** RTC_CNTL_SW_SYS_RST : WO; bitpos: [31]; default: 0;
 *  SW system  reset
 */
#define RTC_CNTL_SW_SYS_RST    (BIT(31))
#define RTC_CNTL_SW_SYS_RST_M  (RTC_CNTL_SW_SYS_RST_V << RTC_CNTL_SW_SYS_RST_S)
#define RTC_CNTL_SW_SYS_RST_V  0x00000001U
#define RTC_CNTL_SW_SYS_RST_S  31

/** RTC_CNTL_SLP_TIMER0_REG register
 *  register description
 */
#define RTC_CNTL_SLP_TIMER0_REG (DR_REG_RTCCNTL_BASE + 0x4)
/** RTC_CNTL_SLP_VAL_LO : R/W; bitpos: [31:0]; default: 0;
 *  RTC sleep timer low 32 bits
 */
#define RTC_CNTL_SLP_VAL_LO    0xFFFFFFFFU
#define RTC_CNTL_SLP_VAL_LO_M  (RTC_CNTL_SLP_VAL_LO_V << RTC_CNTL_SLP_VAL_LO_S)
#define RTC_CNTL_SLP_VAL_LO_V  0xFFFFFFFFU
#define RTC_CNTL_SLP_VAL_LO_S  0

/** RTC_CNTL_SLP_TIMER1_REG register
 *  register description
 */
#define RTC_CNTL_SLP_TIMER1_REG (DR_REG_RTCCNTL_BASE + 0x8)
/** RTC_CNTL_SLP_VAL_HI : R/W; bitpos: [15:0]; default: 0;
 *  RTC sleep timer high 16 bits
 */
#define RTC_CNTL_SLP_VAL_HI    0x0000FFFFU
#define RTC_CNTL_SLP_VAL_HI_M  (RTC_CNTL_SLP_VAL_HI_V << RTC_CNTL_SLP_VAL_HI_S)
#define RTC_CNTL_SLP_VAL_HI_V  0x0000FFFFU
#define RTC_CNTL_SLP_VAL_HI_S  0
/** RTC_CNTL_MAIN_TIMER_ALARM_EN : WO; bitpos: [16]; default: 0;
 *  timer alarm enable bit
 */
#define RTC_CNTL_MAIN_TIMER_ALARM_EN    (BIT(16))
#define RTC_CNTL_MAIN_TIMER_ALARM_EN_M  (RTC_CNTL_MAIN_TIMER_ALARM_EN_V << RTC_CNTL_MAIN_TIMER_ALARM_EN_S)
#define RTC_CNTL_MAIN_TIMER_ALARM_EN_V  0x00000001U
#define RTC_CNTL_MAIN_TIMER_ALARM_EN_S  16

