espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_TIME_UPDATE_REG register
 *  register description
 */
#define RTC_CNTL_TIME_UPDATE_REG (DR_REG_RTCCNTL_BASE + 0xc)
/** RTC_CNTL_TIMER_SYS_STALL : R/W; bitpos: [27]; default: 0;
 *  Enable to record system stall time
 */
#define RTC_CNTL_TIMER_SYS_STALL    (BIT(27))
#define RTC_CNTL_TIMER_SYS_STALL_M  (RTC_CNTL_TIMER_SYS_STALL_V << RTC_CNTL_TIMER_SYS_STALL_S)
#define RTC_CNTL_TIMER_SYS_STALL_V  0x00000001U
#define RTC_CNTL_TIMER_SYS_STALL_S  27
/** RTC_CNTL_TIMER_XTL_OFF : R/W; bitpos: [28]; default: 0;
 *  Enable to record 40M XTAL OFF time
 */
#define RTC_CNTL_TIMER_XTL_OFF    (BIT(28))
#define RTC_CNTL_TIMER_XTL_OFF_M  (RTC_CNTL_TIMER_XTL_OFF_V << RTC_CNTL_TIMER_XTL_OFF_S)
#define RTC_CNTL_TIMER_XTL_OFF_V  0x00000001U
#define RTC_CNTL_TIMER_XTL_OFF_S  28
/** RTC_CNTL_TIMER_SYS_RST : R/W; bitpos: [29]; default: 0;
 *  enable to record system reset time
 */
#define RTC_CNTL_TIMER_SYS_RST    (BIT(29))
#define RTC_CNTL_TIMER_SYS_RST_M  (RTC_CNTL_TIMER_SYS_RST_V << RTC_CNTL_TIMER_SYS_RST_S)
#define RTC_CNTL_TIMER_SYS_RST_V  0x00000001U
#define RTC_CNTL_TIMER_SYS_RST_S  29
/** RTC_CNTL_TIME_UPDATE : WO; bitpos: [31]; default: 0;
 *  Set 1: to update register with RTC timer
 */
#define RTC_CNTL_TIME_UPDATE    (BIT(31))
#define RTC_CNTL_TIME_UPDATE_M  (RTC_CNTL_TIME_UPDATE_V << RTC_CNTL_TIME_UPDATE_S)
#define RTC_CNTL_TIME_UPDATE_V  0x00000001U
#define RTC_CNTL_TIME_UPDATE_S  31

/** RTC_CNTL_TIME_LOW0_REG register
 *  register description
 */
#define RTC_CNTL_TIME_LOW0_REG (DR_REG_RTCCNTL_BASE + 0x10)
/** RTC_CNTL_TIMER_VALUE0_LOW : RO; bitpos: [31:0]; default: 0;
 *  RTC timer low 32 bits
 */
#define RTC_CNTL_TIMER_VALUE0_LOW    0xFFFFFFFFU
#define RTC_CNTL_TIMER_VALUE0_LOW_M  (RTC_CNTL_TIMER_VALUE0_LOW_V << RTC_CNTL_TIMER_VALUE0_LOW_S)
#define RTC_CNTL_TIMER_VALUE0_LOW_V  0xFFFFFFFFU
#define RTC_CNTL_TIMER_VALUE0_LOW_S  0

/** RTC_CNTL_TIME_HIGH0_REG register
 *  register description
 */
#define RTC_CNTL_TIME_HIGH0_REG (DR_REG_RTCCNTL_BASE + 0x14)
/** RTC_CNTL_TIMER_VALUE0_HIGH : RO; bitpos: [15:0]; default: 0;
 *  RTC timer high 16 bits
 */
#define RTC_CNTL_TIMER_VALUE0_HIGH    0x0000FFFFU
#define RTC_CNTL_TIMER_VALUE0_HIGH_M  (RTC_CNTL_TIMER_VALUE0_HIGH_V << RTC_CNTL_TIMER_VALUE0_HIGH_S)
#define RTC_CNTL_TIMER_VALUE0_HIGH_V  0x0000FFFFU
#define RTC_CNTL_TIMER_VALUE0_HIGH_S  0

/** RTC_CNTL_STATE0_REG register
 *  register description
 */
#define RTC_CNTL_STATE0_REG (DR_REG_RTCCNTL_BASE + 0x18)
/** RTC_CNTL_SW_CPU_INT : WO; bitpos: [0]; default: 0;
 *  rtc software interrupt to main cpu
 */
#define RTC_CNTL_SW_CPU_INT    (BIT(0))
#define RTC_CNTL_SW_CPU_INT_M  (RTC_CNTL_SW_CPU_INT_V << RTC_CNTL_SW_CPU_INT_S)
#define RTC_CNTL_SW_CPU_INT_V  0x00000001U
#define RTC_CNTL_SW_CPU_INT_S  0
/** RTC_CNTL_SLP_REJECT_CAUSE_CLR : WO; bitpos: [1]; default: 0;
 *  clear rtc sleep reject cause
 */
#define RTC_CNTL_SLP_REJECT_CAUSE_CLR    (BIT(1))
#define RTC_CNTL_SLP_REJECT_CAUSE_CLR_M  (RTC_CNTL_SLP_REJECT_CAUSE_CLR_V << RTC_CNTL_SLP_REJECT_CAUSE_CLR_S)
#define RTC_CNTL_SLP_REJECT_CAUSE_CLR_V  0x00000001U
#define RTC_CNTL_SLP_REJECT_CAUSE_CLR_S  1
/** RTC_CNTL_APB2RTC_BRIDGE_SEL : R/W; bitpos: [22]; default: 0;
 *  1: APB to RTC using bridge,  0: APB to RTC using sync
 */
#define RTC_CNTL_APB2RTC_BRIDGE_SEL    (BIT(22))
#define RTC_CNTL_APB2RTC_BRIDGE_SEL_M  (RTC_CNTL_APB2RTC_BRIDGE_SEL_V << RTC_CNTL_APB2RTC_BRIDGE_SEL_S)
#define RTC_CNTL_APB2RTC_BRIDGE_SEL_V  0x00000001U
#define RTC_CNTL_APB2RTC_BRIDGE_SEL_S  22
/** RTC_CNTL_SDIO_ACTIVE_IND : RO; bitpos: [28]; default: 0;
 *  SDIO active indication
 */
#define RTC_CNTL_SDIO_ACTIVE_IND    (BIT(28))
#define RTC_CNTL_SDIO_ACTIVE_IND_M  (RTC_CNTL_SDIO_ACTIVE_IND_V << RTC_CNTL_SDIO_ACTIVE_IND_S)
#define RTC_CNTL_SDIO_ACTIVE_IND_V  0x00000001U
#define RTC_CNTL_SDIO_ACTIVE_IND_S  28
/** RTC_CNTL_SLP_WAKEUP : R/W; bitpos: [29]; default: 0;
 *  leep wakeup bit
 */
#define RTC_CNTL_SLP_WAKEUP    (BIT(29))
#define RTC_CNTL_SLP_WAKEUP_M  (RTC_CNTL_SLP_WAKEUP_V << RTC_CNTL_SLP_WAKEUP_S)
#define RTC_CNTL_SLP_WAKEUP_V  0x00000001U
#define RTC_CNTL_SLP_WAKEUP_S  29
/** RTC_CNTL_SLP_REJECT : R/W; bitpos: [30]; default: 0;
 *  leep reject bit
 */
#define RTC_CNTL_SLP_REJECT    (BIT(30))
#define RTC_CNTL_SLP_REJECT_M  (RTC_CNTL_SLP_REJECT_V << RTC_CNTL_SLP_REJECT_S)
#define RTC_CNTL_SLP_REJECT_V  0x00000001U
#define RTC_CNTL_SLP_REJECT_S  30
/** RTC_CNTL_SLEEP_EN : R/W; bitpos: [31]; default: 0;
 *  sleep enable bit
 */
#define RTC_CNTL_SLEEP_EN    (BIT(31))
#define RTC_CNTL_SLEEP_EN_M  (RTC_CNTL_SLEEP_EN_V << RTC_CNTL_SLEEP_EN_S)
#define RTC_CNTL_SLEEP_EN_V  0x00000001U
#define RTC_CNTL_SLEEP_EN_S  31

/** RTC_CNTL_TIMER1_REG register
 *  register description
 */
#define RTC_CNTL_TIMER1_REG (DR_REG_RTCCNTL_BASE + 0x1c)
/** RTC_CNTL_CPU_STALL_EN : R/W; bitpos: [0]; default: 1;
 *  CPU stall enable bit
 */
#define RTC_CNTL_CPU_STALL_EN    (BIT(0))
#define RTC_CNTL_CPU_STALL_EN_M  (RTC_CNTL_CPU_STALL_EN_V << RTC_CNTL_CPU_STALL_EN_S)
#define RTC_CNTL_CPU_STALL_EN_V  0x00000001U
#define RTC_CNTL_CPU_STALL_EN_S  0
/** RTC_CNTL_CPU_STALL_WAIT : R/W; bitpos: [5:1]; default: 1;
 *  CPU stall wait cycles in fast_clk_rtc
 */
#define RTC_CNTL_CPU_STALL_WAIT    0x0000001FU
#define RTC_CNTL_CPU_STALL_WAIT_M  (RTC_CNTL_CPU_STALL_WAIT_V << RTC_CNTL_CPU_STALL_WAIT_S)
#define RTC_CNTL_CPU_STALL_WAIT_V  0x0000001FU
#define RTC_CNTL_CPU_STALL_WAIT_S  1
/** RTC_CNTL_CK8M_WAIT : R/W; bitpos: [13:6]; default: 16;
 *  CK8M wait cycles in slow_clk_rtc
 */
#define RTC_CNTL_CK8M_WAIT    0x000000FFU
#define RTC_CNTL_CK8M_WAIT_M  (RTC_CNTL_CK8M_WAIT_V << RTC_CNTL_CK8M_WAIT_S)
#define RTC_CNTL_CK8M_WAIT_V  0x000000FFU
#define RTC_CNTL_CK8M_WAIT_S  6
/** RTC_CNTL_XTL_BUF_WAIT : R/W; bitpos: [23:14]; default: 80;
 *  XTAL wait cycles in slow_clk_rtc
 */
#define RTC_CNTL_XTL_BUF_WAIT    0x000003FFU
#define RTC_CNTL_XTL_BUF_WAIT_M  (RTC_CNTL_XTL_BUF_WAIT_V << RTC_CNTL_XTL_BUF_WAIT_S)
#define RTC_CNTL_XTL_BUF_WAIT_V  0x000003FFU
#define RTC_CNTL_XTL_BUF_WAIT_S  14
/** RTC_CNTL_PLL_BUF_WAIT : R/W; bitpos: [31:24]; default: 40;
 *  PLL wait cycles in slow_clk_rtc
 */
#define RTC_CNTL_PLL_BUF_WAIT    0x000000FFU
#define RTC_CNTL_PLL_BUF_WAIT_M  (RTC_CNTL_PLL_BUF_WAIT_V << RTC_CNTL_PLL_BUF_WAIT_S)
#define RTC_CNTL_PLL_BUF_WAIT_V  0x000000FFU
#define RTC_CNTL_PLL_BUF_WAIT_S  24

/** RTC_CNTL_TIMER2_REG register
 *  register description
 */
#define RTC_CNTL_TIMER2_REG (DR_REG_RTCCNTL_BASE + 0x20)
/** RTC_CNTL_MIN_TIME_CK8M_OFF : R/W; bitpos: [31:24]; default: 1;
 *  minimal cycles in slow_clk_rtc for CK8M in power down state
 */
#define RTC_CNTL_MIN_TIME_CK8M_OFF    0x000000FFU
#define RTC_CNTL_MIN_TIME_CK8M_OFF_M  (RTC_CNTL_MIN_TIME_CK8M_OFF_V << RTC_CNTL_MIN_TIME_CK8M_OFF_S)
#define RTC_CNTL_MIN_TIME_CK8M_OFF_V  0x000000FFU
#define RTC_CNTL_MIN_TIME_CK8M_OFF_S  24

