espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_TIMER3_REG register
 *  register description
 */
#define RTC_CNTL_TIMER3_REG (DR_REG_RTCCNTL_BASE + 0x24)
/** RTC_CNTL_WIFI_WAIT_TIMER : R/W; bitpos: [8:0]; default: 8;
 *  Need add description
 */
#define RTC_CNTL_WIFI_WAIT_TIMER    0x000001FFU
#define RTC_CNTL_WIFI_WAIT_TIMER_M  (RTC_CNTL_WIFI_WAIT_TIMER_V << RTC_CNTL_WIFI_WAIT_TIMER_S)
#define RTC_CNTL_WIFI_WAIT_TIMER_V  0x000001FFU
#define RTC_CNTL_WIFI_WAIT_TIMER_S  0
/** RTC_CNTL_WIFI_POWERUP_TIMER : R/W; bitpos: [15:9]; default: 5;
 *  Need add description
 */
#define RTC_CNTL_WIFI_POWERUP_TIMER    0x0000007FU
#define RTC_CNTL_WIFI_POWERUP_TIMER_M  (RTC_CNTL_WIFI_POWERUP_TIMER_V << RTC_CNTL_WIFI_POWERUP_TIMER_S)
#define RTC_CNTL_WIFI_POWERUP_TIMER_V  0x0000007FU
#define RTC_CNTL_WIFI_POWERUP_TIMER_S  9
/** RTC_CNTL_BT_WAIT_TIMER : R/W; bitpos: [24:16]; default: 8;
 *  Need add description
 */
#define RTC_CNTL_BT_WAIT_TIMER    0x000001FFU
#define RTC_CNTL_BT_WAIT_TIMER_M  (RTC_CNTL_BT_WAIT_TIMER_V << RTC_CNTL_BT_WAIT_TIMER_S)
#define RTC_CNTL_BT_WAIT_TIMER_V  0x000001FFU
#define RTC_CNTL_BT_WAIT_TIMER_S  16
/** RTC_CNTL_BT_POWERUP_TIMER : R/W; bitpos: [31:25]; default: 5;
 *  Need add description
 */
#define RTC_CNTL_BT_POWERUP_TIMER    0x0000007FU
#define RTC_CNTL_BT_POWERUP_TIMER_M  (RTC_CNTL_BT_POWERUP_TIMER_V << RTC_CNTL_BT_POWERUP_TIMER_S)
#define RTC_CNTL_BT_POWERUP_TIMER_V  0x0000007FU
#define RTC_CNTL_BT_POWERUP_TIMER_S  25

/** RTC_CNTL_TIMER4_REG register
 *  register description
 */
#define RTC_CNTL_TIMER4_REG (DR_REG_RTCCNTL_BASE + 0x28)
/** RTC_CNTL_CPU_TOP_WAIT_TIMER : R/W; bitpos: [8:0]; default: 8;
 *  Need add description
 */
#define RTC_CNTL_CPU_TOP_WAIT_TIMER    0x000001FFU
#define RTC_CNTL_CPU_TOP_WAIT_TIMER_M  (RTC_CNTL_CPU_TOP_WAIT_TIMER_V << RTC_CNTL_CPU_TOP_WAIT_TIMER_S)
#define RTC_CNTL_CPU_TOP_WAIT_TIMER_V  0x000001FFU
#define RTC_CNTL_CPU_TOP_WAIT_TIMER_S  0
/** RTC_CNTL_CPU_TOP_POWERUP_TIMER : R/W; bitpos: [15:9]; default: 5;
 *  Need add description
 */
#define RTC_CNTL_CPU_TOP_POWERUP_TIMER    0x0000007FU
#define RTC_CNTL_CPU_TOP_POWERUP_TIMER_M  (RTC_CNTL_CPU_TOP_POWERUP_TIMER_V << RTC_CNTL_CPU_TOP_POWERUP_TIMER_S)
#define RTC_CNTL_CPU_TOP_POWERUP_TIMER_V  0x0000007FU
#define RTC_CNTL_CPU_TOP_POWERUP_TIMER_S  9
/** RTC_CNTL_DG_WRAP_WAIT_TIMER : R/W; bitpos: [24:16]; default: 32;
 *  Need add description
 */
#define RTC_CNTL_DG_WRAP_WAIT_TIMER    0x000001FFU
#define RTC_CNTL_DG_WRAP_WAIT_TIMER_M  (RTC_CNTL_DG_WRAP_WAIT_TIMER_V << RTC_CNTL_DG_WRAP_WAIT_TIMER_S)
#define RTC_CNTL_DG_WRAP_WAIT_TIMER_V  0x000001FFU
#define RTC_CNTL_DG_WRAP_WAIT_TIMER_S  16
/** RTC_CNTL_DG_WRAP_POWERUP_TIMER : R/W; bitpos: [31:25]; default: 8;
 *  Need add description
 */
#define RTC_CNTL_DG_WRAP_POWERUP_TIMER    0x0000007FU
#define RTC_CNTL_DG_WRAP_POWERUP_TIMER_M  (RTC_CNTL_DG_WRAP_POWERUP_TIMER_V << RTC_CNTL_DG_WRAP_POWERUP_TIMER_S)
#define RTC_CNTL_DG_WRAP_POWERUP_TIMER_V  0x0000007FU
#define RTC_CNTL_DG_WRAP_POWERUP_TIMER_S  25

/** RTC_CNTL_TIMER5_REG register
 *  register description
 */
#define RTC_CNTL_TIMER5_REG (DR_REG_RTCCNTL_BASE + 0x2c)
/** RTC_CNTL_MIN_SLP_VAL : R/W; bitpos: [15:8]; default: 128;
 *  minimal sleep cycles in slow_clk_rtc
 */
#define RTC_CNTL_MIN_SLP_VAL    0x000000FFU
#define RTC_CNTL_MIN_SLP_VAL_M  (RTC_CNTL_MIN_SLP_VAL_V << RTC_CNTL_MIN_SLP_VAL_S)
#define RTC_CNTL_MIN_SLP_VAL_V  0x000000FFU
#define RTC_CNTL_MIN_SLP_VAL_S  8

/** RTC_CNTL_TIMER6_REG register
 *  register description
 */
#define RTC_CNTL_TIMER6_REG (DR_REG_RTCCNTL_BASE + 0x30)
/** RTC_CNTL_DG_PERI_WAIT_TIMER : R/W; bitpos: [24:16]; default: 8;
 *  Need add description
 */
#define RTC_CNTL_DG_PERI_WAIT_TIMER    0x000001FFU
#define RTC_CNTL_DG_PERI_WAIT_TIMER_M  (RTC_CNTL_DG_PERI_WAIT_TIMER_V << RTC_CNTL_DG_PERI_WAIT_TIMER_S)
#define RTC_CNTL_DG_PERI_WAIT_TIMER_V  0x000001FFU
#define RTC_CNTL_DG_PERI_WAIT_TIMER_S  16
/** RTC_CNTL_DG_PERI_POWERUP_TIMER : R/W; bitpos: [31:25]; default: 5;
 *  Need add description
 */
#define RTC_CNTL_DG_PERI_POWERUP_TIMER    0x0000007FU
#define RTC_CNTL_DG_PERI_POWERUP_TIMER_M  (RTC_CNTL_DG_PERI_POWERUP_TIMER_V << RTC_CNTL_DG_PERI_POWERUP_TIMER_S)
#define RTC_CNTL_DG_PERI_POWERUP_TIMER_V  0x0000007FU
#define RTC_CNTL_DG_PERI_POWERUP_TIMER_S  25

/** RTC_CNTL_ANA_CONF_REG register
 *  register description
 */
#define RTC_CNTL_ANA_CONF_REG (DR_REG_RTCCNTL_BASE + 0x34)
/** RTC_CNTL_XPD_TRX_FORCE_PD : R/W; bitpos: [16]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XPD_TRX_FORCE_PD    (BIT(16))
#define RTC_CNTL_XPD_TRX_FORCE_PD_M  (RTC_CNTL_XPD_TRX_FORCE_PD_V << RTC_CNTL_XPD_TRX_FORCE_PD_S)
#define RTC_CNTL_XPD_TRX_FORCE_PD_V  0x00000001U
#define RTC_CNTL_XPD_TRX_FORCE_PD_S  16
/** RTC_CNTL_XPD_TRX_FORCE_PU : R/W; bitpos: [17]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_XPD_TRX_FORCE_PU    (BIT(17))
#define RTC_CNTL_XPD_TRX_FORCE_PU_M  (RTC_CNTL_XPD_TRX_FORCE_PU_V << RTC_CNTL_XPD_TRX_FORCE_PU_S)
#define RTC_CNTL_XPD_TRX_FORCE_PU_V  0x00000001U
#define RTC_CNTL_XPD_TRX_FORCE_PU_S  17
/** RTC_CNTL_I2C_RESET_POR_FORCE_PD : R/W; bitpos: [18]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_I2C_RESET_POR_FORCE_PD    (BIT(18))
#define RTC_CNTL_I2C_RESET_POR_FORCE_PD_M  (RTC_CNTL_I2C_RESET_POR_FORCE_PD_V << RTC_CNTL_I2C_RESET_POR_FORCE_PD_S)
#define RTC_CNTL_I2C_RESET_POR_FORCE_PD_V  0x00000001U
#define RTC_CNTL_I2C_RESET_POR_FORCE_PD_S  18
/** RTC_CNTL_I2C_RESET_POR_FORCE_PU : R/W; bitpos: [19]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_I2C_RESET_POR_FORCE_PU    (BIT(19))
#define RTC_CNTL_I2C_RESET_POR_FORCE_PU_M  (RTC_CNTL_I2C_RESET_POR_FORCE_PU_V << RTC_CNTL_I2C_RESET_POR_FORCE_PU_S)
#define RTC_CNTL_I2C_RESET_POR_FORCE_PU_V  0x00000001U
#define RTC_CNTL_I2C_RESET_POR_FORCE_PU_S  19
/** RTC_CNTL_GLITCH_RST_EN : R/W; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GLITCH_RST_EN    (BIT(20))
#define RTC_CNTL_GLITCH_RST_EN_M  (RTC_CNTL_GLITCH_RST_EN_V << RTC_CNTL_GLITCH_RST_EN_S)
#define RTC_CNTL_GLITCH_RST_EN_V  0x00000001U
#define RTC_CNTL_GLITCH_RST_EN_S  20
/** RTC_CNTL_PERI_I2C_PU : R/W; bitpos: [22]; default: 1;
 *  PLLA force power up
 */
#define RTC_CNTL_PERI_I2C_PU    (BIT(22))
#define RTC_CNTL_PERI_I2C_PU_M  (RTC_CNTL_PERI_I2C_PU_V << RTC_CNTL_PERI_I2C_PU_S)
#define RTC_CNTL_PERI_I2C_PU_V  0x00000001U
#define RTC_CNTL_PERI_I2C_PU_S  22

#define RTC_CNTL_SAR_I2C_PU     RTC_CNTL_PERI_I2C_PU
#define RTC_CNTL_SAR_I2C_PU_V   RTC_CNTL_PERI_I2C_PU_M
#define RTC_CNTL_SAR_I2C_PU_M   RTC_CNTL_PERI_I2C_PU_V
#define RTC_CNTL_SAR_I2C_PU_S   RTC_CNTL_PERI_I2C_PU_S
/** RTC_CNTL_PLLA_FORCE_PD : R/W; bitpos: [23]; default: 1;
 *  PLLA force power down
 */
#define RTC_CNTL_PLLA_FORCE_PD    (BIT(23))
#define RTC_CNTL_PLLA_FORCE_PD_M  (RTC_CNTL_PLLA_FORCE_PD_V << RTC_CNTL_PLLA_FORCE_PD_S)
#define RTC_CNTL_PLLA_FORCE_PD_V  0x00000001U
#define RTC_CNTL_PLLA_FORCE_PD_S  23
/** RTC_CNTL_PLLA_FORCE_PU : R/W; bitpos: [24]; default: 0;
 *  PLLA force power up
 */
#define RTC_CNTL_PLLA_FORCE_PU    (BIT(24))
#define RTC_CNTL_PLLA_FORCE_PU_M  (RTC_CNTL_PLLA_FORCE_PU_V << RTC_CNTL_PLLA_FORCE_PU_S)
#define RTC_CNTL_PLLA_FORCE_PU_V  0x00000001U
#define RTC_CNTL_PLLA_FORCE_PU_S  24
/** RTC_CNTL_BBPLL_CAL_SLP_START : R/W; bitpos: [25]; default: 0;
 *  start BBPLL calibration during sleep
 */
#define RTC_CNTL_BBPLL_CAL_SLP_START    (BIT(25))
#define RTC_CNTL_BBPLL_CAL_SLP_START_M  (RTC_CNTL_BBPLL_CAL_SLP_START_V << RTC_CNTL_BBPLL_CAL_SLP_START_S)
#define RTC_CNTL_BBPLL_CAL_SLP_START_V  0x00000001U
#define RTC_CNTL_BBPLL_CAL_SLP_START_S  25
/** RTC_CNTL_PVTMON_PU : R/W; bitpos: [26]; default: 0;
 *  1: PVTMON power up , otherwise power down
 */
#define RTC_CNTL_PVTMON_PU    (BIT(26))
#define RTC_CNTL_PVTMON_PU_M  (RTC_CNTL_PVTMON_PU_V << RTC_CNTL_PVTMON_PU_S)
#define RTC_CNTL_PVTMON_PU_V  0x00000001U
#define RTC_CNTL_PVTMON_PU_S  26
/** RTC_CNTL_TXRF_I2C_PU : R/W; bitpos: [27]; default: 0;
 *  1: TXRF_I2C power up , otherwise power down
 */
#define RTC_CNTL_TXRF_I2C_PU    (BIT(27))
#define RTC_CNTL_TXRF_I2C_PU_M  (RTC_CNTL_TXRF_I2C_PU_V << RTC_CNTL_TXRF_I2C_PU_S)
#define RTC_CNTL_TXRF_I2C_PU_V  0x00000001U
#define RTC_CNTL_TXRF_I2C_PU_S  27
/** RTC_CNTL_RFRX_PBUS_PU : R/W; bitpos: [28]; default: 0;
 *  1: RFRX_PBUS power up , otherwise power down
 */
#define RTC_CNTL_RFRX_PBUS_PU    (BIT(28))
#define RTC_CNTL_RFRX_PBUS_PU_M  (RTC_CNTL_RFRX_PBUS_PU_V << RTC_CNTL_RFRX_PBUS_PU_S)
#define RTC_CNTL_RFRX_PBUS_PU_V  0x00000001U
#define RTC_CNTL_RFRX_PBUS_PU_S  28
/** RTC_CNTL_CKGEN_I2C_PU : R/W; bitpos: [30]; default: 0;
 *  1: CKGEN_I2C power up , otherwise power down
 */
#define RTC_CNTL_CKGEN_I2C_PU    (BIT(30))
#define RTC_CNTL_CKGEN_I2C_PU_M  (RTC_CNTL_CKGEN_I2C_PU_V << RTC_CNTL_CKGEN_I2C_PU_S)
#define RTC_CNTL_CKGEN_I2C_PU_V  0x00000001U
#define RTC_CNTL_CKGEN_I2C_PU_S  30
/** RTC_CNTL_PLL_I2C_PU : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_PLL_I2C_PU    (BIT(31))
#define RTC_CNTL_PLL_I2C_PU_M  (RTC_CNTL_PLL_I2C_PU_V << RTC_CNTL_PLL_I2C_PU_S)
#define RTC_CNTL_PLL_I2C_PU_V  0x00000001U
#define RTC_CNTL_PLL_I2C_PU_S  31

/** RTC_CNTL_RESET_STATE_REG register
 *  register description
 */
#define RTC_CNTL_RESET_STATE_REG (DR_REG_RTCCNTL_BASE + 0x38)
/** RTC_CNTL_RESET_CAUSE_PROCPU : RO; bitpos: [5:0]; default: 0;
 *  reset cause of PRO CPU
 */
#define RTC_CNTL_RESET_CAUSE_PROCPU    0x0000003FU
#define RTC_CNTL_RESET_CAUSE_PROCPU_M  (RTC_CNTL_RESET_CAUSE_PROCPU_V << RTC_CNTL_RESET_CAUSE_PROCPU_S)
#define RTC_CNTL_RESET_CAUSE_PROCPU_V  0x0000003FU
#define RTC_CNTL_RESET_CAUSE_PROCPU_S  0
/** RTC_CNTL_RESET_CAUSE_APPCPU : RO; bitpos: [11:6]; default: 0;
 *  reset cause of APP CPU
 */
#define RTC_CNTL_RESET_CAUSE_APPCPU    0x0000003FU
#define RTC_CNTL_RESET_CAUSE_APPCPU_M  (RTC_CNTL_RESET_CAUSE_APPCPU_V << RTC_CNTL_RESET_CAUSE_APPCPU_S)
#define RTC_CNTL_RESET_CAUSE_APPCPU_V  0x0000003FU
#define RTC_CNTL_RESET_CAUSE_APPCPU_S  6
/** RTC_CNTL_STAT_VECTOR_SEL_APPCPU : R/W; bitpos: [12]; default: 1;
 *  APP CPU state vector sel
 */
#define RTC_CNTL_STAT_VECTOR_SEL_APPCPU    (BIT(12))
#define RTC_CNTL_STAT_VECTOR_SEL_APPCPU_M  (RTC_CNTL_STAT_VECTOR_SEL_APPCPU_V << RTC_CNTL_STAT_VECTOR_SEL_APPCPU_S)
#define RTC_CNTL_STAT_VECTOR_SEL_APPCPU_V  0x00000001U
#define RTC_CNTL_STAT_VECTOR_SEL_APPCPU_S  12
/** RTC_CNTL_STAT_VECTOR_SEL_PROCPU : R/W; bitpos: [13]; default: 1;
 *  PRO CPU state vector sel
 */
#define RTC_CNTL_STAT_VECTOR_SEL_PROCPU    (BIT(13))
#define RTC_CNTL_STAT_VECTOR_SEL_PROCPU_M  (RTC_CNTL_STAT_VECTOR_SEL_PROCPU_V << RTC_CNTL_STAT_VECTOR_SEL_PROCPU_S)
#define RTC_CNTL_STAT_VECTOR_SEL_PROCPU_V  0x00000001U
#define RTC_CNTL_STAT_VECTOR_SEL_PROCPU_S  13
/** RTC_CNTL_ALL_RESET_FLAG_PROCPU : RO; bitpos: [14]; default: 0;
 *  PRO CPU reset_flag
 */
#define RTC_CNTL_ALL_RESET_FLAG_PROCPU    (BIT(14))
#define RTC_CNTL_ALL_RESET_FLAG_PROCPU_M  (RTC_CNTL_ALL_RESET_FLAG_PROCPU_V << RTC_CNTL_ALL_RESET_FLAG_PROCPU_S)
#define RTC_CNTL_ALL_RESET_FLAG_PROCPU_V  0x00000001U
#define RTC_CNTL_ALL_RESET_FLAG_PROCPU_S  14
/** RTC_CNTL_ALL_RESET_FLAG_APPCPU : RO; bitpos: [15]; default: 0;
 *  APP CPU reset flag
 */
#define RTC_CNTL_ALL_RESET_FLAG_APPCPU    (BIT(15))
#define RTC_CNTL_ALL_RESET_FLAG_APPCPU_M  (RTC_CNTL_ALL_RESET_FLAG_APPCPU_V << RTC_CNTL_ALL_RESET_FLAG_APPCPU_S)
#define RTC_CNTL_ALL_RESET_FLAG_APPCPU_V  0x00000001U
#define RTC_CNTL_ALL_RESET_FLAG_APPCPU_S  15
/** RTC_CNTL_ALL_RESET_FLAG_CLR_PROCPU : WO; bitpos: [16]; default: 0;
 *  clear PRO CPU reset_flag
 */
#define RTC_CNTL_ALL_RESET_FLAG_CLR_PROCPU    (BIT(16))
#define RTC_CNTL_ALL_RESET_FLAG_CLR_PROCPU_M  (RTC_CNTL_ALL_RESET_FLAG_CLR_PROCPU_V << RTC_CNTL_ALL_RESET_FLAG_CLR_PROCPU_S)
#define RTC_CNTL_ALL_RESET_FLAG_CLR_PROCPU_V  0x00000001U
#define RTC_CNTL_ALL_RESET_FLAG_CLR_PROCPU_S  16
/** RTC_CNTL_ALL_RESET_FLAG_CLR_APPCPU : WO; bitpos: [17]; default: 0;
 *  clear APP CPU reset flag
 */
#define RTC_CNTL_ALL_RESET_FLAG_CLR_APPCPU    (BIT(17))
#define RTC_CNTL_ALL_RESET_FLAG_CLR_APPCPU_M  (RTC_CNTL_ALL_RESET_FLAG_CLR_APPCPU_V << RTC_CNTL_ALL_RESET_FLAG_CLR_APPCPU_S)
#define RTC_CNTL_ALL_RESET_FLAG_CLR_APPCPU_V  0x00000001U
#define RTC_CNTL_ALL_RESET_FLAG_CLR_APPCPU_S  17
/** RTC_CNTL_OCD_HALT_ON_RESET_APPCPU : R/W; bitpos: [18]; default: 0;
 *  APPCPU OcdHaltOnReset
 */
#define RTC_CNTL_OCD_HALT_ON_RESET_APPCPU    (BIT(18))
#define RTC_CNTL_OCD_HALT_ON_RESET_APPCPU_M  (RTC_CNTL_OCD_HALT_ON_RESET_APPCPU_V << RTC_CNTL_OCD_HALT_ON_RESET_APPCPU_S)
#define RTC_CNTL_OCD_HALT_ON_RESET_APPCPU_V  0x00000001U
#define RTC_CNTL_OCD_HALT_ON_RESET_APPCPU_S  18
/** RTC_CNTL_OCD_HALT_ON_RESET_PROCPU : R/W; bitpos: [19]; default: 0;
 *  PROCPU OcdHaltOnReset
 */
#define RTC_CNTL_OCD_HALT_ON_RESET_PROCPU    (BIT(19))
#define RTC_CNTL_OCD_HALT_ON_RESET_PROCPU_M  (RTC_CNTL_OCD_HALT_ON_RESET_PROCPU_V << RTC_CNTL_OCD_HALT_ON_RESET_PROCPU_S)
#define RTC_CNTL_OCD_HALT_ON_RESET_PROCPU_V  0x00000001U
#define RTC_CNTL_OCD_HALT_ON_RESET_PROCPU_S  19
/** RTC_CNTL_JTAG_RESET_FLAG_PROCPU : RO; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_JTAG_RESET_FLAG_PROCPU    (BIT(20))
#define RTC_CNTL_JTAG_RESET_FLAG_PROCPU_M  (RTC_CNTL_JTAG_RESET_FLAG_PROCPU_V << RTC_CNTL_JTAG_RESET_FLAG_PROCPU_S)
#define RTC_CNTL_JTAG_RESET_FLAG_PROCPU_V  0x00000001U
#define RTC_CNTL_JTAG_RESET_FLAG_PROCPU_S  20
/** RTC_CNTL_JTAG_RESET_FLAG_APPCPU : RO; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_JTAG_RESET_FLAG_APPCPU    (BIT(21))
#define RTC_CNTL_JTAG_RESET_FLAG_APPCPU_M  (RTC_CNTL_JTAG_RESET_FLAG_APPCPU_V << RTC_CNTL_JTAG_RESET_FLAG_APPCPU_S)
#define RTC_CNTL_JTAG_RESET_FLAG_APPCPU_V  0x00000001U
#define RTC_CNTL_JTAG_RESET_FLAG_APPCPU_S  21
/** RTC_CNTL_JTAG_RESET_FLAG_CLR_PROCPU : WO; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_JTAG_RESET_FLAG_CLR_PROCPU    (BIT(22))
#define RTC_CNTL_JTAG_RESET_FLAG_CLR_PROCPU_M  (RTC_CNTL_JTAG_RESET_FLAG_CLR_PROCPU_V << RTC_CNTL_JTAG_RESET_FLAG_CLR_PROCPU_S)
#define RTC_CNTL_JTAG_RESET_FLAG_CLR_PROCPU_V  0x00000001U
#define RTC_CNTL_JTAG_RESET_FLAG_CLR_PROCPU_S  22
/** RTC_CNTL_JTAG_RESET_FLAG_CLR_APPCPU : WO; bitpos: [23]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_JTAG_RESET_FLAG_CLR_APPCPU    (BIT(23))
#define RTC_CNTL_JTAG_RESET_FLAG_CLR_APPCPU_M  (RTC_CNTL_JTAG_RESET_FLAG_CLR_APPCPU_V << RTC_CNTL_JTAG_RESET_FLAG_CLR_APPCPU_S)
#define RTC_CNTL_JTAG_RESET_FLAG_CLR_APPCPU_V  0x00000001U
#define RTC_CNTL_JTAG_RESET_FLAG_CLR_APPCPU_S  23
/** RTC_CNTL_DRESET_MASK_APPCPU : R/W; bitpos: [24]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DRESET_MASK_APPCPU    (BIT(24))
#define RTC_CNTL_DRESET_MASK_APPCPU_M  (RTC_CNTL_DRESET_MASK_APPCPU_V << RTC_CNTL_DRESET_MASK_APPCPU_S)
#define RTC_CNTL_DRESET_MASK_APPCPU_V  0x00000001U
#define RTC_CNTL_DRESET_MASK_APPCPU_S  24
/** RTC_CNTL_DRESET_MASK_PROCPU : R/W; bitpos: [25]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DRESET_MASK_PROCPU    (BIT(25))
#define RTC_CNTL_DRESET_MASK_PROCPU_M  (RTC_CNTL_DRESET_MASK_PROCPU_V << RTC_CNTL_DRESET_MASK_PROCPU_S)
#define RTC_CNTL_DRESET_MASK_PROCPU_V  0x00000001U
#define RTC_CNTL_DRESET_MASK_PROCPU_S  25

/** RTC_CNTL_WAKEUP_STATE_REG register
 *  register description
 */
#define RTC_CNTL_WAKEUP_STATE_REG (DR_REG_RTCCNTL_BASE + 0x3c)
/** RTC_CNTL_WAKEUP_ENA : R/W; bitpos: [31:13]; default: 12;
 *  wakeup enable bitmap
 */
#define RTC_CNTL_WAKEUP_ENA    0x0007FFFFU
#define RTC_CNTL_WAKEUP_ENA_M  (RTC_CNTL_WAKEUP_ENA_V << RTC_CNTL_WAKEUP_ENA_S)
#define RTC_CNTL_WAKEUP_ENA_V  0x0007FFFFU
#define RTC_CNTL_WAKEUP_ENA_S  13

/** RTC_CNTL_INT_ENA_REG register
 *  register description
 */
#define RTC_CNTL_INT_ENA_REG (DR_REG_RTCCNTL_BASE + 0x40)
/** RTC_CNTL_SLP_WAKEUP_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  enable sleep wakeup interrupt
 */
#define RTC_CNTL_SLP_WAKEUP_INT_ENA    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_M  (RTC_CNTL_SLP_WAKEUP_INT_ENA_V << RTC_CNTL_SLP_WAKEUP_INT_ENA_S)
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_V  0x00000001U
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_S  0
/** RTC_CNTL_SLP_REJECT_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  enable sleep reject interrupt
 */
#define RTC_CNTL_SLP_REJECT_INT_ENA    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_M  (RTC_CNTL_SLP_REJECT_INT_ENA_V << RTC_CNTL_SLP_REJECT_INT_ENA_S)
#define RTC_CNTL_SLP_REJECT_INT_ENA_V  0x00000001U
#define RTC_CNTL_SLP_REJECT_INT_ENA_S  1
/** RTC_CNTL_WDT_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  enable RTC WDT interrupt
 */
#define RTC_CNTL_WDT_INT_ENA    (BIT(3))
#define RTC_CNTL_WDT_INT_ENA_M  (RTC_CNTL_WDT_INT_ENA_V << RTC_CNTL_WDT_INT_ENA_S)
#define RTC_CNTL_WDT_INT_ENA_V  0x00000001U
#define RTC_CNTL_WDT_INT_ENA_S  3
/** RTC_CNTL_BROWN_OUT_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  enable brown out interrupt
 */
#define RTC_CNTL_BROWN_OUT_INT_ENA    (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_ENA_M  (RTC_CNTL_BROWN_OUT_INT_ENA_V << RTC_CNTL_BROWN_OUT_INT_ENA_S)
#define RTC_CNTL_BROWN_OUT_INT_ENA_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_INT_ENA_S  9
/** RTC_CNTL_MAIN_TIMER_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  enable RTC main timer interrupt
 */
#define RTC_CNTL_MAIN_TIMER_INT_ENA    (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_ENA_M  (RTC_CNTL_MAIN_TIMER_INT_ENA_V << RTC_CNTL_MAIN_TIMER_INT_ENA_S)
#define RTC_CNTL_MAIN_TIMER_INT_ENA_V  0x00000001U
#define RTC_CNTL_MAIN_TIMER_INT_ENA_S  10
/** RTC_CNTL_SWD_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  enable super watch dog interrupt
 */
#define RTC_CNTL_SWD_INT_ENA    (BIT(15))
#define RTC_CNTL_SWD_INT_ENA_M  (RTC_CNTL_SWD_INT_ENA_V << RTC_CNTL_SWD_INT_ENA_S)
#define RTC_CNTL_SWD_INT_ENA_V  0x00000001U
#define RTC_CNTL_SWD_INT_ENA_S  15
/** RTC_CNTL_XTAL32K_DEAD_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  enable xtal32k_dead  interrupt
 */
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA    (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_M  (RTC_CNTL_XTAL32K_DEAD_INT_ENA_V << RTC_CNTL_XTAL32K_DEAD_INT_ENA_S)
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_V  0x00000001U
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_S  16
/** RTC_CNTL_GLITCH_DET_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  enbale gitch det interrupt
 */
#define RTC_CNTL_GLITCH_DET_INT_ENA    (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_ENA_M  (RTC_CNTL_GLITCH_DET_INT_ENA_V << RTC_CNTL_GLITCH_DET_INT_ENA_S)
#define RTC_CNTL_GLITCH_DET_INT_ENA_V  0x00000001U
#define RTC_CNTL_GLITCH_DET_INT_ENA_S  19
/** RTC_CNTL_BBPLL_CAL_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BBPLL_CAL_INT_ENA    (BIT(20))
#define RTC_CNTL_BBPLL_CAL_INT_ENA_M  (RTC_CNTL_BBPLL_CAL_INT_ENA_V << RTC_CNTL_BBPLL_CAL_INT_ENA_S)
#define RTC_CNTL_BBPLL_CAL_INT_ENA_V  0x00000001U
#define RTC_CNTL_BBPLL_CAL_INT_ENA_S  20
/** RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA : RW; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA    (BIT(21))
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_M  (RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_V << RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_S)
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_V  0x00000001U
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_S  21
/** RTC_CNTL_VSET_DCDC_DONE_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA    (BIT(22))
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_M  (RTC_CNTL_VSET_DCDC_DONE_INT_ENA_V << RTC_CNTL_VSET_DCDC_DONE_INT_ENA_S)
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_S  22

/** RTC_CNTL_INT_RAW_REG register
 *  register description
 */
#define RTC_CNTL_INT_RAW_REG (DR_REG_RTCCNTL_BASE + 0x44)
/** RTC_CNTL_SLP_WAKEUP_INT_RAW : RO; bitpos: [0]; default: 0;
 *  sleep wakeup interrupt raw
 */
#define RTC_CNTL_SLP_WAKEUP_INT_RAW    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_RAW_M  (RTC_CNTL_SLP_WAKEUP_INT_RAW_V << RTC_CNTL_SLP_WAKEUP_INT_RAW_S)
#define RTC_CNTL_SLP_WAKEUP_INT_RAW_V  0x00000001U
#define RTC_CNTL_SLP_WAKEUP_INT_RAW_S  0
/** RTC_CNTL_SLP_REJECT_INT_RAW : RO; bitpos: [1]; default: 0;
 *  sleep reject interrupt raw
 */
#define RTC_CNTL_SLP_REJECT_INT_RAW    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_RAW_M  (RTC_CNTL_SLP_REJECT_INT_RAW_V << RTC_CNTL_SLP_REJECT_INT_RAW_S)
#define RTC_CNTL_SLP_REJECT_INT_RAW_V  0x00000001U
#define RTC_CNTL_SLP_REJECT_INT_RAW_S  1
/** RTC_CNTL_WDT_INT_RAW : RO; bitpos: [3]; default: 0;
 *  RTC WDT interrupt raw
 */
#define RTC_CNTL_WDT_INT_RAW    (BIT(3))
#define RTC_CNTL_WDT_INT_RAW_M  (RTC_CNTL_WDT_INT_RAW_V << RTC_CNTL_WDT_INT_RAW_S)
#define RTC_CNTL_WDT_INT_RAW_V  0x00000001U
#define RTC_CNTL_WDT_INT_RAW_S  3
/** RTC_CNTL_BROWN_OUT_INT_RAW : RO; bitpos: [9]; default: 0;
 *  brown out interrupt raw
 */
#define RTC_CNTL_BROWN_OUT_INT_RAW    (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_RAW_M  (RTC_CNTL_BROWN_OUT_INT_RAW_V << RTC_CNTL_BROWN_OUT_INT_RAW_S)
#define RTC_CNTL_BROWN_OUT_INT_RAW_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_INT_RAW_S  9
/** RTC_CNTL_MAIN_TIMER_INT_RAW : RO; bitpos: [10]; default: 0;
 *  RTC main timer interrupt raw
 */
#define RTC_CNTL_MAIN_TIMER_INT_RAW    (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_RAW_M  (RTC_CNTL_MAIN_TIMER_INT_RAW_V << RTC_CNTL_MAIN_TIMER_INT_RAW_S)
#define RTC_CNTL_MAIN_TIMER_INT_RAW_V  0x00000001U
#define RTC_CNTL_MAIN_TIMER_INT_RAW_S  10
/** RTC_CNTL_SWD_INT_RAW : RO; bitpos: [15]; default: 0;
 *  super watch dog interrupt raw
 */
#define RTC_CNTL_SWD_INT_RAW    (BIT(15))
#define RTC_CNTL_SWD_INT_RAW_M  (RTC_CNTL_SWD_INT_RAW_V << RTC_CNTL_SWD_INT_RAW_S)
#define RTC_CNTL_SWD_INT_RAW_V  0x00000001U
#define RTC_CNTL_SWD_INT_RAW_S  15
/** RTC_CNTL_XTAL32K_DEAD_INT_RAW : RO; bitpos: [16]; default: 0;
 *  xtal32k dead detection interrupt raw
 */
#define RTC_CNTL_XTAL32K_DEAD_INT_RAW    (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_RAW_M  (RTC_CNTL_XTAL32K_DEAD_INT_RAW_V << RTC_CNTL_XTAL32K_DEAD_INT_RAW_S)
#define RTC_CNTL_XTAL32K_DEAD_INT_RAW_V  0x00000001U
#define RTC_CNTL_XTAL32K_DEAD_INT_RAW_S  16
/** RTC_CNTL_GLITCH_DET_INT_RAW : RO; bitpos: [19]; default: 0;
 *  glitch_det_interrupt_raw
 */
#define RTC_CNTL_GLITCH_DET_INT_RAW    (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_RAW_M  (RTC_CNTL_GLITCH_DET_INT_RAW_V << RTC_CNTL_GLITCH_DET_INT_RAW_S)
#define RTC_CNTL_GLITCH_DET_INT_RAW_V  0x00000001U
#define RTC_CNTL_GLITCH_DET_INT_RAW_S  19
/** RTC_CNTL_BBPLL_CAL_INT_RAW : RO; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BBPLL_CAL_INT_RAW    (BIT(20))
#define RTC_CNTL_BBPLL_CAL_INT_RAW_M  (RTC_CNTL_BBPLL_CAL_INT_RAW_V << RTC_CNTL_BBPLL_CAL_INT_RAW_S)
#define RTC_CNTL_BBPLL_CAL_INT_RAW_V  0x00000001U
#define RTC_CNTL_BBPLL_CAL_INT_RAW_S  20
/** RTC_CNTL_BLE_COMPARE_WAKE_INT_RAW : RO; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_RAW    (BIT(21))
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_RAW_M  (RTC_CNTL_BLE_COMPARE_WAKE_INT_RAW_V << RTC_CNTL_BLE_COMPARE_WAKE_INT_RAW_S)
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_RAW_V  0x00000001U
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_RAW_S  21
/** RTC_CNTL_VSET_DCDC_DONE_INT_RAW : RO; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_DONE_INT_RAW    (BIT(22))
#define RTC_CNTL_VSET_DCDC_DONE_INT_RAW_M  (RTC_CNTL_VSET_DCDC_DONE_INT_RAW_V << RTC_CNTL_VSET_DCDC_DONE_INT_RAW_S)
#define RTC_CNTL_VSET_DCDC_DONE_INT_RAW_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_DONE_INT_RAW_S  22

