espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_INT_ST_REG register
 *  register description
 */
#define RTC_CNTL_INT_ST_REG (DR_REG_RTCCNTL_BASE + 0x48)
/** RTC_CNTL_SLP_WAKEUP_INT_ST : RO; bitpos: [0]; default: 0;
 *  sleep wakeup interrupt state
 */
#define RTC_CNTL_SLP_WAKEUP_INT_ST    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ST_M  (RTC_CNTL_SLP_WAKEUP_INT_ST_V << RTC_CNTL_SLP_WAKEUP_INT_ST_S)
#define RTC_CNTL_SLP_WAKEUP_INT_ST_V  0x00000001U
#define RTC_CNTL_SLP_WAKEUP_INT_ST_S  0
/** RTC_CNTL_SLP_REJECT_INT_ST : RO; bitpos: [1]; default: 0;
 *  sleep reject interrupt state
 */
#define RTC_CNTL_SLP_REJECT_INT_ST    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ST_M  (RTC_CNTL_SLP_REJECT_INT_ST_V << RTC_CNTL_SLP_REJECT_INT_ST_S)
#define RTC_CNTL_SLP_REJECT_INT_ST_V  0x00000001U
#define RTC_CNTL_SLP_REJECT_INT_ST_S  1
/** RTC_CNTL_WDT_INT_ST : RO; bitpos: [3]; default: 0;
 *  RTC WDT interrupt state
 */
#define RTC_CNTL_WDT_INT_ST    (BIT(3))
#define RTC_CNTL_WDT_INT_ST_M  (RTC_CNTL_WDT_INT_ST_V << RTC_CNTL_WDT_INT_ST_S)
#define RTC_CNTL_WDT_INT_ST_V  0x00000001U
#define RTC_CNTL_WDT_INT_ST_S  3
/** RTC_CNTL_BROWN_OUT_INT_ST : RO; bitpos: [9]; default: 0;
 *  brown out interrupt state
 */
#define RTC_CNTL_BROWN_OUT_INT_ST    (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_ST_M  (RTC_CNTL_BROWN_OUT_INT_ST_V << RTC_CNTL_BROWN_OUT_INT_ST_S)
#define RTC_CNTL_BROWN_OUT_INT_ST_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_INT_ST_S  9
/** RTC_CNTL_MAIN_TIMER_INT_ST : RO; bitpos: [10]; default: 0;
 *  RTC main timer interrupt state
 */
#define RTC_CNTL_MAIN_TIMER_INT_ST    (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_ST_M  (RTC_CNTL_MAIN_TIMER_INT_ST_V << RTC_CNTL_MAIN_TIMER_INT_ST_S)
#define RTC_CNTL_MAIN_TIMER_INT_ST_V  0x00000001U
#define RTC_CNTL_MAIN_TIMER_INT_ST_S  10
/** RTC_CNTL_SWD_INT_ST : RO; bitpos: [15]; default: 0;
 *  super watch dog interrupt state
 */
#define RTC_CNTL_SWD_INT_ST    (BIT(15))
#define RTC_CNTL_SWD_INT_ST_M  (RTC_CNTL_SWD_INT_ST_V << RTC_CNTL_SWD_INT_ST_S)
#define RTC_CNTL_SWD_INT_ST_V  0x00000001U
#define RTC_CNTL_SWD_INT_ST_S  15
/** RTC_CNTL_XTAL32K_DEAD_INT_ST : RO; bitpos: [16]; default: 0;
 *  xtal32k dead detection interrupt state
 */
#define RTC_CNTL_XTAL32K_DEAD_INT_ST    (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_ST_M  (RTC_CNTL_XTAL32K_DEAD_INT_ST_V << RTC_CNTL_XTAL32K_DEAD_INT_ST_S)
#define RTC_CNTL_XTAL32K_DEAD_INT_ST_V  0x00000001U
#define RTC_CNTL_XTAL32K_DEAD_INT_ST_S  16
/** RTC_CNTL_GLITCH_DET_INT_ST : RO; bitpos: [19]; default: 0;
 *  glitch_det_interrupt state
 */
#define RTC_CNTL_GLITCH_DET_INT_ST    (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_ST_M  (RTC_CNTL_GLITCH_DET_INT_ST_V << RTC_CNTL_GLITCH_DET_INT_ST_S)
#define RTC_CNTL_GLITCH_DET_INT_ST_V  0x00000001U
#define RTC_CNTL_GLITCH_DET_INT_ST_S  19
/** RTC_CNTL_BBPLL_CAL_INT_ST : RO; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BBPLL_CAL_INT_ST    (BIT(20))
#define RTC_CNTL_BBPLL_CAL_INT_ST_M  (RTC_CNTL_BBPLL_CAL_INT_ST_V << RTC_CNTL_BBPLL_CAL_INT_ST_S)
#define RTC_CNTL_BBPLL_CAL_INT_ST_V  0x00000001U
#define RTC_CNTL_BBPLL_CAL_INT_ST_S  20
/** RTC_CNTL_BLE_COMPARE_WAKE_INT_ST : RO; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ST    (BIT(21))
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ST_M  (RTC_CNTL_BLE_COMPARE_WAKE_INT_ST_V << RTC_CNTL_BLE_COMPARE_WAKE_INT_ST_S)
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ST_V  0x00000001U
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ST_S  21
/** RTC_CNTL_VSET_DCDC_DONE_INT_ST : RO; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_DONE_INT_ST    (BIT(22))
#define RTC_CNTL_VSET_DCDC_DONE_INT_ST_M  (RTC_CNTL_VSET_DCDC_DONE_INT_ST_V << RTC_CNTL_VSET_DCDC_DONE_INT_ST_S)
#define RTC_CNTL_VSET_DCDC_DONE_INT_ST_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_DONE_INT_ST_S  22

/** RTC_CNTL_INT_CLR_REG register
 *  register description
 */
#define RTC_CNTL_INT_CLR_REG (DR_REG_RTCCNTL_BASE + 0x4c)
/** RTC_CNTL_SLP_WAKEUP_INT_CLR : WO; bitpos: [0]; default: 0;
 *  Clear sleep wakeup interrupt state
 */
#define RTC_CNTL_SLP_WAKEUP_INT_CLR    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_CLR_M  (RTC_CNTL_SLP_WAKEUP_INT_CLR_V << RTC_CNTL_SLP_WAKEUP_INT_CLR_S)
#define RTC_CNTL_SLP_WAKEUP_INT_CLR_V  0x00000001U
#define RTC_CNTL_SLP_WAKEUP_INT_CLR_S  0
/** RTC_CNTL_SLP_REJECT_INT_CLR : WO; bitpos: [1]; default: 0;
 *  Clear sleep reject interrupt state
 */
#define RTC_CNTL_SLP_REJECT_INT_CLR    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_CLR_M  (RTC_CNTL_SLP_REJECT_INT_CLR_V << RTC_CNTL_SLP_REJECT_INT_CLR_S)
#define RTC_CNTL_SLP_REJECT_INT_CLR_V  0x00000001U
#define RTC_CNTL_SLP_REJECT_INT_CLR_S  1
/** RTC_CNTL_WDT_INT_CLR : WO; bitpos: [3]; default: 0;
 *  Clear RTC WDT interrupt state
 */
#define RTC_CNTL_WDT_INT_CLR    (BIT(3))
#define RTC_CNTL_WDT_INT_CLR_M  (RTC_CNTL_WDT_INT_CLR_V << RTC_CNTL_WDT_INT_CLR_S)
#define RTC_CNTL_WDT_INT_CLR_V  0x00000001U
#define RTC_CNTL_WDT_INT_CLR_S  3
/** RTC_CNTL_BROWN_OUT_INT_CLR : WO; bitpos: [9]; default: 0;
 *  Clear brown out interrupt state
 */
#define RTC_CNTL_BROWN_OUT_INT_CLR    (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_CLR_M  (RTC_CNTL_BROWN_OUT_INT_CLR_V << RTC_CNTL_BROWN_OUT_INT_CLR_S)
#define RTC_CNTL_BROWN_OUT_INT_CLR_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_INT_CLR_S  9
/** RTC_CNTL_MAIN_TIMER_INT_CLR : WO; bitpos: [10]; default: 0;
 *  Clear RTC main timer interrupt state
 */
#define RTC_CNTL_MAIN_TIMER_INT_CLR    (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_CLR_M  (RTC_CNTL_MAIN_TIMER_INT_CLR_V << RTC_CNTL_MAIN_TIMER_INT_CLR_S)
#define RTC_CNTL_MAIN_TIMER_INT_CLR_V  0x00000001U
#define RTC_CNTL_MAIN_TIMER_INT_CLR_S  10
/** RTC_CNTL_SWD_INT_CLR : WO; bitpos: [15]; default: 0;
 *  Clear super watch dog interrupt state
 */
#define RTC_CNTL_SWD_INT_CLR    (BIT(15))
#define RTC_CNTL_SWD_INT_CLR_M  (RTC_CNTL_SWD_INT_CLR_V << RTC_CNTL_SWD_INT_CLR_S)
#define RTC_CNTL_SWD_INT_CLR_V  0x00000001U
#define RTC_CNTL_SWD_INT_CLR_S  15
/** RTC_CNTL_XTAL32K_DEAD_INT_CLR : WO; bitpos: [16]; default: 0;
 *  Clear RTC WDT interrupt state
 */
#define RTC_CNTL_XTAL32K_DEAD_INT_CLR    (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_CLR_M  (RTC_CNTL_XTAL32K_DEAD_INT_CLR_V << RTC_CNTL_XTAL32K_DEAD_INT_CLR_S)
#define RTC_CNTL_XTAL32K_DEAD_INT_CLR_V  0x00000001U
#define RTC_CNTL_XTAL32K_DEAD_INT_CLR_S  16
/** RTC_CNTL_GLITCH_DET_INT_CLR : WO; bitpos: [19]; default: 0;
 *  Clear glitch det interrupt state
 */
#define RTC_CNTL_GLITCH_DET_INT_CLR    (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_CLR_M  (RTC_CNTL_GLITCH_DET_INT_CLR_V << RTC_CNTL_GLITCH_DET_INT_CLR_S)
#define RTC_CNTL_GLITCH_DET_INT_CLR_V  0x00000001U
#define RTC_CNTL_GLITCH_DET_INT_CLR_S  19
/** RTC_CNTL_BBPLL_CAL_INT_CLR : WO; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BBPLL_CAL_INT_CLR    (BIT(20))
#define RTC_CNTL_BBPLL_CAL_INT_CLR_M  (RTC_CNTL_BBPLL_CAL_INT_CLR_V << RTC_CNTL_BBPLL_CAL_INT_CLR_S)
#define RTC_CNTL_BBPLL_CAL_INT_CLR_V  0x00000001U
#define RTC_CNTL_BBPLL_CAL_INT_CLR_S  20
/** RTC_CNTL_BLE_COMPARE_WAKE_INT_CLR : WO; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_CLR    (BIT(21))
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_CLR_M  (RTC_CNTL_BLE_COMPARE_WAKE_INT_CLR_V << RTC_CNTL_BLE_COMPARE_WAKE_INT_CLR_S)
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_CLR_V  0x00000001U
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_CLR_S  21
/** RTC_CNTL_VSET_DCDC_DONE_INT_CLR : WO; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_DONE_INT_CLR    (BIT(22))
#define RTC_CNTL_VSET_DCDC_DONE_INT_CLR_M  (RTC_CNTL_VSET_DCDC_DONE_INT_CLR_V << RTC_CNTL_VSET_DCDC_DONE_INT_CLR_S)
#define RTC_CNTL_VSET_DCDC_DONE_INT_CLR_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_DONE_INT_CLR_S  22

/** RTC_CNTL_STORE0_REG register
 *  register description
 */
#define RTC_CNTL_STORE0_REG (DR_REG_RTCCNTL_BASE + 0x50)
/** RTC_CNTL_SCRATCH0 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SCRATCH0    0xFFFFFFFFU
#define RTC_CNTL_SCRATCH0_M  (RTC_CNTL_SCRATCH0_V << RTC_CNTL_SCRATCH0_S)
#define RTC_CNTL_SCRATCH0_V  0xFFFFFFFFU
#define RTC_CNTL_SCRATCH0_S  0

