espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_STORE1_REG register
 *  register description
 */
#define RTC_CNTL_STORE1_REG (DR_REG_RTCCNTL_BASE + 0x54)
/** RTC_CNTL_SCRATCH1 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SCRATCH1    0xFFFFFFFFU
#define RTC_CNTL_SCRATCH1_M  (RTC_CNTL_SCRATCH1_V << RTC_CNTL_SCRATCH1_S)
#define RTC_CNTL_SCRATCH1_V  0xFFFFFFFFU
#define RTC_CNTL_SCRATCH1_S  0

/** RTC_CNTL_STORE2_REG register
 *  register description
 */
#define RTC_CNTL_STORE2_REG (DR_REG_RTCCNTL_BASE + 0x58)
/** RTC_CNTL_SCRATCH2 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SCRATCH2    0xFFFFFFFFU
#define RTC_CNTL_SCRATCH2_M  (RTC_CNTL_SCRATCH2_V << RTC_CNTL_SCRATCH2_S)
#define RTC_CNTL_SCRATCH2_V  0xFFFFFFFFU
#define RTC_CNTL_SCRATCH2_S  0

/** RTC_CNTL_STORE3_REG register
 *  register description
 */
#define RTC_CNTL_STORE3_REG (DR_REG_RTCCNTL_BASE + 0x5c)
/** RTC_CNTL_SCRATCH3 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SCRATCH3    0xFFFFFFFFU
#define RTC_CNTL_SCRATCH3_M  (RTC_CNTL_SCRATCH3_V << RTC_CNTL_SCRATCH3_S)
#define RTC_CNTL_SCRATCH3_V  0xFFFFFFFFU
#define RTC_CNTL_SCRATCH3_S  0

/** RTC_CNTL_EXT_XTL_CONF_REG register
 *  register description
 */
#define RTC_CNTL_EXT_XTL_CONF_REG (DR_REG_RTCCNTL_BASE + 0x60)
/** RTC_CNTL_XTAL32K_WDT_EN : R/W; bitpos: [0]; default: 0;
 *  xtal 32k watch dog enable
 */
#define RTC_CNTL_XTAL32K_WDT_EN    (BIT(0))
#define RTC_CNTL_XTAL32K_WDT_EN_M  (RTC_CNTL_XTAL32K_WDT_EN_V << RTC_CNTL_XTAL32K_WDT_EN_S)
#define RTC_CNTL_XTAL32K_WDT_EN_V  0x00000001U
#define RTC_CNTL_XTAL32K_WDT_EN_S  0
/** RTC_CNTL_XTAL32K_WDT_CLK_FO : R/W; bitpos: [1]; default: 0;
 *  xtal 32k watch dog clock force on
 */
#define RTC_CNTL_XTAL32K_WDT_CLK_FO    (BIT(1))
#define RTC_CNTL_XTAL32K_WDT_CLK_FO_M  (RTC_CNTL_XTAL32K_WDT_CLK_FO_V << RTC_CNTL_XTAL32K_WDT_CLK_FO_S)
#define RTC_CNTL_XTAL32K_WDT_CLK_FO_V  0x00000001U
#define RTC_CNTL_XTAL32K_WDT_CLK_FO_S  1
/** RTC_CNTL_XTAL32K_WDT_RESET : R/W; bitpos: [2]; default: 0;
 *  xtal 32k watch dog sw reset
 */
#define RTC_CNTL_XTAL32K_WDT_RESET    (BIT(2))
#define RTC_CNTL_XTAL32K_WDT_RESET_M  (RTC_CNTL_XTAL32K_WDT_RESET_V << RTC_CNTL_XTAL32K_WDT_RESET_S)
#define RTC_CNTL_XTAL32K_WDT_RESET_V  0x00000001U
#define RTC_CNTL_XTAL32K_WDT_RESET_S  2
/** RTC_CNTL_XTAL32K_EXT_CLK_FO : R/W; bitpos: [3]; default: 0;
 *  xtal 32k external xtal clock force on
 */
#define RTC_CNTL_XTAL32K_EXT_CLK_FO    (BIT(3))
#define RTC_CNTL_XTAL32K_EXT_CLK_FO_M  (RTC_CNTL_XTAL32K_EXT_CLK_FO_V << RTC_CNTL_XTAL32K_EXT_CLK_FO_S)
#define RTC_CNTL_XTAL32K_EXT_CLK_FO_V  0x00000001U
#define RTC_CNTL_XTAL32K_EXT_CLK_FO_S  3
/** RTC_CNTL_XTAL32K_AUTO_BACKUP : R/W; bitpos: [4]; default: 0;
 *  xtal 32k switch to back up clock when xtal is dead
 */
#define RTC_CNTL_XTAL32K_AUTO_BACKUP    (BIT(4))
#define RTC_CNTL_XTAL32K_AUTO_BACKUP_M  (RTC_CNTL_XTAL32K_AUTO_BACKUP_V << RTC_CNTL_XTAL32K_AUTO_BACKUP_S)
#define RTC_CNTL_XTAL32K_AUTO_BACKUP_V  0x00000001U
#define RTC_CNTL_XTAL32K_AUTO_BACKUP_S  4
/** RTC_CNTL_XTAL32K_AUTO_RESTART : R/W; bitpos: [5]; default: 0;
 *  xtal 32k restart xtal when xtal is dead
 */
#define RTC_CNTL_XTAL32K_AUTO_RESTART    (BIT(5))
#define RTC_CNTL_XTAL32K_AUTO_RESTART_M  (RTC_CNTL_XTAL32K_AUTO_RESTART_V << RTC_CNTL_XTAL32K_AUTO_RESTART_S)
#define RTC_CNTL_XTAL32K_AUTO_RESTART_V  0x00000001U
#define RTC_CNTL_XTAL32K_AUTO_RESTART_S  5
/** RTC_CNTL_XTAL32K_AUTO_RETURN : R/W; bitpos: [6]; default: 0;
 *  xtal 32k switch back xtal when xtal is restarted
 */
#define RTC_CNTL_XTAL32K_AUTO_RETURN    (BIT(6))
#define RTC_CNTL_XTAL32K_AUTO_RETURN_M  (RTC_CNTL_XTAL32K_AUTO_RETURN_V << RTC_CNTL_XTAL32K_AUTO_RETURN_S)
#define RTC_CNTL_XTAL32K_AUTO_RETURN_V  0x00000001U
#define RTC_CNTL_XTAL32K_AUTO_RETURN_S  6
/** RTC_CNTL_XTAL32K_XPD_FORCE : R/W; bitpos: [7]; default: 1;
 *  Xtal 32k xpd control by sw or fsm
 */
#define RTC_CNTL_XTAL32K_XPD_FORCE    (BIT(7))
#define RTC_CNTL_XTAL32K_XPD_FORCE_M  (RTC_CNTL_XTAL32K_XPD_FORCE_V << RTC_CNTL_XTAL32K_XPD_FORCE_S)
#define RTC_CNTL_XTAL32K_XPD_FORCE_V  0x00000001U
#define RTC_CNTL_XTAL32K_XPD_FORCE_S  7
/** RTC_CNTL_ENCKINIT_XTAL_32K : R/W; bitpos: [8]; default: 0;
 *  apply an internal clock to help xtal 32k to start
 */
#define RTC_CNTL_ENCKINIT_XTAL_32K    (BIT(8))
#define RTC_CNTL_ENCKINIT_XTAL_32K_M  (RTC_CNTL_ENCKINIT_XTAL_32K_V << RTC_CNTL_ENCKINIT_XTAL_32K_S)
#define RTC_CNTL_ENCKINIT_XTAL_32K_V  0x00000001U
#define RTC_CNTL_ENCKINIT_XTAL_32K_S  8
/** RTC_CNTL_DBUF_XTAL_32K : R/W; bitpos: [9]; default: 0;
 *  0: single-end buffer 1: differential buffer
 */
#define RTC_CNTL_DBUF_XTAL_32K    (BIT(9))
#define RTC_CNTL_DBUF_XTAL_32K_M  (RTC_CNTL_DBUF_XTAL_32K_V << RTC_CNTL_DBUF_XTAL_32K_S)
#define RTC_CNTL_DBUF_XTAL_32K_V  0x00000001U
#define RTC_CNTL_DBUF_XTAL_32K_S  9
/** RTC_CNTL_DGM_XTAL_32K : R/W; bitpos: [12:10]; default: 3;
 *  xtal_32k gm control
 */
#define RTC_CNTL_DGM_XTAL_32K    0x00000007U
#define RTC_CNTL_DGM_XTAL_32K_M  (RTC_CNTL_DGM_XTAL_32K_V << RTC_CNTL_DGM_XTAL_32K_S)
#define RTC_CNTL_DGM_XTAL_32K_V  0x00000007U
#define RTC_CNTL_DGM_XTAL_32K_S  10
/** RTC_CNTL_DRES_XTAL_32K : R/W; bitpos: [15:13]; default: 3;
 *  DRES_XTAL_32K
 */
#define RTC_CNTL_DRES_XTAL_32K    0x00000007U
#define RTC_CNTL_DRES_XTAL_32K_M  (RTC_CNTL_DRES_XTAL_32K_V << RTC_CNTL_DRES_XTAL_32K_S)
#define RTC_CNTL_DRES_XTAL_32K_V  0x00000007U
#define RTC_CNTL_DRES_XTAL_32K_S  13
/** RTC_CNTL_XPD_XTAL_32K : R/W; bitpos: [16]; default: 0;
 *  XPD_XTAL_32K
 */
#define RTC_CNTL_XPD_XTAL_32K    (BIT(16))
#define RTC_CNTL_XPD_XTAL_32K_M  (RTC_CNTL_XPD_XTAL_32K_V << RTC_CNTL_XPD_XTAL_32K_S)
#define RTC_CNTL_XPD_XTAL_32K_V  0x00000001U
#define RTC_CNTL_XPD_XTAL_32K_S  16
/** RTC_CNTL_DAC_XTAL_32K : R/W; bitpos: [19:17]; default: 3;
 *  DAC_XTAL_32K
 */
#define RTC_CNTL_DAC_XTAL_32K    0x00000007U
#define RTC_CNTL_DAC_XTAL_32K_M  (RTC_CNTL_DAC_XTAL_32K_V << RTC_CNTL_DAC_XTAL_32K_S)
#define RTC_CNTL_DAC_XTAL_32K_V  0x00000007U
#define RTC_CNTL_DAC_XTAL_32K_S  17
/** RTC_CNTL_WDT_STATE : RO; bitpos: [22:20]; default: 0;
 *  state of 32k_wdt
 */
#define RTC_CNTL_WDT_STATE    0x00000007U
#define RTC_CNTL_WDT_STATE_M  (RTC_CNTL_WDT_STATE_V << RTC_CNTL_WDT_STATE_S)
#define RTC_CNTL_WDT_STATE_V  0x00000007U
#define RTC_CNTL_WDT_STATE_S  20
/** RTC_CNTL_XTAL32K_GPIO_SEL : R/W; bitpos: [23]; default: 0;
 *  XTAL_32K sel. 0: external XTAL_32K, 1: CLK from RTC pad X32P_C
 */
#define RTC_CNTL_XTAL32K_GPIO_SEL    (BIT(23))
#define RTC_CNTL_XTAL32K_GPIO_SEL_M  (RTC_CNTL_XTAL32K_GPIO_SEL_V << RTC_CNTL_XTAL32K_GPIO_SEL_S)
#define RTC_CNTL_XTAL32K_GPIO_SEL_V  0x00000001U
#define RTC_CNTL_XTAL32K_GPIO_SEL_S  23
/** RTC_CNTL_XTL_EXT_CTR_LV : R/W; bitpos: [30]; default: 0;
 *  0: power down XTAL at high level, 1: power down XTAL at low level
 */
#define RTC_CNTL_XTL_EXT_CTR_LV    (BIT(30))
#define RTC_CNTL_XTL_EXT_CTR_LV_M  (RTC_CNTL_XTL_EXT_CTR_LV_V << RTC_CNTL_XTL_EXT_CTR_LV_S)
#define RTC_CNTL_XTL_EXT_CTR_LV_V  0x00000001U
#define RTC_CNTL_XTL_EXT_CTR_LV_S  30
/** RTC_CNTL_XTL_EXT_CTR_EN : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XTL_EXT_CTR_EN    (BIT(31))
#define RTC_CNTL_XTL_EXT_CTR_EN_M  (RTC_CNTL_XTL_EXT_CTR_EN_V << RTC_CNTL_XTL_EXT_CTR_EN_S)
#define RTC_CNTL_XTL_EXT_CTR_EN_V  0x00000001U
#define RTC_CNTL_XTL_EXT_CTR_EN_S  31

/** RTC_CNTL_EXT_WAKEUP_CONF_REG register
 *  register description
 */
#define RTC_CNTL_EXT_WAKEUP_CONF_REG (DR_REG_RTCCNTL_BASE + 0x64)
/** RTC_CNTL_GPIO_WAKEUP_FILTER : R/W; bitpos: [31]; default: 0;
 *  enable filter for gpio wakeup event
 */
#define RTC_CNTL_GPIO_WAKEUP_FILTER    (BIT(31))
#define RTC_CNTL_GPIO_WAKEUP_FILTER_M  (RTC_CNTL_GPIO_WAKEUP_FILTER_V << RTC_CNTL_GPIO_WAKEUP_FILTER_S)
#define RTC_CNTL_GPIO_WAKEUP_FILTER_V  0x00000001U
#define RTC_CNTL_GPIO_WAKEUP_FILTER_S  31

/** RTC_CNTL_SLP_REJECT_CONF_REG register
 *  register description
 */
#define RTC_CNTL_SLP_REJECT_CONF_REG (DR_REG_RTCCNTL_BASE + 0x68)
/** RTC_CNTL_SLEEP_REJECT_ENA : R/W; bitpos: [29:11]; default: 0;
 *  sleep reject enable
 */
#define RTC_CNTL_SLEEP_REJECT_ENA    0x0007FFFFU
#define RTC_CNTL_SLEEP_REJECT_ENA_M  (RTC_CNTL_SLEEP_REJECT_ENA_V << RTC_CNTL_SLEEP_REJECT_ENA_S)
#define RTC_CNTL_SLEEP_REJECT_ENA_V  0x0007FFFFU
#define RTC_CNTL_SLEEP_REJECT_ENA_S  11
/** RTC_CNTL_LIGHT_SLP_REJECT_EN : R/W; bitpos: [30]; default: 0;
 *  enable reject for light sleep
 */
#define RTC_CNTL_LIGHT_SLP_REJECT_EN    (BIT(30))
#define RTC_CNTL_LIGHT_SLP_REJECT_EN_M  (RTC_CNTL_LIGHT_SLP_REJECT_EN_V << RTC_CNTL_LIGHT_SLP_REJECT_EN_S)
#define RTC_CNTL_LIGHT_SLP_REJECT_EN_V  0x00000001U
#define RTC_CNTL_LIGHT_SLP_REJECT_EN_S  30
/** RTC_CNTL_DEEP_SLP_REJECT_EN : R/W; bitpos: [31]; default: 0;
 *  enable reject for deep sleep
 */
#define RTC_CNTL_DEEP_SLP_REJECT_EN    (BIT(31))
#define RTC_CNTL_DEEP_SLP_REJECT_EN_M  (RTC_CNTL_DEEP_SLP_REJECT_EN_V << RTC_CNTL_DEEP_SLP_REJECT_EN_S)
#define RTC_CNTL_DEEP_SLP_REJECT_EN_V  0x00000001U
#define RTC_CNTL_DEEP_SLP_REJECT_EN_S  31

/** RTC_CNTL_CPU_PERIOD_CONF_REG register
 *  register description
 */
#define RTC_CNTL_CPU_PERIOD_CONF_REG (DR_REG_RTCCNTL_BASE + 0x6c)
/** RTC_CNTL_CPUSEL_CONF : R/W; bitpos: [29]; default: 0;
 *  CPU sel option
 */
#define RTC_CNTL_CPUSEL_CONF    (BIT(29))
#define RTC_CNTL_CPUSEL_CONF_M  (RTC_CNTL_CPUSEL_CONF_V << RTC_CNTL_CPUSEL_CONF_S)
#define RTC_CNTL_CPUSEL_CONF_V  0x00000001U
#define RTC_CNTL_CPUSEL_CONF_S  29
/** RTC_CNTL_CPUPERIOD_SEL : R/W; bitpos: [31:30]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_CPUPERIOD_SEL    0x00000003U
#define RTC_CNTL_CPUPERIOD_SEL_M  (RTC_CNTL_CPUPERIOD_SEL_V << RTC_CNTL_CPUPERIOD_SEL_S)
#define RTC_CNTL_CPUPERIOD_SEL_V  0x00000003U
#define RTC_CNTL_CPUPERIOD_SEL_S  30

/** RTC_CNTL_CLK_CONF_REG register
 *  register description
 */
#define RTC_CNTL_CLK_CONF_REG (DR_REG_RTCCNTL_BASE + 0x70)
/** RTC_CNTL_BLE_TMR_RST : R/W; bitpos: [0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BLE_TMR_RST    (BIT(0))
#define RTC_CNTL_BLE_TMR_RST_M  (RTC_CNTL_BLE_TMR_RST_V << RTC_CNTL_BLE_TMR_RST_S)
#define RTC_CNTL_BLE_TMR_RST_V  0x00000001U
#define RTC_CNTL_BLE_TMR_RST_S  0
/** RTC_CNTL_EFUSE_CLK_FORCE_GATING : R/W; bitpos: [1]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_EFUSE_CLK_FORCE_GATING    (BIT(1))
#define RTC_CNTL_EFUSE_CLK_FORCE_GATING_M  (RTC_CNTL_EFUSE_CLK_FORCE_GATING_V << RTC_CNTL_EFUSE_CLK_FORCE_GATING_S)
#define RTC_CNTL_EFUSE_CLK_FORCE_GATING_V  0x00000001U
#define RTC_CNTL_EFUSE_CLK_FORCE_GATING_S  1
/** RTC_CNTL_EFUSE_CLK_FORCE_NOGATING : R/W; bitpos: [2]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_EFUSE_CLK_FORCE_NOGATING    (BIT(2))
#define RTC_CNTL_EFUSE_CLK_FORCE_NOGATING_M  (RTC_CNTL_EFUSE_CLK_FORCE_NOGATING_V << RTC_CNTL_EFUSE_CLK_FORCE_NOGATING_S)
#define RTC_CNTL_EFUSE_CLK_FORCE_NOGATING_V  0x00000001U
#define RTC_CNTL_EFUSE_CLK_FORCE_NOGATING_S  2
/** RTC_CNTL_CK8M_DIV_SEL_VLD : R/W; bitpos: [3]; default: 1;
 *  used to sync reg_ck8m_div_sel bus. Clear vld before set reg_ck8m_div_sel, then set
 *  vld to actually switch the clk
 */
#define RTC_CNTL_CK8M_DIV_SEL_VLD    (BIT(3))
#define RTC_CNTL_CK8M_DIV_SEL_VLD_M  (RTC_CNTL_CK8M_DIV_SEL_VLD_V << RTC_CNTL_CK8M_DIV_SEL_VLD_S)
#define RTC_CNTL_CK8M_DIV_SEL_VLD_V  0x00000001U
#define RTC_CNTL_CK8M_DIV_SEL_VLD_S  3
/** RTC_CNTL_DIG_XTAL32K_EN : R/W; bitpos: [4]; default: 0;
 *  enable CK_XTAL_32K for digital core (no relationship with RTC core)
 */
#define RTC_CNTL_DIG_XTAL32K_EN    (BIT(4))
#define RTC_CNTL_DIG_XTAL32K_EN_M  (RTC_CNTL_DIG_XTAL32K_EN_V << RTC_CNTL_DIG_XTAL32K_EN_S)
#define RTC_CNTL_DIG_XTAL32K_EN_V  0x00000001U
#define RTC_CNTL_DIG_XTAL32K_EN_S  4
/** RTC_CNTL_DIG_RC32K_EN : R/W; bitpos: [5]; default: 1;
 *  enable RC32K for digital core (no relationship with RTC core)
 */
#define RTC_CNTL_DIG_RC32K_EN    (BIT(5))
#define RTC_CNTL_DIG_RC32K_EN_M  (RTC_CNTL_DIG_RC32K_EN_V << RTC_CNTL_DIG_RC32K_EN_S)
#define RTC_CNTL_DIG_RC32K_EN_V  0x00000001U
#define RTC_CNTL_DIG_RC32K_EN_S  5
/** RTC_CNTL_DIG_CLK8M_EN : R/W; bitpos: [6]; default: 0;
 *  enable CK8M for digital core (no relationship with RTC core)
 */
#define RTC_CNTL_DIG_CLK8M_EN    (BIT(6))
#define RTC_CNTL_DIG_CLK8M_EN_M  (RTC_CNTL_DIG_CLK8M_EN_V << RTC_CNTL_DIG_CLK8M_EN_S)
#define RTC_CNTL_DIG_CLK8M_EN_V  0x00000001U
#define RTC_CNTL_DIG_CLK8M_EN_S  6
/** RTC_CNTL_BLE_TIMER_SEL : R/W; bitpos: [7]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BLE_TIMER_SEL    (BIT(7))
#define RTC_CNTL_BLE_TIMER_SEL_M  (RTC_CNTL_BLE_TIMER_SEL_V << RTC_CNTL_BLE_TIMER_SEL_S)
#define RTC_CNTL_BLE_TIMER_SEL_V  0x00000001U
#define RTC_CNTL_BLE_TIMER_SEL_S  7
/** RTC_CNTL_CK8M_DIV_SEL : R/W; bitpos: [12:10]; default: 3;
 *  divider = reg_ck8m_div_sel + 1
 */
#define RTC_CNTL_CK8M_DIV_SEL    0x00000007U
#define RTC_CNTL_CK8M_DIV_SEL_M  (RTC_CNTL_CK8M_DIV_SEL_V << RTC_CNTL_CK8M_DIV_SEL_S)
#define RTC_CNTL_CK8M_DIV_SEL_V  0x00000007U
#define RTC_CNTL_CK8M_DIV_SEL_S  10
/** RTC_CNTL_XTAL_FORCE_NOGATING : R/W; bitpos: [13]; default: 0;
 *  XTAL force no gating during sleep
 */
#define RTC_CNTL_XTAL_FORCE_NOGATING    (BIT(13))
#define RTC_CNTL_XTAL_FORCE_NOGATING_M  (RTC_CNTL_XTAL_FORCE_NOGATING_V << RTC_CNTL_XTAL_FORCE_NOGATING_S)
#define RTC_CNTL_XTAL_FORCE_NOGATING_V  0x00000001U
#define RTC_CNTL_XTAL_FORCE_NOGATING_S  13
/** RTC_CNTL_CK8M_FORCE_NOGATING : R/W; bitpos: [14]; default: 0;
 *  CK8M force no gating during sleep
 */
#define RTC_CNTL_CK8M_FORCE_NOGATING    (BIT(14))
#define RTC_CNTL_CK8M_FORCE_NOGATING_M  (RTC_CNTL_CK8M_FORCE_NOGATING_V << RTC_CNTL_CK8M_FORCE_NOGATING_S)
#define RTC_CNTL_CK8M_FORCE_NOGATING_V  0x00000001U
#define RTC_CNTL_CK8M_FORCE_NOGATING_S  14
/** RTC_CNTL_CK8M_DFREQ : R/W; bitpos: [24:15]; default: 600;
 *  CK8M_DFREQ
 */
#define RTC_CNTL_CK8M_DFREQ    0x000003FFU
#define RTC_CNTL_CK8M_DFREQ_M  (RTC_CNTL_CK8M_DFREQ_V << RTC_CNTL_CK8M_DFREQ_S)
#define RTC_CNTL_CK8M_DFREQ_V  0x000003FFU
#define RTC_CNTL_CK8M_DFREQ_S  15
/** RTC_CNTL_CK8M_FORCE_PD : R/W; bitpos: [25]; default: 0;
 *  CK8M force power down
 */
#define RTC_CNTL_CK8M_FORCE_PD    (BIT(25))
#define RTC_CNTL_CK8M_FORCE_PD_M  (RTC_CNTL_CK8M_FORCE_PD_V << RTC_CNTL_CK8M_FORCE_PD_S)
#define RTC_CNTL_CK8M_FORCE_PD_V  0x00000001U
#define RTC_CNTL_CK8M_FORCE_PD_S  25
/** RTC_CNTL_CK8M_FORCE_PU : R/W; bitpos: [26]; default: 0;
 *  CK8M force power up
 */
#define RTC_CNTL_CK8M_FORCE_PU    (BIT(26))
#define RTC_CNTL_CK8M_FORCE_PU_M  (RTC_CNTL_CK8M_FORCE_PU_V << RTC_CNTL_CK8M_FORCE_PU_S)
#define RTC_CNTL_CK8M_FORCE_PU_V  0x00000001U
#define RTC_CNTL_CK8M_FORCE_PU_S  26
/** RTC_CNTL_XTAL_GLOBAL_FORCE_GATING : R/W; bitpos: [27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XTAL_GLOBAL_FORCE_GATING    (BIT(27))
#define RTC_CNTL_XTAL_GLOBAL_FORCE_GATING_M  (RTC_CNTL_XTAL_GLOBAL_FORCE_GATING_V << RTC_CNTL_XTAL_GLOBAL_FORCE_GATING_S)
#define RTC_CNTL_XTAL_GLOBAL_FORCE_GATING_V  0x00000001U
#define RTC_CNTL_XTAL_GLOBAL_FORCE_GATING_S  27
/** RTC_CNTL_XTAL_GLOBAL_FORCE_NOGATING : R/W; bitpos: [28]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_XTAL_GLOBAL_FORCE_NOGATING    (BIT(28))
#define RTC_CNTL_XTAL_GLOBAL_FORCE_NOGATING_M  (RTC_CNTL_XTAL_GLOBAL_FORCE_NOGATING_V << RTC_CNTL_XTAL_GLOBAL_FORCE_NOGATING_S)
#define RTC_CNTL_XTAL_GLOBAL_FORCE_NOGATING_V  0x00000001U
#define RTC_CNTL_XTAL_GLOBAL_FORCE_NOGATING_S  28
/** RTC_CNTL_FAST_CLK_RTC_SEL : R/W; bitpos: [29]; default: 0;
 *  fast_clk_rtc sel. 0: XTAL div 2, 1: CK8M
 */
#define RTC_CNTL_FAST_CLK_RTC_SEL    (BIT(29))
#define RTC_CNTL_FAST_CLK_RTC_SEL_M  (RTC_CNTL_FAST_CLK_RTC_SEL_V << RTC_CNTL_FAST_CLK_RTC_SEL_S)
#define RTC_CNTL_FAST_CLK_RTC_SEL_V  0x00000001U
#define RTC_CNTL_FAST_CLK_RTC_SEL_S  29
/** RTC_CNTL_ANA_CLK_RTC_SEL : R/W; bitpos: [31:30]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_ANA_CLK_RTC_SEL    0x00000003U
#define RTC_CNTL_ANA_CLK_RTC_SEL_M  (RTC_CNTL_ANA_CLK_RTC_SEL_V << RTC_CNTL_ANA_CLK_RTC_SEL_S)
#define RTC_CNTL_ANA_CLK_RTC_SEL_V  0x00000003U
#define RTC_CNTL_ANA_CLK_RTC_SEL_S  30

/** RTC_CNTL_SLOW_CLK_CONF_REG register
 *  register description
 */
#define RTC_CNTL_SLOW_CLK_CONF_REG (DR_REG_RTCCNTL_BASE + 0x74)
/** RTC_CNTL_ANA_CLK_PD_SLP : R/W; bitpos: [19]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_ANA_CLK_PD_SLP    (BIT(19))
#define RTC_CNTL_ANA_CLK_PD_SLP_M  (RTC_CNTL_ANA_CLK_PD_SLP_V << RTC_CNTL_ANA_CLK_PD_SLP_S)
#define RTC_CNTL_ANA_CLK_PD_SLP_V  0x00000001U
#define RTC_CNTL_ANA_CLK_PD_SLP_S  19
/** RTC_CNTL_ANA_CLK_PD_MONITOR : R/W; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_ANA_CLK_PD_MONITOR    (BIT(20))
#define RTC_CNTL_ANA_CLK_PD_MONITOR_M  (RTC_CNTL_ANA_CLK_PD_MONITOR_V << RTC_CNTL_ANA_CLK_PD_MONITOR_S)
#define RTC_CNTL_ANA_CLK_PD_MONITOR_V  0x00000001U
#define RTC_CNTL_ANA_CLK_PD_MONITOR_S  20
/** RTC_CNTL_ANA_CLK_PD_IDLE : R/W; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_ANA_CLK_PD_IDLE    (BIT(21))
#define RTC_CNTL_ANA_CLK_PD_IDLE_M  (RTC_CNTL_ANA_CLK_PD_IDLE_V << RTC_CNTL_ANA_CLK_PD_IDLE_S)
#define RTC_CNTL_ANA_CLK_PD_IDLE_V  0x00000001U
#define RTC_CNTL_ANA_CLK_PD_IDLE_S  21
/** RTC_CNTL_ANA_CLK_DIV_VLD : R/W; bitpos: [22]; default: 1;
 *  used to sync div bus. clear vld before set reg_rtc_ana_clk_div, then set vld to
 *  actually switch the clk
 */
#define RTC_CNTL_ANA_CLK_DIV_VLD    (BIT(22))
#define RTC_CNTL_ANA_CLK_DIV_VLD_M  (RTC_CNTL_ANA_CLK_DIV_VLD_V << RTC_CNTL_ANA_CLK_DIV_VLD_S)
#define RTC_CNTL_ANA_CLK_DIV_VLD_V  0x00000001U
#define RTC_CNTL_ANA_CLK_DIV_VLD_S  22
/** RTC_CNTL_ANA_CLK_DIV : R/W; bitpos: [30:23]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_ANA_CLK_DIV    0x000000FFU
#define RTC_CNTL_ANA_CLK_DIV_M  (RTC_CNTL_ANA_CLK_DIV_V << RTC_CNTL_ANA_CLK_DIV_S)
#define RTC_CNTL_ANA_CLK_DIV_V  0x000000FFU
#define RTC_CNTL_ANA_CLK_DIV_S  23
/** RTC_CNTL_SLOW_CLK_NEXT_EDGE : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SLOW_CLK_NEXT_EDGE    (BIT(31))
#define RTC_CNTL_SLOW_CLK_NEXT_EDGE_M  (RTC_CNTL_SLOW_CLK_NEXT_EDGE_V << RTC_CNTL_SLOW_CLK_NEXT_EDGE_S)
#define RTC_CNTL_SLOW_CLK_NEXT_EDGE_V  0x00000001U
#define RTC_CNTL_SLOW_CLK_NEXT_EDGE_S  31

/** RTC_CNTL_SDIO_CONF_REG register
 *  register description
 */
#define RTC_CNTL_SDIO_CONF_REG (DR_REG_RTCCNTL_BASE + 0x78)
/** RTC_CNTL_SDIO_TIMER_TARGET : R/W; bitpos: [7:0]; default: 10;
 *  timer count to apply reg_sdio_dcap after sdio power on
 */
#define RTC_CNTL_SDIO_TIMER_TARGET    0x000000FFU
#define RTC_CNTL_SDIO_TIMER_TARGET_M  (RTC_CNTL_SDIO_TIMER_TARGET_V << RTC_CNTL_SDIO_TIMER_TARGET_S)
#define RTC_CNTL_SDIO_TIMER_TARGET_V  0x000000FFU
#define RTC_CNTL_SDIO_TIMER_TARGET_S  0
/** RTC_CNTL_SDIO_DTHDRV : R/W; bitpos: [10:9]; default: 3;
 *  Tieh = 1 mode drive ability. Initially set to 0 to limit charge current, set to 3
 *  after several us.
 */
#define RTC_CNTL_SDIO_DTHDRV    0x00000003U
#define RTC_CNTL_SDIO_DTHDRV_M  (RTC_CNTL_SDIO_DTHDRV_V << RTC_CNTL_SDIO_DTHDRV_S)
#define RTC_CNTL_SDIO_DTHDRV_V  0x00000003U
#define RTC_CNTL_SDIO_DTHDRV_S  9
/** RTC_CNTL_SDIO_DCAP : R/W; bitpos: [12:11]; default: 3;
 *  ability to prevent LDO from overshoot
 */
#define RTC_CNTL_SDIO_DCAP    0x00000003U
#define RTC_CNTL_SDIO_DCAP_M  (RTC_CNTL_SDIO_DCAP_V << RTC_CNTL_SDIO_DCAP_S)
#define RTC_CNTL_SDIO_DCAP_V  0x00000003U
#define RTC_CNTL_SDIO_DCAP_S  11
/** RTC_CNTL_SDIO_INITI : R/W; bitpos: [14:13]; default: 1;
 *  add resistor from ldo output to ground. 0: no res, 1: 6k, 2: 4k, 3: 2k
 */
#define RTC_CNTL_SDIO_INITI    0x00000003U
#define RTC_CNTL_SDIO_INITI_M  (RTC_CNTL_SDIO_INITI_V << RTC_CNTL_SDIO_INITI_S)
#define RTC_CNTL_SDIO_INITI_V  0x00000003U
#define RTC_CNTL_SDIO_INITI_S  13
/** RTC_CNTL_SDIO_EN_INITI : R/W; bitpos: [15]; default: 1;
 *  0 to set init[1:0]=0
 */
#define RTC_CNTL_SDIO_EN_INITI    (BIT(15))
#define RTC_CNTL_SDIO_EN_INITI_M  (RTC_CNTL_SDIO_EN_INITI_V << RTC_CNTL_SDIO_EN_INITI_S)
#define RTC_CNTL_SDIO_EN_INITI_V  0x00000001U
#define RTC_CNTL_SDIO_EN_INITI_S  15
/** RTC_CNTL_SDIO_DCURLIM : R/W; bitpos: [18:16]; default: 0;
 *  tune current limit threshold when tieh = 0. About 800mA/(8+d)
 */
#define RTC_CNTL_SDIO_DCURLIM    0x00000007U
#define RTC_CNTL_SDIO_DCURLIM_M  (RTC_CNTL_SDIO_DCURLIM_V << RTC_CNTL_SDIO_DCURLIM_S)
#define RTC_CNTL_SDIO_DCURLIM_V  0x00000007U
#define RTC_CNTL_SDIO_DCURLIM_S  16
/** RTC_CNTL_SDIO_MODECURLIM : R/W; bitpos: [19]; default: 0;
 *  select current limit mode
 */
#define RTC_CNTL_SDIO_MODECURLIM    (BIT(19))
#define RTC_CNTL_SDIO_MODECURLIM_M  (RTC_CNTL_SDIO_MODECURLIM_V << RTC_CNTL_SDIO_MODECURLIM_S)
#define RTC_CNTL_SDIO_MODECURLIM_V  0x00000001U
#define RTC_CNTL_SDIO_MODECURLIM_S  19
/** RTC_CNTL_SDIO_ENCURLIM : R/W; bitpos: [20]; default: 1;
 *  enable current limit
 */
#define RTC_CNTL_SDIO_ENCURLIM    (BIT(20))
#define RTC_CNTL_SDIO_ENCURLIM_M  (RTC_CNTL_SDIO_ENCURLIM_V << RTC_CNTL_SDIO_ENCURLIM_S)
#define RTC_CNTL_SDIO_ENCURLIM_V  0x00000001U
#define RTC_CNTL_SDIO_ENCURLIM_S  20
/** RTC_CNTL_SDIO_PD_EN : R/W; bitpos: [21]; default: 1;
 *  power down SDIO_REG in sleep. Only active when reg_sdio_force = 0
 */
#define RTC_CNTL_SDIO_PD_EN    (BIT(21))
#define RTC_CNTL_SDIO_PD_EN_M  (RTC_CNTL_SDIO_PD_EN_V << RTC_CNTL_SDIO_PD_EN_S)
#define RTC_CNTL_SDIO_PD_EN_V  0x00000001U
#define RTC_CNTL_SDIO_PD_EN_S  21
/** RTC_CNTL_SDIO_FORCE : R/W; bitpos: [22]; default: 0;
 *  1: use SW option to control SDIO_REG ,0: use state machine
 */
#define RTC_CNTL_SDIO_FORCE    (BIT(22))
#define RTC_CNTL_SDIO_FORCE_M  (RTC_CNTL_SDIO_FORCE_V << RTC_CNTL_SDIO_FORCE_S)
#define RTC_CNTL_SDIO_FORCE_V  0x00000001U
#define RTC_CNTL_SDIO_FORCE_S  22
/** RTC_CNTL_SDIO_TIEH : R/W; bitpos: [23]; default: 1;
 *  SW option for SDIO_TIEH. Only active when reg_sdio_force = 1
 */
#define RTC_CNTL_SDIO_TIEH    (BIT(23))
#define RTC_CNTL_SDIO_TIEH_M  (RTC_CNTL_SDIO_TIEH_V << RTC_CNTL_SDIO_TIEH_S)
#define RTC_CNTL_SDIO_TIEH_V  0x00000001U
#define RTC_CNTL_SDIO_TIEH_S  23
/** RTC_CNTL_REG1P8_READY : RO; bitpos: [24]; default: 0;
 *  read only register for REG1P8_READY
 */
#define RTC_CNTL_REG1P8_READY    (BIT(24))
#define RTC_CNTL_REG1P8_READY_M  (RTC_CNTL_REG1P8_READY_V << RTC_CNTL_REG1P8_READY_S)
#define RTC_CNTL_REG1P8_READY_V  0x00000001U
#define RTC_CNTL_REG1P8_READY_S  24
/** RTC_CNTL_DREFL_SDIO : R/W; bitpos: [26:25]; default: 1;
 *  SW option for DREFL_SDIO. Only active when reg_sdio_force = 1
 */
#define RTC_CNTL_DREFL_SDIO    0x00000003U
#define RTC_CNTL_DREFL_SDIO_M  (RTC_CNTL_DREFL_SDIO_V << RTC_CNTL_DREFL_SDIO_S)
#define RTC_CNTL_DREFL_SDIO_V  0x00000003U
#define RTC_CNTL_DREFL_SDIO_S  25
/** RTC_CNTL_DREFM_SDIO : R/W; bitpos: [28:27]; default: 1;
 *  SW option for DREFM_SDIO. Only active when reg_sdio_force = 1
 */
#define RTC_CNTL_DREFM_SDIO    0x00000003U
#define RTC_CNTL_DREFM_SDIO_M  (RTC_CNTL_DREFM_SDIO_V << RTC_CNTL_DREFM_SDIO_S)
#define RTC_CNTL_DREFM_SDIO_V  0x00000003U
#define RTC_CNTL_DREFM_SDIO_S  27
/** RTC_CNTL_DREFH_SDIO : R/W; bitpos: [30:29]; default: 0;
 *  SW option for DREFH_SDIO. Only active when reg_sdio_force = 1
 */
#define RTC_CNTL_DREFH_SDIO    0x00000003U
#define RTC_CNTL_DREFH_SDIO_M  (RTC_CNTL_DREFH_SDIO_V << RTC_CNTL_DREFH_SDIO_S)
#define RTC_CNTL_DREFH_SDIO_V  0x00000003U
#define RTC_CNTL_DREFH_SDIO_S  29
/** RTC_CNTL_XPD_SDIO_REG : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XPD_SDIO_REG    (BIT(31))
#define RTC_CNTL_XPD_SDIO_REG_M  (RTC_CNTL_XPD_SDIO_REG_V << RTC_CNTL_XPD_SDIO_REG_S)
#define RTC_CNTL_XPD_SDIO_REG_V  0x00000001U
#define RTC_CNTL_XPD_SDIO_REG_S  31

