espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_BIAS_CONF_REG register
 *  register description
 */
#define RTC_CNTL_BIAS_CONF_REG (DR_REG_RTCCNTL_BASE + 0x7c)
/** RTC_CNTL_BIAS_BUF_IDLE : R/W; bitpos: [10]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BIAS_BUF_IDLE    (BIT(10))
#define RTC_CNTL_BIAS_BUF_IDLE_M  (RTC_CNTL_BIAS_BUF_IDLE_V << RTC_CNTL_BIAS_BUF_IDLE_S)
#define RTC_CNTL_BIAS_BUF_IDLE_V  0x00000001U
#define RTC_CNTL_BIAS_BUF_IDLE_S  10
/** RTC_CNTL_BIAS_BUF_WAKE : R/W; bitpos: [11]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_BIAS_BUF_WAKE    (BIT(11))
#define RTC_CNTL_BIAS_BUF_WAKE_M  (RTC_CNTL_BIAS_BUF_WAKE_V << RTC_CNTL_BIAS_BUF_WAKE_S)
#define RTC_CNTL_BIAS_BUF_WAKE_V  0x00000001U
#define RTC_CNTL_BIAS_BUF_WAKE_S  11
/** RTC_CNTL_BIAS_BUF_DEEP_SLP : R/W; bitpos: [12]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BIAS_BUF_DEEP_SLP    (BIT(12))
#define RTC_CNTL_BIAS_BUF_DEEP_SLP_M  (RTC_CNTL_BIAS_BUF_DEEP_SLP_V << RTC_CNTL_BIAS_BUF_DEEP_SLP_S)
#define RTC_CNTL_BIAS_BUF_DEEP_SLP_V  0x00000001U
#define RTC_CNTL_BIAS_BUF_DEEP_SLP_S  12
/** RTC_CNTL_BIAS_BUF_MONITOR : R/W; bitpos: [13]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BIAS_BUF_MONITOR    (BIT(13))
#define RTC_CNTL_BIAS_BUF_MONITOR_M  (RTC_CNTL_BIAS_BUF_MONITOR_V << RTC_CNTL_BIAS_BUF_MONITOR_S)
#define RTC_CNTL_BIAS_BUF_MONITOR_V  0x00000001U
#define RTC_CNTL_BIAS_BUF_MONITOR_S  13
/** RTC_CNTL_PD_CUR_DEEP_SLP : R/W; bitpos: [14]; default: 0;
 *  xpd cur when rtc in sleep_state
 */
#define RTC_CNTL_PD_CUR_DEEP_SLP    (BIT(14))
#define RTC_CNTL_PD_CUR_DEEP_SLP_M  (RTC_CNTL_PD_CUR_DEEP_SLP_V << RTC_CNTL_PD_CUR_DEEP_SLP_S)
#define RTC_CNTL_PD_CUR_DEEP_SLP_V  0x00000001U
#define RTC_CNTL_PD_CUR_DEEP_SLP_S  14
/** RTC_CNTL_PD_CUR_MONITOR : R/W; bitpos: [15]; default: 0;
 *  xpd cur when rtc in monitor state
 */
#define RTC_CNTL_PD_CUR_MONITOR    (BIT(15))
#define RTC_CNTL_PD_CUR_MONITOR_M  (RTC_CNTL_PD_CUR_MONITOR_V << RTC_CNTL_PD_CUR_MONITOR_S)
#define RTC_CNTL_PD_CUR_MONITOR_V  0x00000001U
#define RTC_CNTL_PD_CUR_MONITOR_S  15
/** RTC_CNTL_BIAS_SLEEP_DEEP_SLP : R/W; bitpos: [16]; default: 1;
 *  bias_sleep when rtc in sleep_state
 */
#define RTC_CNTL_BIAS_SLEEP_DEEP_SLP    (BIT(16))
#define RTC_CNTL_BIAS_SLEEP_DEEP_SLP_M  (RTC_CNTL_BIAS_SLEEP_DEEP_SLP_V << RTC_CNTL_BIAS_SLEEP_DEEP_SLP_S)
#define RTC_CNTL_BIAS_SLEEP_DEEP_SLP_V  0x00000001U
#define RTC_CNTL_BIAS_SLEEP_DEEP_SLP_S  16
/** RTC_CNTL_BIAS_SLEEP_MONITOR : R/W; bitpos: [17]; default: 0;
 *  bias_sleep when rtc in monitor state
 */
#define RTC_CNTL_BIAS_SLEEP_MONITOR    (BIT(17))
#define RTC_CNTL_BIAS_SLEEP_MONITOR_M  (RTC_CNTL_BIAS_SLEEP_MONITOR_V << RTC_CNTL_BIAS_SLEEP_MONITOR_S)
#define RTC_CNTL_BIAS_SLEEP_MONITOR_V  0x00000001U
#define RTC_CNTL_BIAS_SLEEP_MONITOR_S  17
/** RTC_CNTL_DBG_ATTEN_DEEP_SLP : R/W; bitpos: [21:18]; default: 0;
 *  DBG_ATTEN when rtc in sleep state
 */
#define RTC_CNTL_DBG_ATTEN_DEEP_SLP    0x0000000FU
#define RTC_CNTL_DBG_ATTEN_DEEP_SLP_M  (RTC_CNTL_DBG_ATTEN_DEEP_SLP_V << RTC_CNTL_DBG_ATTEN_DEEP_SLP_S)
#define RTC_CNTL_DBG_ATTEN_DEEP_SLP_V  0x0000000FU
#define RTC_CNTL_DBG_ATTEN_DEEP_SLP_S  18
/** RTC_CNTL_DBG_ATTEN_MONITOR : R/W; bitpos: [25:22]; default: 0;
 *  DBG_ATTEN when rtc in monitor state
 */
#define RTC_CNTL_DBG_ATTEN_MONITOR    0x0000000FU
#define RTC_CNTL_DBG_ATTEN_MONITOR_M  (RTC_CNTL_DBG_ATTEN_MONITOR_V << RTC_CNTL_DBG_ATTEN_MONITOR_S)
#define RTC_CNTL_DBG_ATTEN_MONITOR_V  0x0000000FU
#define RTC_CNTL_DBG_ATTEN_MONITOR_S  22
/** RTC_CNTL_XPD_DCDC_SLP : R/W; bitpos: [26]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_XPD_DCDC_SLP    (BIT(26))
#define RTC_CNTL_XPD_DCDC_SLP_M  (RTC_CNTL_XPD_DCDC_SLP_V << RTC_CNTL_XPD_DCDC_SLP_S)
#define RTC_CNTL_XPD_DCDC_SLP_V  0x00000001U
#define RTC_CNTL_XPD_DCDC_SLP_S  26
/** RTC_CNTL_XPD_DCDC_MONITOR : R/W; bitpos: [27]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_XPD_DCDC_MONITOR    (BIT(27))
#define RTC_CNTL_XPD_DCDC_MONITOR_M  (RTC_CNTL_XPD_DCDC_MONITOR_V << RTC_CNTL_XPD_DCDC_MONITOR_S)
#define RTC_CNTL_XPD_DCDC_MONITOR_V  0x00000001U
#define RTC_CNTL_XPD_DCDC_MONITOR_S  27
/** RTC_CNTL_XPD_DCDC_IDLE : R/W; bitpos: [28]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_XPD_DCDC_IDLE    (BIT(28))
#define RTC_CNTL_XPD_DCDC_IDLE_M  (RTC_CNTL_XPD_DCDC_IDLE_V << RTC_CNTL_XPD_DCDC_IDLE_S)
#define RTC_CNTL_XPD_DCDC_IDLE_V  0x00000001U
#define RTC_CNTL_XPD_DCDC_IDLE_S  28

/** RTC_CNTL_REGULATOR_REG register
 *  register description
 */
#define RTC_CNTL_REGULATOR_REG (DR_REG_RTCCNTL_BASE + 0x80)
/** RTC_CNTL_DBIAS_SWITCH_SLP : R/W; bitpos: [0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DBIAS_SWITCH_SLP    (BIT(0))
#define RTC_CNTL_DBIAS_SWITCH_SLP_M  (RTC_CNTL_DBIAS_SWITCH_SLP_V << RTC_CNTL_DBIAS_SWITCH_SLP_S)
#define RTC_CNTL_DBIAS_SWITCH_SLP_V  0x00000001U
#define RTC_CNTL_DBIAS_SWITCH_SLP_S  0
/** RTC_CNTL_DBIAS_SWITCH_MONITOR : R/W; bitpos: [1]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DBIAS_SWITCH_MONITOR    (BIT(1))
#define RTC_CNTL_DBIAS_SWITCH_MONITOR_M  (RTC_CNTL_DBIAS_SWITCH_MONITOR_V << RTC_CNTL_DBIAS_SWITCH_MONITOR_S)
#define RTC_CNTL_DBIAS_SWITCH_MONITOR_V  0x00000001U
#define RTC_CNTL_DBIAS_SWITCH_MONITOR_S  1
/** RTC_CNTL_DBIAS_SWITCH_IDLE : R/W; bitpos: [2]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DBIAS_SWITCH_IDLE    (BIT(2))
#define RTC_CNTL_DBIAS_SWITCH_IDLE_M  (RTC_CNTL_DBIAS_SWITCH_IDLE_V << RTC_CNTL_DBIAS_SWITCH_IDLE_S)
#define RTC_CNTL_DBIAS_SWITCH_IDLE_V  0x00000001U
#define RTC_CNTL_DBIAS_SWITCH_IDLE_S  2
/** RTC_CNTL_DIG_REG_CAL_EN : R/W; bitpos: [3]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DIG_REG_CAL_EN    (BIT(3))
#define RTC_CNTL_DIG_REG_CAL_EN_M  (RTC_CNTL_DIG_REG_CAL_EN_V << RTC_CNTL_DIG_REG_CAL_EN_S)
#define RTC_CNTL_DIG_REG_CAL_EN_V  0x00000001U
#define RTC_CNTL_DIG_REG_CAL_EN_S  3
/** RTC_CNTL_SCK_DCAP : R/W; bitpos: [11:4]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SCK_DCAP    0x000000FFU
#define RTC_CNTL_SCK_DCAP_M  (RTC_CNTL_SCK_DCAP_V << RTC_CNTL_SCK_DCAP_S)
#define RTC_CNTL_SCK_DCAP_V  0x000000FFU
#define RTC_CNTL_SCK_DCAP_S  4
/** RTC_CNTL_VDD_DRV_B_ACTIVE : R/W; bitpos: [20:15]; default: 0;
 *  SCK_DCAP
 */
#define RTC_CNTL_VDD_DRV_B_ACTIVE    0x0000003FU
#define RTC_CNTL_VDD_DRV_B_ACTIVE_M  (RTC_CNTL_VDD_DRV_B_ACTIVE_V << RTC_CNTL_VDD_DRV_B_ACTIVE_S)
#define RTC_CNTL_VDD_DRV_B_ACTIVE_V  0x0000003FU
#define RTC_CNTL_VDD_DRV_B_ACTIVE_S  15
/** RTC_CNTL_VDD_DRV_B_SLP : R/W; bitpos: [26:21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VDD_DRV_B_SLP    0x0000003FU
#define RTC_CNTL_VDD_DRV_B_SLP_M  (RTC_CNTL_VDD_DRV_B_SLP_V << RTC_CNTL_VDD_DRV_B_SLP_S)
#define RTC_CNTL_VDD_DRV_B_SLP_V  0x0000003FU
#define RTC_CNTL_VDD_DRV_B_SLP_S  21
/** RTC_CNTL_VDD_DRV_B_SLP_EN : R/W; bitpos: [27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VDD_DRV_B_SLP_EN    (BIT(27))
#define RTC_CNTL_VDD_DRV_B_SLP_EN_M  (RTC_CNTL_VDD_DRV_B_SLP_EN_V << RTC_CNTL_VDD_DRV_B_SLP_EN_S)
#define RTC_CNTL_VDD_DRV_B_SLP_EN_V  0x00000001U
#define RTC_CNTL_VDD_DRV_B_SLP_EN_S  27
/** RTC_CNTL_DBOOST_FORCE_PD : R/W; bitpos: [28]; default: 0;
 *  RTC_DBOOST force power down
 */
#define RTC_CNTL_DBOOST_FORCE_PD    (BIT(28))
#define RTC_CNTL_DBOOST_FORCE_PD_M  (RTC_CNTL_DBOOST_FORCE_PD_V << RTC_CNTL_DBOOST_FORCE_PD_S)
#define RTC_CNTL_DBOOST_FORCE_PD_V  0x00000001U
#define RTC_CNTL_DBOOST_FORCE_PD_S  28
/** RTC_CNTL_DBOOST_FORCE_PU : R/W; bitpos: [29]; default: 1;
 *  RTC_DBOOST force power up
 */
#define RTC_CNTL_DBOOST_FORCE_PU    (BIT(29))
#define RTC_CNTL_DBOOST_FORCE_PU_M  (RTC_CNTL_DBOOST_FORCE_PU_V << RTC_CNTL_DBOOST_FORCE_PU_S)
#define RTC_CNTL_DBOOST_FORCE_PU_V  0x00000001U
#define RTC_CNTL_DBOOST_FORCE_PU_S  29
/** RTC_CNTL_REGULATOR_FORCE_PD : R/W; bitpos: [30]; default: 0;
 *  RTC_REG force power down (for RTC_REG power down means decrease the voltage to 0.8v
 *  or lower )
 */
#define RTC_CNTL_REGULATOR_FORCE_PD    (BIT(30))
#define RTC_CNTL_REGULATOR_FORCE_PD_M  (RTC_CNTL_REGULATOR_FORCE_PD_V << RTC_CNTL_REGULATOR_FORCE_PD_S)
#define RTC_CNTL_REGULATOR_FORCE_PD_V  0x00000001U
#define RTC_CNTL_REGULATOR_FORCE_PD_S  30
/** RTC_CNTL_REGULATOR_FORCE_PU : R/W; bitpos: [31]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_REGULATOR_FORCE_PU    (BIT(31))
#define RTC_CNTL_REGULATOR_FORCE_PU_M  (RTC_CNTL_REGULATOR_FORCE_PU_V << RTC_CNTL_REGULATOR_FORCE_PU_S)
#define RTC_CNTL_REGULATOR_FORCE_PU_V  0x00000001U
#define RTC_CNTL_REGULATOR_FORCE_PU_S  31

/** RTC_CNTL_REGULATOR0_DBIAS_REG register
 *  register description
 */
#define RTC_CNTL_REGULATOR0_DBIAS_REG (DR_REG_RTCCNTL_BASE + 0x84)
/** RTC_CNTL_PVT_RTC_DBIAS : RO; bitpos: [19:15]; default: 20;
 *  get pvt dbias value
 */
#define RTC_CNTL_PVT_RTC_DBIAS    0x0000001FU
#define RTC_CNTL_PVT_RTC_DBIAS_M  (RTC_CNTL_PVT_RTC_DBIAS_V << RTC_CNTL_PVT_RTC_DBIAS_S)
#define RTC_CNTL_PVT_RTC_DBIAS_V  0x0000001FU
#define RTC_CNTL_PVT_RTC_DBIAS_S  15
/** RTC_CNTL_REGULATOR0_DBIAS_SLP : R/W; bitpos: [24:20]; default: 20;
 *  the rtc regulator0 dbias when chip in sleep state
 */
#define RTC_CNTL_REGULATOR0_DBIAS_SLP    0x0000001FU
#define RTC_CNTL_REGULATOR0_DBIAS_SLP_M  (RTC_CNTL_REGULATOR0_DBIAS_SLP_V << RTC_CNTL_REGULATOR0_DBIAS_SLP_S)
#define RTC_CNTL_REGULATOR0_DBIAS_SLP_V  0x0000001FU
#define RTC_CNTL_REGULATOR0_DBIAS_SLP_S  20
/** RTC_CNTL_REGULATOR0_DBIAS_ACTIVE : R/W; bitpos: [29:25]; default: 20;
 *  the rtc regulator0 dbias when chip in active state
 */
#define RTC_CNTL_REGULATOR0_DBIAS_ACTIVE    0x0000001FU
#define RTC_CNTL_REGULATOR0_DBIAS_ACTIVE_M  (RTC_CNTL_REGULATOR0_DBIAS_ACTIVE_V << RTC_CNTL_REGULATOR0_DBIAS_ACTIVE_S)
#define RTC_CNTL_REGULATOR0_DBIAS_ACTIVE_V  0x0000001FU
#define RTC_CNTL_REGULATOR0_DBIAS_ACTIVE_S  25
/** RTC_CNTL_REGULATOR0_DBIAS_SEL : R/W; bitpos: [31]; default: 1;
 *  1: select sw dbias_active 0: select pvt value
 */
#define RTC_CNTL_REGULATOR0_DBIAS_SEL    (BIT(31))
#define RTC_CNTL_REGULATOR0_DBIAS_SEL_M  (RTC_CNTL_REGULATOR0_DBIAS_SEL_V << RTC_CNTL_REGULATOR0_DBIAS_SEL_S)
#define RTC_CNTL_REGULATOR0_DBIAS_SEL_V  0x00000001U
#define RTC_CNTL_REGULATOR0_DBIAS_SEL_S  31

