espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_REGULATOR1_DBIAS_REG register
 *  register description
 */
#define RTC_CNTL_REGULATOR1_DBIAS_REG (DR_REG_RTCCNTL_BASE + 0x88)
/** RTC_CNTL_REGULATOR1_DBIAS_SLP : R/W; bitpos: [23:20]; default: 8;
 *  the rtc regulator1 dbias when chip in sleep state
 */
#define RTC_CNTL_REGULATOR1_DBIAS_SLP    0x0000000FU
#define RTC_CNTL_REGULATOR1_DBIAS_SLP_M  (RTC_CNTL_REGULATOR1_DBIAS_SLP_V << RTC_CNTL_REGULATOR1_DBIAS_SLP_S)
#define RTC_CNTL_REGULATOR1_DBIAS_SLP_V  0x0000000FU
#define RTC_CNTL_REGULATOR1_DBIAS_SLP_S  20
/** RTC_CNTL_REGULATOR1_DBIAS_ACTIVE : R/W; bitpos: [28:25]; default: 8;
 *  the rtc regulator1 dbias when chip in active state
 */
#define RTC_CNTL_REGULATOR1_DBIAS_ACTIVE    0x0000000FU
#define RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_M  (RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_V << RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_S)
#define RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_V  0x0000000FU
#define RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_S  25

/** RTC_CNTL_DIG_REGULATOR_REG register
 *  register description
 */
#define RTC_CNTL_DIG_REGULATOR_REG (DR_REG_RTCCNTL_BASE + 0x8c)
/** RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PD : R/W; bitpos: [1]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PD    (BIT(1))
#define RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PD_M  (RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PD_V << RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PD_S)
#define RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PD_V  0x00000001U
#define RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PD_S  1
/** RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PU : R/W; bitpos: [2]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PU    (BIT(2))
#define RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PU_M  (RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PU_V << RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PU_S)
#define RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PU_V  0x00000001U
#define RTC_CNTL_MEM_REGULATOR_SLP_FORCE_PU_S  2
/** RTC_CNTL_DG_VDD_DRV_B_SLP : R/W; bitpos: [26:3]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_VDD_DRV_B_SLP    0x00FFFFFFU
#define RTC_CNTL_DG_VDD_DRV_B_SLP_M  (RTC_CNTL_DG_VDD_DRV_B_SLP_V << RTC_CNTL_DG_VDD_DRV_B_SLP_S)
#define RTC_CNTL_DG_VDD_DRV_B_SLP_V  0x00FFFFFFU
#define RTC_CNTL_DG_VDD_DRV_B_SLP_S  3
/** RTC_CNTL_DG_VDD_DRV_B_SLP_EN : R/W; bitpos: [27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_VDD_DRV_B_SLP_EN    (BIT(27))
#define RTC_CNTL_DG_VDD_DRV_B_SLP_EN_M  (RTC_CNTL_DG_VDD_DRV_B_SLP_EN_V << RTC_CNTL_DG_VDD_DRV_B_SLP_EN_S)
#define RTC_CNTL_DG_VDD_DRV_B_SLP_EN_V  0x00000001U
#define RTC_CNTL_DG_VDD_DRV_B_SLP_EN_S  27
/** RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD : R/W; bitpos: [28]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD    (BIT(28))
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD_M  (RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD_V << RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD_S)
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD_V  0x00000001U
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD_S  28
/** RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU : R/W; bitpos: [29]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU    (BIT(29))
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU_M  (RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU_V << RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU_S)
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU_V  0x00000001U
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU_S  29
/** RTC_CNTL_DG_REGULATOR_FORCE_PD : R/W; bitpos: [30]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_REGULATOR_FORCE_PD    (BIT(30))
#define RTC_CNTL_DG_REGULATOR_FORCE_PD_M  (RTC_CNTL_DG_REGULATOR_FORCE_PD_V << RTC_CNTL_DG_REGULATOR_FORCE_PD_S)
#define RTC_CNTL_DG_REGULATOR_FORCE_PD_V  0x00000001U
#define RTC_CNTL_DG_REGULATOR_FORCE_PD_S  30
/** RTC_CNTL_DG_REGULATOR_FORCE_PU : R/W; bitpos: [31]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DG_REGULATOR_FORCE_PU    (BIT(31))
#define RTC_CNTL_DG_REGULATOR_FORCE_PU_M  (RTC_CNTL_DG_REGULATOR_FORCE_PU_V << RTC_CNTL_DG_REGULATOR_FORCE_PU_S)
#define RTC_CNTL_DG_REGULATOR_FORCE_PU_V  0x00000001U
#define RTC_CNTL_DG_REGULATOR_FORCE_PU_S  31

/** RTC_CNTL_DIG_REGULATOR_DRVB_REG register
 *  register description
 */
#define RTC_CNTL_DIG_REGULATOR_DRVB_REG (DR_REG_RTCCNTL_BASE + 0x90)
/** RTC_CNTL_DG_VDD_DRV_B_ACTIVE : R/W; bitpos: [23:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_VDD_DRV_B_ACTIVE    0x00FFFFFFU
#define RTC_CNTL_DG_VDD_DRV_B_ACTIVE_M  (RTC_CNTL_DG_VDD_DRV_B_ACTIVE_V << RTC_CNTL_DG_VDD_DRV_B_ACTIVE_S)
#define RTC_CNTL_DG_VDD_DRV_B_ACTIVE_V  0x00FFFFFFU
#define RTC_CNTL_DG_VDD_DRV_B_ACTIVE_S  0

/** RTC_CNTL_DIG_REGULATOR0_DBIAS_REG register
 *  register description
 */
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_REG (DR_REG_RTCCNTL_BASE + 0x94)
/** RTC_CNTL_PVT_DIG_DBIAS : RO; bitpos: [19:15]; default: 20;
 *  get pvt dbias value
 */
#define RTC_CNTL_PVT_DIG_DBIAS    0x0000001FU
#define RTC_CNTL_PVT_DIG_DBIAS_M  (RTC_CNTL_PVT_DIG_DBIAS_V << RTC_CNTL_PVT_DIG_DBIAS_S)
#define RTC_CNTL_PVT_DIG_DBIAS_V  0x0000001FU
#define RTC_CNTL_PVT_DIG_DBIAS_S  15
/** RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP : R/W; bitpos: [24:20]; default: 20;
 *  the dig regulator0 dbias when chip in sleep state
 */
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP    0x0000001FU
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_M  (RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_V << RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_S)
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_V  0x0000001FU
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_S  20
/** RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE : R/W; bitpos: [29:25]; default: 20;
 *  the dig regulator0 dbias when chip in active state
 */
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE    0x0000001FU
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_M  (RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_V << RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_S)
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_V  0x0000001FU
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_S  25
/** RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT : WO; bitpos: [30]; default: 0;
 *  initial pvt dbias value
 */
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT    (BIT(30))
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT_M  (RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT_V << RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT_S)
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT_V  0x00000001U
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT_S  30
/** RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL : R/W; bitpos: [31]; default: 1;
 *  1: select sw dbias_active 0: select pvt value
 */
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL    (BIT(31))
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL_M  (RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL_V << RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL_S)
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL_V  0x00000001U
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL_S  31

/** RTC_CNTL_DIG_REGULATOR1_DBIAS_REG register
 *  register description
 */
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_REG (DR_REG_RTCCNTL_BASE + 0x98)
/** RTC_CNTL_MEM_REGULATOR1_DBIAS_SLP : R/W; bitpos: [15:12]; default: 8;
 *  Need add description
 */
#define RTC_CNTL_MEM_REGULATOR1_DBIAS_SLP    0x0000000FU
#define RTC_CNTL_MEM_REGULATOR1_DBIAS_SLP_M  (RTC_CNTL_MEM_REGULATOR1_DBIAS_SLP_V << RTC_CNTL_MEM_REGULATOR1_DBIAS_SLP_S)
#define RTC_CNTL_MEM_REGULATOR1_DBIAS_SLP_V  0x0000000FU
#define RTC_CNTL_MEM_REGULATOR1_DBIAS_SLP_S  12
/** RTC_CNTL_MEM_REGULATOR1_DBIAS_ACTIVE : R/W; bitpos: [19:16]; default: 8;
 *  Need add description
 */
#define RTC_CNTL_MEM_REGULATOR1_DBIAS_ACTIVE    0x0000000FU
#define RTC_CNTL_MEM_REGULATOR1_DBIAS_ACTIVE_M  (RTC_CNTL_MEM_REGULATOR1_DBIAS_ACTIVE_V << RTC_CNTL_MEM_REGULATOR1_DBIAS_ACTIVE_S)
#define RTC_CNTL_MEM_REGULATOR1_DBIAS_ACTIVE_V  0x0000000FU
#define RTC_CNTL_MEM_REGULATOR1_DBIAS_ACTIVE_S  16
/** RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP : R/W; bitpos: [23:20]; default: 8;
 *  the dig regulator1 dbias when chip in sleep state
 */
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP    0x0000000FU
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_M  (RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_V << RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_S)
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_V  0x0000000FU
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_S  20
/** RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE : R/W; bitpos: [28:25]; default: 8;
 *  the dig regulator1 dbias when chip in active state
 */
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE    0x0000000FU
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_M  (RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_V << RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_S)
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_V  0x0000000FU
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_S  25

/** RTC_CNTL_PWC_REG register
 *  register description
 */
#define RTC_CNTL_PWC_REG (DR_REG_RTCCNTL_BASE + 0x9c)
/** RTC_CNTL_PAD_FORCE_HOLD : R/W; bitpos: [21]; default: 0;
 *  rtc pad force hold
 */
#define RTC_CNTL_PAD_FORCE_HOLD    (BIT(21))
#define RTC_CNTL_PAD_FORCE_HOLD_M  (RTC_CNTL_PAD_FORCE_HOLD_V << RTC_CNTL_PAD_FORCE_HOLD_S)
#define RTC_CNTL_PAD_FORCE_HOLD_V  0x00000001U
#define RTC_CNTL_PAD_FORCE_HOLD_S  21

/** RTC_CNTL_DIG_PWC_REG register
 *  register description
 */
#define RTC_CNTL_DIG_PWC_REG (DR_REG_RTCCNTL_BASE + 0xa0)
/** RTC_CNTL_VDD_SPI_PWR_DRV : R/W; bitpos: [1:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VDD_SPI_PWR_DRV    0x00000003U
#define RTC_CNTL_VDD_SPI_PWR_DRV_M  (RTC_CNTL_VDD_SPI_PWR_DRV_V << RTC_CNTL_VDD_SPI_PWR_DRV_S)
#define RTC_CNTL_VDD_SPI_PWR_DRV_V  0x00000003U
#define RTC_CNTL_VDD_SPI_PWR_DRV_S  0
/** RTC_CNTL_VDD_SPI_PWR_FORCE : R/W; bitpos: [2]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VDD_SPI_PWR_FORCE    (BIT(2))
#define RTC_CNTL_VDD_SPI_PWR_FORCE_M  (RTC_CNTL_VDD_SPI_PWR_FORCE_V << RTC_CNTL_VDD_SPI_PWR_FORCE_S)
#define RTC_CNTL_VDD_SPI_PWR_FORCE_V  0x00000001U
#define RTC_CNTL_VDD_SPI_PWR_FORCE_S  2
/** RTC_CNTL_LSLP_MEM_FORCE_PD : R/W; bitpos: [3]; default: 0;
 *  memories in digital core force PD in sleep
 */
#define RTC_CNTL_LSLP_MEM_FORCE_PD    (BIT(3))
#define RTC_CNTL_LSLP_MEM_FORCE_PD_M  (RTC_CNTL_LSLP_MEM_FORCE_PD_V << RTC_CNTL_LSLP_MEM_FORCE_PD_S)
#define RTC_CNTL_LSLP_MEM_FORCE_PD_V  0x00000001U
#define RTC_CNTL_LSLP_MEM_FORCE_PD_S  3
/** RTC_CNTL_LSLP_MEM_FORCE_PU : R/W; bitpos: [4]; default: 1;
 *  memories in digital core force no PD in sleep
 */
#define RTC_CNTL_LSLP_MEM_FORCE_PU    (BIT(4))
#define RTC_CNTL_LSLP_MEM_FORCE_PU_M  (RTC_CNTL_LSLP_MEM_FORCE_PU_V << RTC_CNTL_LSLP_MEM_FORCE_PU_S)
#define RTC_CNTL_LSLP_MEM_FORCE_PU_V  0x00000001U
#define RTC_CNTL_LSLP_MEM_FORCE_PU_S  4
/** RTC_CNTL_DG_MEM_FORCE_PD : R/W; bitpos: [7]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_MEM_FORCE_PD    (BIT(7))
#define RTC_CNTL_DG_MEM_FORCE_PD_M  (RTC_CNTL_DG_MEM_FORCE_PD_V << RTC_CNTL_DG_MEM_FORCE_PD_S)
#define RTC_CNTL_DG_MEM_FORCE_PD_V  0x00000001U
#define RTC_CNTL_DG_MEM_FORCE_PD_S  7
/** RTC_CNTL_DG_MEM_FORCE_PU : R/W; bitpos: [8]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DG_MEM_FORCE_PU    (BIT(8))
#define RTC_CNTL_DG_MEM_FORCE_PU_M  (RTC_CNTL_DG_MEM_FORCE_PU_V << RTC_CNTL_DG_MEM_FORCE_PU_S)
#define RTC_CNTL_DG_MEM_FORCE_PU_V  0x00000001U
#define RTC_CNTL_DG_MEM_FORCE_PU_S  8
/** RTC_CNTL_DG_WRAP_FORCE_PD : R/W; bitpos: [9]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_WRAP_FORCE_PD    (BIT(9))
#define RTC_CNTL_DG_WRAP_FORCE_PD_M  (RTC_CNTL_DG_WRAP_FORCE_PD_V << RTC_CNTL_DG_WRAP_FORCE_PD_S)
#define RTC_CNTL_DG_WRAP_FORCE_PD_V  0x00000001U
#define RTC_CNTL_DG_WRAP_FORCE_PD_S  9
/** RTC_CNTL_DG_WRAP_FORCE_PU : R/W; bitpos: [10]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DG_WRAP_FORCE_PU    (BIT(10))
#define RTC_CNTL_DG_WRAP_FORCE_PU_M  (RTC_CNTL_DG_WRAP_FORCE_PU_V << RTC_CNTL_DG_WRAP_FORCE_PU_S)
#define RTC_CNTL_DG_WRAP_FORCE_PU_V  0x00000001U
#define RTC_CNTL_DG_WRAP_FORCE_PU_S  10
/** RTC_CNTL_BT_FORCE_PD : R/W; bitpos: [11]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BT_FORCE_PD    (BIT(11))
#define RTC_CNTL_BT_FORCE_PD_M  (RTC_CNTL_BT_FORCE_PD_V << RTC_CNTL_BT_FORCE_PD_S)
#define RTC_CNTL_BT_FORCE_PD_V  0x00000001U
#define RTC_CNTL_BT_FORCE_PD_S  11
/** RTC_CNTL_BT_FORCE_PU : R/W; bitpos: [12]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_BT_FORCE_PU    (BIT(12))
#define RTC_CNTL_BT_FORCE_PU_M  (RTC_CNTL_BT_FORCE_PU_V << RTC_CNTL_BT_FORCE_PU_S)
#define RTC_CNTL_BT_FORCE_PU_V  0x00000001U
#define RTC_CNTL_BT_FORCE_PU_S  12
/** RTC_CNTL_DG_PERI_FORCE_PD : R/W; bitpos: [13]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_PERI_FORCE_PD    (BIT(13))
#define RTC_CNTL_DG_PERI_FORCE_PD_M  (RTC_CNTL_DG_PERI_FORCE_PD_V << RTC_CNTL_DG_PERI_FORCE_PD_S)
#define RTC_CNTL_DG_PERI_FORCE_PD_V  0x00000001U
#define RTC_CNTL_DG_PERI_FORCE_PD_S  13
/** RTC_CNTL_DG_PERI_FORCE_PU : R/W; bitpos: [14]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DG_PERI_FORCE_PU    (BIT(14))
#define RTC_CNTL_DG_PERI_FORCE_PU_M  (RTC_CNTL_DG_PERI_FORCE_PU_V << RTC_CNTL_DG_PERI_FORCE_PU_S)
#define RTC_CNTL_DG_PERI_FORCE_PU_V  0x00000001U
#define RTC_CNTL_DG_PERI_FORCE_PU_S  14
/** RTC_CNTL_FASTMEM_FORCE_LPD : R/W; bitpos: [15]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_FASTMEM_FORCE_LPD    (BIT(15))
#define RTC_CNTL_FASTMEM_FORCE_LPD_M  (RTC_CNTL_FASTMEM_FORCE_LPD_V << RTC_CNTL_FASTMEM_FORCE_LPD_S)
#define RTC_CNTL_FASTMEM_FORCE_LPD_V  0x00000001U
#define RTC_CNTL_FASTMEM_FORCE_LPD_S  15
/** RTC_CNTL_FASTMEM_FORCE_LPU : R/W; bitpos: [16]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_FASTMEM_FORCE_LPU    (BIT(16))
#define RTC_CNTL_FASTMEM_FORCE_LPU_M  (RTC_CNTL_FASTMEM_FORCE_LPU_V << RTC_CNTL_FASTMEM_FORCE_LPU_S)
#define RTC_CNTL_FASTMEM_FORCE_LPU_V  0x00000001U
#define RTC_CNTL_FASTMEM_FORCE_LPU_S  16
/** RTC_CNTL_WIFI_FORCE_PD : R/W; bitpos: [17]; default: 0;
 *  wifi force power down
 */
#define RTC_CNTL_WIFI_FORCE_PD    (BIT(17))
#define RTC_CNTL_WIFI_FORCE_PD_M  (RTC_CNTL_WIFI_FORCE_PD_V << RTC_CNTL_WIFI_FORCE_PD_S)
#define RTC_CNTL_WIFI_FORCE_PD_V  0x00000001U
#define RTC_CNTL_WIFI_FORCE_PD_S  17
/** RTC_CNTL_WIFI_FORCE_PU : R/W; bitpos: [18]; default: 1;
 *  wifi force power up
 */
#define RTC_CNTL_WIFI_FORCE_PU    (BIT(18))
#define RTC_CNTL_WIFI_FORCE_PU_M  (RTC_CNTL_WIFI_FORCE_PU_V << RTC_CNTL_WIFI_FORCE_PU_S)
#define RTC_CNTL_WIFI_FORCE_PU_V  0x00000001U
#define RTC_CNTL_WIFI_FORCE_PU_S  18
/** RTC_CNTL_CPU_TOP_FORCE_PD : R/W; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_CPU_TOP_FORCE_PD    (BIT(21))
#define RTC_CNTL_CPU_TOP_FORCE_PD_M  (RTC_CNTL_CPU_TOP_FORCE_PD_V << RTC_CNTL_CPU_TOP_FORCE_PD_S)
#define RTC_CNTL_CPU_TOP_FORCE_PD_V  0x00000001U
#define RTC_CNTL_CPU_TOP_FORCE_PD_S  21
/** RTC_CNTL_CPU_TOP_FORCE_PU : R/W; bitpos: [22]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_CPU_TOP_FORCE_PU    (BIT(22))
#define RTC_CNTL_CPU_TOP_FORCE_PU_M  (RTC_CNTL_CPU_TOP_FORCE_PU_V << RTC_CNTL_CPU_TOP_FORCE_PU_S)
#define RTC_CNTL_CPU_TOP_FORCE_PU_V  0x00000001U
#define RTC_CNTL_CPU_TOP_FORCE_PU_S  22
/** RTC_CNTL_DG_WRAP_RET_PD_EN : R/W; bitpos: [26]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_WRAP_RET_PD_EN    (BIT(26))
#define RTC_CNTL_DG_WRAP_RET_PD_EN_M  (RTC_CNTL_DG_WRAP_RET_PD_EN_V << RTC_CNTL_DG_WRAP_RET_PD_EN_S)
#define RTC_CNTL_DG_WRAP_RET_PD_EN_V  0x00000001U
#define RTC_CNTL_DG_WRAP_RET_PD_EN_S  26
/** RTC_CNTL_BT_PD_EN : R/W; bitpos: [27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BT_PD_EN    (BIT(27))
#define RTC_CNTL_BT_PD_EN_M  (RTC_CNTL_BT_PD_EN_V << RTC_CNTL_BT_PD_EN_S)
#define RTC_CNTL_BT_PD_EN_V  0x00000001U
#define RTC_CNTL_BT_PD_EN_S  27
/** RTC_CNTL_DG_PERI_PD_EN : R/W; bitpos: [28]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_PERI_PD_EN    (BIT(28))
#define RTC_CNTL_DG_PERI_PD_EN_M  (RTC_CNTL_DG_PERI_PD_EN_V << RTC_CNTL_DG_PERI_PD_EN_S)
#define RTC_CNTL_DG_PERI_PD_EN_V  0x00000001U
#define RTC_CNTL_DG_PERI_PD_EN_S  28
/** RTC_CNTL_CPU_TOP_PD_EN : R/W; bitpos: [29]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_CPU_TOP_PD_EN    (BIT(29))
#define RTC_CNTL_CPU_TOP_PD_EN_M  (RTC_CNTL_CPU_TOP_PD_EN_V << RTC_CNTL_CPU_TOP_PD_EN_S)
#define RTC_CNTL_CPU_TOP_PD_EN_V  0x00000001U
#define RTC_CNTL_CPU_TOP_PD_EN_S  29
/** RTC_CNTL_WIFI_PD_EN : R/W; bitpos: [30]; default: 0;
 *  enable power down wifi in sleep
 */
#define RTC_CNTL_WIFI_PD_EN    (BIT(30))
#define RTC_CNTL_WIFI_PD_EN_M  (RTC_CNTL_WIFI_PD_EN_V << RTC_CNTL_WIFI_PD_EN_S)
#define RTC_CNTL_WIFI_PD_EN_V  0x00000001U
#define RTC_CNTL_WIFI_PD_EN_S  30
/** RTC_CNTL_DG_WRAP_PD_EN : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_WRAP_PD_EN    (BIT(31))
#define RTC_CNTL_DG_WRAP_PD_EN_M  (RTC_CNTL_DG_WRAP_PD_EN_V << RTC_CNTL_DG_WRAP_PD_EN_S)
#define RTC_CNTL_DG_WRAP_PD_EN_V  0x00000001U
#define RTC_CNTL_DG_WRAP_PD_EN_S  31

/** RTC_CNTL_DIG_POWER_SLAVE0_PD_REG register
 *  register description
 */
#define RTC_CNTL_DIG_POWER_SLAVE0_PD_REG (DR_REG_RTCCNTL_BASE + 0xa4)
/** RTC_CNTL_PD_DG_PERI_SWITCH_MASK : R/W; bitpos: [6:2]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_PD_DG_PERI_SWITCH_MASK    0x0000001FU
#define RTC_CNTL_PD_DG_PERI_SWITCH_MASK_M  (RTC_CNTL_PD_DG_PERI_SWITCH_MASK_V << RTC_CNTL_PD_DG_PERI_SWITCH_MASK_S)
#define RTC_CNTL_PD_DG_PERI_SWITCH_MASK_V  0x0000001FU
#define RTC_CNTL_PD_DG_PERI_SWITCH_MASK_S  2
/** RTC_CNTL_PD_DG_WRAP_SWITCH_MASK : R/W; bitpos: [11:7]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_PD_DG_WRAP_SWITCH_MASK    0x0000001FU
#define RTC_CNTL_PD_DG_WRAP_SWITCH_MASK_M  (RTC_CNTL_PD_DG_WRAP_SWITCH_MASK_V << RTC_CNTL_PD_DG_WRAP_SWITCH_MASK_S)
#define RTC_CNTL_PD_DG_WRAP_SWITCH_MASK_V  0x0000001FU
#define RTC_CNTL_PD_DG_WRAP_SWITCH_MASK_S  7
/** RTC_CNTL_PD_MEM_SWITCH_MASK : R/W; bitpos: [31:12]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_PD_MEM_SWITCH_MASK    0x000FFFFFU
#define RTC_CNTL_PD_MEM_SWITCH_MASK_M  (RTC_CNTL_PD_MEM_SWITCH_MASK_V << RTC_CNTL_PD_MEM_SWITCH_MASK_S)
#define RTC_CNTL_PD_MEM_SWITCH_MASK_V  0x000FFFFFU
#define RTC_CNTL_PD_MEM_SWITCH_MASK_S  12

