espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_DIG_POWER_SLAVE1_PD_REG register
 *  register description
 */
#define RTC_CNTL_DIG_POWER_SLAVE1_PD_REG (DR_REG_RTCCNTL_BASE + 0xa8)
/** RTC_CNTL_PD_WIFI_SWITCH_MASK : R/W; bitpos: [26:22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_PD_WIFI_SWITCH_MASK    0x0000001FU
#define RTC_CNTL_PD_WIFI_SWITCH_MASK_M  (RTC_CNTL_PD_WIFI_SWITCH_MASK_V << RTC_CNTL_PD_WIFI_SWITCH_MASK_S)
#define RTC_CNTL_PD_WIFI_SWITCH_MASK_V  0x0000001FU
#define RTC_CNTL_PD_WIFI_SWITCH_MASK_S  22
/** RTC_CNTL_PD_CPU_SWITCH_MASK : R/W; bitpos: [31:27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_PD_CPU_SWITCH_MASK    0x0000001FU
#define RTC_CNTL_PD_CPU_SWITCH_MASK_M  (RTC_CNTL_PD_CPU_SWITCH_MASK_V << RTC_CNTL_PD_CPU_SWITCH_MASK_S)
#define RTC_CNTL_PD_CPU_SWITCH_MASK_V  0x0000001FU
#define RTC_CNTL_PD_CPU_SWITCH_MASK_S  27

/** RTC_CNTL_DIG_POWER_SLAVE0_FPU_REG register
 *  register description
 */
#define RTC_CNTL_DIG_POWER_SLAVE0_FPU_REG (DR_REG_RTCCNTL_BASE + 0xac)
/** RTC_CNTL_XPD_DG_PERI_SWITCH_MASK : R/W; bitpos: [6:2]; default: 31;
 *  Need add description
 */
#define RTC_CNTL_XPD_DG_PERI_SWITCH_MASK    0x0000001FU
#define RTC_CNTL_XPD_DG_PERI_SWITCH_MASK_M  (RTC_CNTL_XPD_DG_PERI_SWITCH_MASK_V << RTC_CNTL_XPD_DG_PERI_SWITCH_MASK_S)
#define RTC_CNTL_XPD_DG_PERI_SWITCH_MASK_V  0x0000001FU
#define RTC_CNTL_XPD_DG_PERI_SWITCH_MASK_S  2
/** RTC_CNTL_XPD_DG_WRAP_SWITCH_MASK : R/W; bitpos: [11:7]; default: 31;
 *  Need add description
 */
#define RTC_CNTL_XPD_DG_WRAP_SWITCH_MASK    0x0000001FU
#define RTC_CNTL_XPD_DG_WRAP_SWITCH_MASK_M  (RTC_CNTL_XPD_DG_WRAP_SWITCH_MASK_V << RTC_CNTL_XPD_DG_WRAP_SWITCH_MASK_S)
#define RTC_CNTL_XPD_DG_WRAP_SWITCH_MASK_V  0x0000001FU
#define RTC_CNTL_XPD_DG_WRAP_SWITCH_MASK_S  7
/** RTC_CNTL_XPD_MEM_SWITCH_MASK : R/W; bitpos: [31:12]; default: 1048575;
 *  Need add description
 */
#define RTC_CNTL_XPD_MEM_SWITCH_MASK    0x000FFFFFU
#define RTC_CNTL_XPD_MEM_SWITCH_MASK_M  (RTC_CNTL_XPD_MEM_SWITCH_MASK_V << RTC_CNTL_XPD_MEM_SWITCH_MASK_S)
#define RTC_CNTL_XPD_MEM_SWITCH_MASK_V  0x000FFFFFU
#define RTC_CNTL_XPD_MEM_SWITCH_MASK_S  12

/** RTC_CNTL_DIG_POWER_SLAVE1_FPU_REG register
 *  register description
 */
#define RTC_CNTL_DIG_POWER_SLAVE1_FPU_REG (DR_REG_RTCCNTL_BASE + 0xb0)
/** RTC_CNTL_XPD_WIFI_SWITCH_MASK : R/W; bitpos: [26:22]; default: 31;
 *  Need add description
 */
#define RTC_CNTL_XPD_WIFI_SWITCH_MASK    0x0000001FU
#define RTC_CNTL_XPD_WIFI_SWITCH_MASK_M  (RTC_CNTL_XPD_WIFI_SWITCH_MASK_V << RTC_CNTL_XPD_WIFI_SWITCH_MASK_S)
#define RTC_CNTL_XPD_WIFI_SWITCH_MASK_V  0x0000001FU
#define RTC_CNTL_XPD_WIFI_SWITCH_MASK_S  22
/** RTC_CNTL_XPD_CPU_SWITCH_MASK : R/W; bitpos: [31:27]; default: 31;
 *  Need add description
 */
#define RTC_CNTL_XPD_CPU_SWITCH_MASK    0x0000001FU
#define RTC_CNTL_XPD_CPU_SWITCH_MASK_M  (RTC_CNTL_XPD_CPU_SWITCH_MASK_V << RTC_CNTL_XPD_CPU_SWITCH_MASK_S)
#define RTC_CNTL_XPD_CPU_SWITCH_MASK_V  0x0000001FU
#define RTC_CNTL_XPD_CPU_SWITCH_MASK_S  27

/** RTC_CNTL_DIG_ISO_REG register
 *  register description
 */
#define RTC_CNTL_DIG_ISO_REG (DR_REG_RTCCNTL_BASE + 0xb4)
/** RTC_CNTL_DG_MEM_FORCE_NOISO : R/W; bitpos: [5]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DG_MEM_FORCE_NOISO    (BIT(5))
#define RTC_CNTL_DG_MEM_FORCE_NOISO_M  (RTC_CNTL_DG_MEM_FORCE_NOISO_V << RTC_CNTL_DG_MEM_FORCE_NOISO_S)
#define RTC_CNTL_DG_MEM_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_DG_MEM_FORCE_NOISO_S  5
/** RTC_CNTL_DG_MEM_FORCE_ISO : R/W; bitpos: [6]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_MEM_FORCE_ISO    (BIT(6))
#define RTC_CNTL_DG_MEM_FORCE_ISO_M  (RTC_CNTL_DG_MEM_FORCE_ISO_V << RTC_CNTL_DG_MEM_FORCE_ISO_S)
#define RTC_CNTL_DG_MEM_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_DG_MEM_FORCE_ISO_S  6
/** RTC_CNTL_DIG_ISO_FORCE_OFF : R/W; bitpos: [7]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DIG_ISO_FORCE_OFF    (BIT(7))
#define RTC_CNTL_DIG_ISO_FORCE_OFF_M  (RTC_CNTL_DIG_ISO_FORCE_OFF_V << RTC_CNTL_DIG_ISO_FORCE_OFF_S)
#define RTC_CNTL_DIG_ISO_FORCE_OFF_V  0x00000001U
#define RTC_CNTL_DIG_ISO_FORCE_OFF_S  7
/** RTC_CNTL_DIG_ISO_FORCE_ON : R/W; bitpos: [8]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DIG_ISO_FORCE_ON    (BIT(8))
#define RTC_CNTL_DIG_ISO_FORCE_ON_M  (RTC_CNTL_DIG_ISO_FORCE_ON_V << RTC_CNTL_DIG_ISO_FORCE_ON_S)
#define RTC_CNTL_DIG_ISO_FORCE_ON_V  0x00000001U
#define RTC_CNTL_DIG_ISO_FORCE_ON_S  8
/** RTC_CNTL_DG_PAD_AUTOHOLD : RO; bitpos: [9]; default: 0;
 *  read only register to indicate digital pad auto-hold status
 */
#define RTC_CNTL_DG_PAD_AUTOHOLD    (BIT(9))
#define RTC_CNTL_DG_PAD_AUTOHOLD_M  (RTC_CNTL_DG_PAD_AUTOHOLD_V << RTC_CNTL_DG_PAD_AUTOHOLD_S)
#define RTC_CNTL_DG_PAD_AUTOHOLD_V  0x00000001U
#define RTC_CNTL_DG_PAD_AUTOHOLD_S  9
/** RTC_CNTL_CLR_DG_PAD_AUTOHOLD : WO; bitpos: [10]; default: 0;
 *  wtite only register to clear digital pad auto-hold
 */
#define RTC_CNTL_CLR_DG_PAD_AUTOHOLD    (BIT(10))
#define RTC_CNTL_CLR_DG_PAD_AUTOHOLD_M  (RTC_CNTL_CLR_DG_PAD_AUTOHOLD_V << RTC_CNTL_CLR_DG_PAD_AUTOHOLD_S)
#define RTC_CNTL_CLR_DG_PAD_AUTOHOLD_V  0x00000001U
#define RTC_CNTL_CLR_DG_PAD_AUTOHOLD_S  10
/** RTC_CNTL_DG_PAD_AUTOHOLD_EN : R/W; bitpos: [11]; default: 0;
 *  digital pad enable auto-hold
 */
#define RTC_CNTL_DG_PAD_AUTOHOLD_EN    (BIT(11))
#define RTC_CNTL_DG_PAD_AUTOHOLD_EN_M  (RTC_CNTL_DG_PAD_AUTOHOLD_EN_V << RTC_CNTL_DG_PAD_AUTOHOLD_EN_S)
#define RTC_CNTL_DG_PAD_AUTOHOLD_EN_V  0x00000001U
#define RTC_CNTL_DG_PAD_AUTOHOLD_EN_S  11
/** RTC_CNTL_DG_PAD_FORCE_NOISO : R/W; bitpos: [12]; default: 1;
 *  digital pad force no ISO
 */
#define RTC_CNTL_DG_PAD_FORCE_NOISO    (BIT(12))
#define RTC_CNTL_DG_PAD_FORCE_NOISO_M  (RTC_CNTL_DG_PAD_FORCE_NOISO_V << RTC_CNTL_DG_PAD_FORCE_NOISO_S)
#define RTC_CNTL_DG_PAD_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_DG_PAD_FORCE_NOISO_S  12
/** RTC_CNTL_DG_PAD_FORCE_ISO : R/W; bitpos: [13]; default: 0;
 *  digital pad force ISO
 */
#define RTC_CNTL_DG_PAD_FORCE_ISO    (BIT(13))
#define RTC_CNTL_DG_PAD_FORCE_ISO_M  (RTC_CNTL_DG_PAD_FORCE_ISO_V << RTC_CNTL_DG_PAD_FORCE_ISO_S)
#define RTC_CNTL_DG_PAD_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_DG_PAD_FORCE_ISO_S  13
/** RTC_CNTL_DG_PAD_FORCE_UNHOLD : R/W; bitpos: [14]; default: 1;
 *  digital pad force un-hold
 */
#define RTC_CNTL_DG_PAD_FORCE_UNHOLD    (BIT(14))
#define RTC_CNTL_DG_PAD_FORCE_UNHOLD_M  (RTC_CNTL_DG_PAD_FORCE_UNHOLD_V << RTC_CNTL_DG_PAD_FORCE_UNHOLD_S)
#define RTC_CNTL_DG_PAD_FORCE_UNHOLD_V  0x00000001U
#define RTC_CNTL_DG_PAD_FORCE_UNHOLD_S  14
/** RTC_CNTL_DG_PAD_FORCE_HOLD : R/W; bitpos: [15]; default: 0;
 *  digital pad force hold
 */
#define RTC_CNTL_DG_PAD_FORCE_HOLD    (BIT(15))
#define RTC_CNTL_DG_PAD_FORCE_HOLD_M  (RTC_CNTL_DG_PAD_FORCE_HOLD_V << RTC_CNTL_DG_PAD_FORCE_HOLD_S)
#define RTC_CNTL_DG_PAD_FORCE_HOLD_V  0x00000001U
#define RTC_CNTL_DG_PAD_FORCE_HOLD_S  15
/** RTC_CNTL_BT_FORCE_ISO : R/W; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BT_FORCE_ISO    (BIT(22))
#define RTC_CNTL_BT_FORCE_ISO_M  (RTC_CNTL_BT_FORCE_ISO_V << RTC_CNTL_BT_FORCE_ISO_S)
#define RTC_CNTL_BT_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_BT_FORCE_ISO_S  22
/** RTC_CNTL_BT_FORCE_NOISO : R/W; bitpos: [23]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_BT_FORCE_NOISO    (BIT(23))
#define RTC_CNTL_BT_FORCE_NOISO_M  (RTC_CNTL_BT_FORCE_NOISO_V << RTC_CNTL_BT_FORCE_NOISO_S)
#define RTC_CNTL_BT_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_BT_FORCE_NOISO_S  23
/** RTC_CNTL_DG_PERI_FORCE_ISO : R/W; bitpos: [24]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DG_PERI_FORCE_ISO    (BIT(24))
#define RTC_CNTL_DG_PERI_FORCE_ISO_M  (RTC_CNTL_DG_PERI_FORCE_ISO_V << RTC_CNTL_DG_PERI_FORCE_ISO_S)
#define RTC_CNTL_DG_PERI_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_DG_PERI_FORCE_ISO_S  24
/** RTC_CNTL_DG_PERI_FORCE_NOISO : R/W; bitpos: [25]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DG_PERI_FORCE_NOISO    (BIT(25))
#define RTC_CNTL_DG_PERI_FORCE_NOISO_M  (RTC_CNTL_DG_PERI_FORCE_NOISO_V << RTC_CNTL_DG_PERI_FORCE_NOISO_S)
#define RTC_CNTL_DG_PERI_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_DG_PERI_FORCE_NOISO_S  25
/** RTC_CNTL_CPU_TOP_FORCE_ISO : R/W; bitpos: [26]; default: 0;
 *  cpu force ISO
 */
#define RTC_CNTL_CPU_TOP_FORCE_ISO    (BIT(26))
#define RTC_CNTL_CPU_TOP_FORCE_ISO_M  (RTC_CNTL_CPU_TOP_FORCE_ISO_V << RTC_CNTL_CPU_TOP_FORCE_ISO_S)
#define RTC_CNTL_CPU_TOP_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_CPU_TOP_FORCE_ISO_S  26
/** RTC_CNTL_CPU_TOP_FORCE_NOISO : R/W; bitpos: [27]; default: 1;
 *  cpu force no ISO
 */
#define RTC_CNTL_CPU_TOP_FORCE_NOISO    (BIT(27))
#define RTC_CNTL_CPU_TOP_FORCE_NOISO_M  (RTC_CNTL_CPU_TOP_FORCE_NOISO_V << RTC_CNTL_CPU_TOP_FORCE_NOISO_S)
#define RTC_CNTL_CPU_TOP_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_CPU_TOP_FORCE_NOISO_S  27
/** RTC_CNTL_WIFI_FORCE_ISO : R/W; bitpos: [28]; default: 0;
 *  wifi force ISO
 */
#define RTC_CNTL_WIFI_FORCE_ISO    (BIT(28))
#define RTC_CNTL_WIFI_FORCE_ISO_M  (RTC_CNTL_WIFI_FORCE_ISO_V << RTC_CNTL_WIFI_FORCE_ISO_S)
#define RTC_CNTL_WIFI_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_WIFI_FORCE_ISO_S  28
/** RTC_CNTL_WIFI_FORCE_NOISO : R/W; bitpos: [29]; default: 1;
 *  wifi force no ISO
 */
#define RTC_CNTL_WIFI_FORCE_NOISO    (BIT(29))
#define RTC_CNTL_WIFI_FORCE_NOISO_M  (RTC_CNTL_WIFI_FORCE_NOISO_V << RTC_CNTL_WIFI_FORCE_NOISO_S)
#define RTC_CNTL_WIFI_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_WIFI_FORCE_NOISO_S  29
/** RTC_CNTL_DG_WRAP_FORCE_ISO : R/W; bitpos: [30]; default: 0;
 *  digital core force ISO
 */
#define RTC_CNTL_DG_WRAP_FORCE_ISO    (BIT(30))
#define RTC_CNTL_DG_WRAP_FORCE_ISO_M  (RTC_CNTL_DG_WRAP_FORCE_ISO_V << RTC_CNTL_DG_WRAP_FORCE_ISO_S)
#define RTC_CNTL_DG_WRAP_FORCE_ISO_V  0x00000001U
#define RTC_CNTL_DG_WRAP_FORCE_ISO_S  30
/** RTC_CNTL_DG_WRAP_FORCE_NOISO : R/W; bitpos: [31]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_DG_WRAP_FORCE_NOISO    (BIT(31))
#define RTC_CNTL_DG_WRAP_FORCE_NOISO_M  (RTC_CNTL_DG_WRAP_FORCE_NOISO_V << RTC_CNTL_DG_WRAP_FORCE_NOISO_S)
#define RTC_CNTL_DG_WRAP_FORCE_NOISO_V  0x00000001U
#define RTC_CNTL_DG_WRAP_FORCE_NOISO_S  31

/** RTC_CNTL_WDTCONFIG0_REG register
 *  register description
 */
#define RTC_CNTL_WDTCONFIG0_REG (DR_REG_RTCCNTL_BASE + 0xb8)
/** RTC_CNTL_WDT_CHIP_RESET_WIDTH : R/W; bitpos: [7:0]; default: 20;
 *  chip reset siginal pulse width
 */
#define RTC_CNTL_WDT_CHIP_RESET_WIDTH    0x000000FFU
#define RTC_CNTL_WDT_CHIP_RESET_WIDTH_M  (RTC_CNTL_WDT_CHIP_RESET_WIDTH_V << RTC_CNTL_WDT_CHIP_RESET_WIDTH_S)
#define RTC_CNTL_WDT_CHIP_RESET_WIDTH_V  0x000000FFU
#define RTC_CNTL_WDT_CHIP_RESET_WIDTH_S  0
/** RTC_CNTL_WDT_CHIP_RESET_EN : R/W; bitpos: [8]; default: 0;
 *  wdt reset whole chip enable
 */
#define RTC_CNTL_WDT_CHIP_RESET_EN    (BIT(8))
#define RTC_CNTL_WDT_CHIP_RESET_EN_M  (RTC_CNTL_WDT_CHIP_RESET_EN_V << RTC_CNTL_WDT_CHIP_RESET_EN_S)
#define RTC_CNTL_WDT_CHIP_RESET_EN_V  0x00000001U
#define RTC_CNTL_WDT_CHIP_RESET_EN_S  8
/** RTC_CNTL_WDT_PAUSE_IN_SLP : R/W; bitpos: [9]; default: 1;
 *  pause WDT in sleep
 */
#define RTC_CNTL_WDT_PAUSE_IN_SLP    (BIT(9))
#define RTC_CNTL_WDT_PAUSE_IN_SLP_M  (RTC_CNTL_WDT_PAUSE_IN_SLP_V << RTC_CNTL_WDT_PAUSE_IN_SLP_S)
#define RTC_CNTL_WDT_PAUSE_IN_SLP_V  0x00000001U
#define RTC_CNTL_WDT_PAUSE_IN_SLP_S  9
/** RTC_CNTL_WDT_APPCPU_RESET_EN : R/W; bitpos: [10]; default: 0;
 *  enable WDT reset APP CPU
 */
#define RTC_CNTL_WDT_APPCPU_RESET_EN    (BIT(10))
#define RTC_CNTL_WDT_APPCPU_RESET_EN_M  (RTC_CNTL_WDT_APPCPU_RESET_EN_V << RTC_CNTL_WDT_APPCPU_RESET_EN_S)
#define RTC_CNTL_WDT_APPCPU_RESET_EN_V  0x00000001U
#define RTC_CNTL_WDT_APPCPU_RESET_EN_S  10
/** RTC_CNTL_WDT_PROCPU_RESET_EN : R/W; bitpos: [11]; default: 0;
 *  enable WDT reset PRO CPU
 */
#define RTC_CNTL_WDT_PROCPU_RESET_EN    (BIT(11))
#define RTC_CNTL_WDT_PROCPU_RESET_EN_M  (RTC_CNTL_WDT_PROCPU_RESET_EN_V << RTC_CNTL_WDT_PROCPU_RESET_EN_S)
#define RTC_CNTL_WDT_PROCPU_RESET_EN_V  0x00000001U
#define RTC_CNTL_WDT_PROCPU_RESET_EN_S  11
/** RTC_CNTL_WDT_FLASHBOOT_MOD_EN : R/W; bitpos: [12]; default: 1;
 *  enable WDT in flash boot
 */
#define RTC_CNTL_WDT_FLASHBOOT_MOD_EN    (BIT(12))
#define RTC_CNTL_WDT_FLASHBOOT_MOD_EN_M  (RTC_CNTL_WDT_FLASHBOOT_MOD_EN_V << RTC_CNTL_WDT_FLASHBOOT_MOD_EN_S)
#define RTC_CNTL_WDT_FLASHBOOT_MOD_EN_V  0x00000001U
#define RTC_CNTL_WDT_FLASHBOOT_MOD_EN_S  12
/** RTC_CNTL_WDT_SYS_RESET_LENGTH : R/W; bitpos: [15:13]; default: 1;
 *  system reset counter length
 */
#define RTC_CNTL_WDT_SYS_RESET_LENGTH    0x00000007U
#define RTC_CNTL_WDT_SYS_RESET_LENGTH_M  (RTC_CNTL_WDT_SYS_RESET_LENGTH_V << RTC_CNTL_WDT_SYS_RESET_LENGTH_S)
#define RTC_CNTL_WDT_SYS_RESET_LENGTH_V  0x00000007U
#define RTC_CNTL_WDT_SYS_RESET_LENGTH_S  13
/** RTC_CNTL_WDT_CPU_RESET_LENGTH : R/W; bitpos: [18:16]; default: 1;
 *  CPU reset counter length
 */
#define RTC_CNTL_WDT_CPU_RESET_LENGTH    0x00000007U
#define RTC_CNTL_WDT_CPU_RESET_LENGTH_M  (RTC_CNTL_WDT_CPU_RESET_LENGTH_V << RTC_CNTL_WDT_CPU_RESET_LENGTH_S)
#define RTC_CNTL_WDT_CPU_RESET_LENGTH_V  0x00000007U
#define RTC_CNTL_WDT_CPU_RESET_LENGTH_S  16
/* RTC_CNTL_WDT_STGX : */
/*description: stage action selection values */
#define RTC_WDT_STG_SEL_OFF             0
#define RTC_WDT_STG_SEL_INT             1
#define RTC_WDT_STG_SEL_RESET_CPU       2
#define RTC_WDT_STG_SEL_RESET_SYSTEM    3
#define RTC_WDT_STG_SEL_RESET_RTC       4
/** RTC_CNTL_WDT_STG3 : R/W; bitpos: [21:19]; default: 0;
 *  1: interrupt stage en, 2: CPU reset stage en, 3: system reset stage en, 4: RTC
 *  reset stage en
 */
#define RTC_CNTL_WDT_STG3    0x00000007U
#define RTC_CNTL_WDT_STG3_M  (RTC_CNTL_WDT_STG3_V << RTC_CNTL_WDT_STG3_S)
#define RTC_CNTL_WDT_STG3_V  0x00000007U
#define RTC_CNTL_WDT_STG3_S  19
/** RTC_CNTL_WDT_STG2 : R/W; bitpos: [24:22]; default: 0;
 *  1: interrupt stage en, 2: CPU reset stage en, 3: system reset stage en, 4: RTC
 *  reset stage en
 */
#define RTC_CNTL_WDT_STG2    0x00000007U
#define RTC_CNTL_WDT_STG2_M  (RTC_CNTL_WDT_STG2_V << RTC_CNTL_WDT_STG2_S)
#define RTC_CNTL_WDT_STG2_V  0x00000007U
#define RTC_CNTL_WDT_STG2_S  22
/** RTC_CNTL_WDT_STG1 : R/W; bitpos: [27:25]; default: 0;
 *  1: interrupt stage en, 2: CPU reset stage en, 3: system reset stage en, 4: RTC
 *  reset stage en
 */
#define RTC_CNTL_WDT_STG1    0x00000007U
#define RTC_CNTL_WDT_STG1_M  (RTC_CNTL_WDT_STG1_V << RTC_CNTL_WDT_STG1_S)
#define RTC_CNTL_WDT_STG1_V  0x00000007U
#define RTC_CNTL_WDT_STG1_S  25
/** RTC_CNTL_WDT_STG0 : R/W; bitpos: [30:28]; default: 0;
 *  1: interrupt stage en, 2: CPU reset stage en, 3: system reset stage en, 4: RTC
 *  reset stage en
 */
#define RTC_CNTL_WDT_STG0    0x00000007U
#define RTC_CNTL_WDT_STG0_M  (RTC_CNTL_WDT_STG0_V << RTC_CNTL_WDT_STG0_S)
#define RTC_CNTL_WDT_STG0_V  0x00000007U
#define RTC_CNTL_WDT_STG0_S  28
/** RTC_CNTL_WDT_EN : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_WDT_EN    (BIT(31))
#define RTC_CNTL_WDT_EN_M  (RTC_CNTL_WDT_EN_V << RTC_CNTL_WDT_EN_S)
#define RTC_CNTL_WDT_EN_V  0x00000001U
#define RTC_CNTL_WDT_EN_S  31

/** RTC_CNTL_WDTCONFIG1_REG register
 *  register description
 */
#define RTC_CNTL_WDTCONFIG1_REG (DR_REG_RTCCNTL_BASE + 0xbc)
/** RTC_CNTL_WDT_STG0_HOLD : R/W; bitpos: [31:0]; default: 200000;
 *  Need add description
 */
#define RTC_CNTL_WDT_STG0_HOLD    0xFFFFFFFFU
#define RTC_CNTL_WDT_STG0_HOLD_M  (RTC_CNTL_WDT_STG0_HOLD_V << RTC_CNTL_WDT_STG0_HOLD_S)
#define RTC_CNTL_WDT_STG0_HOLD_V  0xFFFFFFFFU
#define RTC_CNTL_WDT_STG0_HOLD_S  0

