espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_WDTCONFIG2_REG register
 *  register description
 */
#define RTC_CNTL_WDTCONFIG2_REG (DR_REG_RTCCNTL_BASE + 0xc0)
/** RTC_CNTL_WDT_STG1_HOLD : R/W; bitpos: [31:0]; default: 80000;
 *  Need add description
 */
#define RTC_CNTL_WDT_STG1_HOLD    0xFFFFFFFFU
#define RTC_CNTL_WDT_STG1_HOLD_M  (RTC_CNTL_WDT_STG1_HOLD_V << RTC_CNTL_WDT_STG1_HOLD_S)
#define RTC_CNTL_WDT_STG1_HOLD_V  0xFFFFFFFFU
#define RTC_CNTL_WDT_STG1_HOLD_S  0

/** RTC_CNTL_WDTCONFIG3_REG register
 *  register description
 */
#define RTC_CNTL_WDTCONFIG3_REG (DR_REG_RTCCNTL_BASE + 0xc4)
/** RTC_CNTL_WDT_STG2_HOLD : R/W; bitpos: [31:0]; default: 4095;
 *  Need add description
 */
#define RTC_CNTL_WDT_STG2_HOLD    0xFFFFFFFFU
#define RTC_CNTL_WDT_STG2_HOLD_M  (RTC_CNTL_WDT_STG2_HOLD_V << RTC_CNTL_WDT_STG2_HOLD_S)
#define RTC_CNTL_WDT_STG2_HOLD_V  0xFFFFFFFFU
#define RTC_CNTL_WDT_STG2_HOLD_S  0

/** RTC_CNTL_WDTCONFIG4_REG register
 *  register description
 */
#define RTC_CNTL_WDTCONFIG4_REG (DR_REG_RTCCNTL_BASE + 0xc8)
/** RTC_CNTL_WDT_STG3_HOLD : R/W; bitpos: [31:0]; default: 4095;
 *  Need add description
 */
#define RTC_CNTL_WDT_STG3_HOLD    0xFFFFFFFFU
#define RTC_CNTL_WDT_STG3_HOLD_M  (RTC_CNTL_WDT_STG3_HOLD_V << RTC_CNTL_WDT_STG3_HOLD_S)
#define RTC_CNTL_WDT_STG3_HOLD_V  0xFFFFFFFFU
#define RTC_CNTL_WDT_STG3_HOLD_S  0

/** RTC_CNTL_WDTFEED_REG register
 *  register description
 */
#define RTC_CNTL_WDTFEED_REG (DR_REG_RTCCNTL_BASE + 0xcc)
/** RTC_CNTL_WDT_FEED : WO; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_WDT_FEED    (BIT(31))
#define RTC_CNTL_WDT_FEED_M  (RTC_CNTL_WDT_FEED_V << RTC_CNTL_WDT_FEED_S)
#define RTC_CNTL_WDT_FEED_V  0x00000001U
#define RTC_CNTL_WDT_FEED_S  31

/** RTC_CNTL_WDTWPROTECT_REG register
 *  register description
 */
#define RTC_CNTL_WDTWPROTECT_REG (DR_REG_RTCCNTL_BASE + 0xd0)
/** RTC_CNTL_WDT_WKEY : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_WDT_WKEY    0xFFFFFFFFU
#define RTC_CNTL_WDT_WKEY_M  (RTC_CNTL_WDT_WKEY_V << RTC_CNTL_WDT_WKEY_S)
#define RTC_CNTL_WDT_WKEY_V  0xFFFFFFFFU
#define RTC_CNTL_WDT_WKEY_S  0

/** RTC_CNTL_WDTRESET_CHIP_REG register
 *  register description
 */
#define RTC_CNTL_WDTRESET_CHIP_REG (DR_REG_RTCCNTL_BASE + 0xd4)
/** RTC_CNTL_RESET_CHIP_TARGET : R/W; bitpos: [23:16]; default: 165;
 *  Need add description
 */
#define RTC_CNTL_RESET_CHIP_TARGET    0x000000FFU
#define RTC_CNTL_RESET_CHIP_TARGET_M  (RTC_CNTL_RESET_CHIP_TARGET_V << RTC_CNTL_RESET_CHIP_TARGET_S)
#define RTC_CNTL_RESET_CHIP_TARGET_V  0x000000FFU
#define RTC_CNTL_RESET_CHIP_TARGET_S  16
/** RTC_CNTL_RESET_CHIP_KEY : R/W; bitpos: [31:24]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_RESET_CHIP_KEY    0x000000FFU
#define RTC_CNTL_RESET_CHIP_KEY_M  (RTC_CNTL_RESET_CHIP_KEY_V << RTC_CNTL_RESET_CHIP_KEY_S)
#define RTC_CNTL_RESET_CHIP_KEY_V  0x000000FFU
#define RTC_CNTL_RESET_CHIP_KEY_S  24

/** RTC_CNTL_SWD_CONF_REG register
 *  register description
 */
#define RTC_CNTL_SWD_CONF_REG (DR_REG_RTCCNTL_BASE + 0xd8)
/** RTC_CNTL_SWD_RESET_FLAG : RO; bitpos: [0]; default: 0;
 *  swd reset flag
 */
#define RTC_CNTL_SWD_RESET_FLAG    (BIT(0))
#define RTC_CNTL_SWD_RESET_FLAG_M  (RTC_CNTL_SWD_RESET_FLAG_V << RTC_CNTL_SWD_RESET_FLAG_S)
#define RTC_CNTL_SWD_RESET_FLAG_V  0x00000001U
#define RTC_CNTL_SWD_RESET_FLAG_S  0
/** RTC_CNTL_SWD_FEED_INT : RO; bitpos: [1]; default: 0;
 *  swd interrupt for feeding
 */
#define RTC_CNTL_SWD_FEED_INT    (BIT(1))
#define RTC_CNTL_SWD_FEED_INT_M  (RTC_CNTL_SWD_FEED_INT_V << RTC_CNTL_SWD_FEED_INT_S)
#define RTC_CNTL_SWD_FEED_INT_V  0x00000001U
#define RTC_CNTL_SWD_FEED_INT_S  1
/** RTC_CNTL_SWD_BYPASS_RST : R/W; bitpos: [17]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SWD_BYPASS_RST    (BIT(17))
#define RTC_CNTL_SWD_BYPASS_RST_M  (RTC_CNTL_SWD_BYPASS_RST_V << RTC_CNTL_SWD_BYPASS_RST_S)
#define RTC_CNTL_SWD_BYPASS_RST_V  0x00000001U
#define RTC_CNTL_SWD_BYPASS_RST_S  17
/** RTC_CNTL_SWD_SIGNAL_WIDTH : R/W; bitpos: [27:18]; default: 300;
 *  adjust signal width send to swd
 */
#define RTC_CNTL_SWD_SIGNAL_WIDTH    0x000003FFU
#define RTC_CNTL_SWD_SIGNAL_WIDTH_M  (RTC_CNTL_SWD_SIGNAL_WIDTH_V << RTC_CNTL_SWD_SIGNAL_WIDTH_S)
#define RTC_CNTL_SWD_SIGNAL_WIDTH_V  0x000003FFU
#define RTC_CNTL_SWD_SIGNAL_WIDTH_S  18
/** RTC_CNTL_SWD_RST_FLAG_CLR : WO; bitpos: [28]; default: 0;
 *  reset swd reset flag
 */
#define RTC_CNTL_SWD_RST_FLAG_CLR    (BIT(28))
#define RTC_CNTL_SWD_RST_FLAG_CLR_M  (RTC_CNTL_SWD_RST_FLAG_CLR_V << RTC_CNTL_SWD_RST_FLAG_CLR_S)
#define RTC_CNTL_SWD_RST_FLAG_CLR_V  0x00000001U
#define RTC_CNTL_SWD_RST_FLAG_CLR_S  28
/** RTC_CNTL_SWD_FEED : WO; bitpos: [29]; default: 0;
 *  Sw feed swd
 */
#define RTC_CNTL_SWD_FEED    (BIT(29))
#define RTC_CNTL_SWD_FEED_M  (RTC_CNTL_SWD_FEED_V << RTC_CNTL_SWD_FEED_S)
#define RTC_CNTL_SWD_FEED_V  0x00000001U
#define RTC_CNTL_SWD_FEED_S  29
/** RTC_CNTL_SWD_DISABLE : R/W; bitpos: [30]; default: 0;
 *  disabel SWD
 */
#define RTC_CNTL_SWD_DISABLE    (BIT(30))
#define RTC_CNTL_SWD_DISABLE_M  (RTC_CNTL_SWD_DISABLE_V << RTC_CNTL_SWD_DISABLE_S)
#define RTC_CNTL_SWD_DISABLE_V  0x00000001U
#define RTC_CNTL_SWD_DISABLE_S  30
/** RTC_CNTL_SWD_AUTO_FEED_EN : R/W; bitpos: [31]; default: 0;
 *  automatically feed swd when int comes
 */
#define RTC_CNTL_SWD_AUTO_FEED_EN    (BIT(31))
#define RTC_CNTL_SWD_AUTO_FEED_EN_M  (RTC_CNTL_SWD_AUTO_FEED_EN_V << RTC_CNTL_SWD_AUTO_FEED_EN_S)
#define RTC_CNTL_SWD_AUTO_FEED_EN_V  0x00000001U
#define RTC_CNTL_SWD_AUTO_FEED_EN_S  31

/** RTC_CNTL_SWD_WPROTECT_REG register
 *  register description
 */
#define RTC_CNTL_SWD_WPROTECT_REG (DR_REG_RTCCNTL_BASE + 0xdc)
/** RTC_CNTL_SWD_WKEY : R/W; bitpos: [31:0]; default: 0;
 *  swd write protect
 */
#define RTC_CNTL_SWD_WKEY    0xFFFFFFFFU
#define RTC_CNTL_SWD_WKEY_M  (RTC_CNTL_SWD_WKEY_V << RTC_CNTL_SWD_WKEY_S)
#define RTC_CNTL_SWD_WKEY_V  0xFFFFFFFFU
#define RTC_CNTL_SWD_WKEY_S  0

/** RTC_CNTL_SW_CPU_STALL_REG register
 *  register description
 */
#define RTC_CNTL_SW_CPU_STALL_REG (DR_REG_RTCCNTL_BASE + 0xe0)
/** RTC_CNTL_SW_STALL_APPCPU_C1 : R/W; bitpos: [25:20]; default: 0;
 *  {reg_sw_stall_appcpu_c1[5:0],  reg_sw_stall_appcpu_c0[1:0]} == 0x86 will stall APP
 *  CPU
 */
#define RTC_CNTL_SW_STALL_APPCPU_C1    0x0000003FU
#define RTC_CNTL_SW_STALL_APPCPU_C1_M  (RTC_CNTL_SW_STALL_APPCPU_C1_V << RTC_CNTL_SW_STALL_APPCPU_C1_S)
#define RTC_CNTL_SW_STALL_APPCPU_C1_V  0x0000003FU
#define RTC_CNTL_SW_STALL_APPCPU_C1_S  20
/** RTC_CNTL_SW_STALL_PROCPU_C1 : R/W; bitpos: [31:26]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SW_STALL_PROCPU_C1    0x0000003FU
#define RTC_CNTL_SW_STALL_PROCPU_C1_M  (RTC_CNTL_SW_STALL_PROCPU_C1_V << RTC_CNTL_SW_STALL_PROCPU_C1_S)
#define RTC_CNTL_SW_STALL_PROCPU_C1_V  0x0000003FU
#define RTC_CNTL_SW_STALL_PROCPU_C1_S  26

/** RTC_CNTL_STORE4_REG register
 *  register description
 */
#define RTC_CNTL_STORE4_REG (DR_REG_RTCCNTL_BASE + 0xe4)
/** RTC_CNTL_SCRATCH4 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SCRATCH4    0xFFFFFFFFU
#define RTC_CNTL_SCRATCH4_M  (RTC_CNTL_SCRATCH4_V << RTC_CNTL_SCRATCH4_S)
#define RTC_CNTL_SCRATCH4_V  0xFFFFFFFFU
#define RTC_CNTL_SCRATCH4_S  0

/** RTC_CNTL_STORE5_REG register
 *  register description
 */
#define RTC_CNTL_STORE5_REG (DR_REG_RTCCNTL_BASE + 0xe8)
/** RTC_CNTL_SCRATCH5 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SCRATCH5    0xFFFFFFFFU
#define RTC_CNTL_SCRATCH5_M  (RTC_CNTL_SCRATCH5_V << RTC_CNTL_SCRATCH5_S)
#define RTC_CNTL_SCRATCH5_V  0xFFFFFFFFU
#define RTC_CNTL_SCRATCH5_S  0

