espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_PAD_HOLD_REG register
 *  register description
 */
#define RTC_CNTL_PAD_HOLD_REG (DR_REG_RTCCNTL_BASE + 0xfc)
/** RTC_CNTL_GPIO_PIN0_HOLD : R/W; bitpos: [0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN0_HOLD    (BIT(0))
#define RTC_CNTL_GPIO_PIN0_HOLD_M  (RTC_CNTL_GPIO_PIN0_HOLD_V << RTC_CNTL_GPIO_PIN0_HOLD_S)
#define RTC_CNTL_GPIO_PIN0_HOLD_V  0x00000001U
#define RTC_CNTL_GPIO_PIN0_HOLD_S  0
/** RTC_CNTL_GPIO_PIN1_HOLD : R/W; bitpos: [1]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN1_HOLD    (BIT(1))
#define RTC_CNTL_GPIO_PIN1_HOLD_M  (RTC_CNTL_GPIO_PIN1_HOLD_V << RTC_CNTL_GPIO_PIN1_HOLD_S)
#define RTC_CNTL_GPIO_PIN1_HOLD_V  0x00000001U
#define RTC_CNTL_GPIO_PIN1_HOLD_S  1
/** RTC_CNTL_GPIO_PIN2_HOLD : R/W; bitpos: [2]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN2_HOLD    (BIT(2))
#define RTC_CNTL_GPIO_PIN2_HOLD_M  (RTC_CNTL_GPIO_PIN2_HOLD_V << RTC_CNTL_GPIO_PIN2_HOLD_S)
#define RTC_CNTL_GPIO_PIN2_HOLD_V  0x00000001U
#define RTC_CNTL_GPIO_PIN2_HOLD_S  2
/** RTC_CNTL_GPIO_PIN3_HOLD : R/W; bitpos: [3]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN3_HOLD    (BIT(3))
#define RTC_CNTL_GPIO_PIN3_HOLD_M  (RTC_CNTL_GPIO_PIN3_HOLD_V << RTC_CNTL_GPIO_PIN3_HOLD_S)
#define RTC_CNTL_GPIO_PIN3_HOLD_V  0x00000001U
#define RTC_CNTL_GPIO_PIN3_HOLD_S  3
/** RTC_CNTL_GPIO_PIN4_HOLD : R/W; bitpos: [4]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN4_HOLD    (BIT(4))
#define RTC_CNTL_GPIO_PIN4_HOLD_M  (RTC_CNTL_GPIO_PIN4_HOLD_V << RTC_CNTL_GPIO_PIN4_HOLD_S)
#define RTC_CNTL_GPIO_PIN4_HOLD_V  0x00000001U
#define RTC_CNTL_GPIO_PIN4_HOLD_S  4
/** RTC_CNTL_GPIO_PIN5_HOLD : R/W; bitpos: [5]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN5_HOLD    (BIT(5))
#define RTC_CNTL_GPIO_PIN5_HOLD_M  (RTC_CNTL_GPIO_PIN5_HOLD_V << RTC_CNTL_GPIO_PIN5_HOLD_S)
#define RTC_CNTL_GPIO_PIN5_HOLD_V  0x00000001U
#define RTC_CNTL_GPIO_PIN5_HOLD_S  5

/** RTC_CNTL_DIG_PAD_HOLD_REG register
 *  register description
 */
#define RTC_CNTL_DIG_PAD_HOLD_REG (DR_REG_RTCCNTL_BASE + 0x100)
/** RTC_CNTL_DIG_PAD_HOLD : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DIG_PAD_HOLD    0xFFFFFFFFU
#define RTC_CNTL_DIG_PAD_HOLD_M  (RTC_CNTL_DIG_PAD_HOLD_V << RTC_CNTL_DIG_PAD_HOLD_S)
#define RTC_CNTL_DIG_PAD_HOLD_V  0xFFFFFFFFU
#define RTC_CNTL_DIG_PAD_HOLD_S  0

/** RTC_CNTL_DIG_PAD_HOLD1_REG register
 *  register description
 */
#define RTC_CNTL_DIG_PAD_HOLD1_REG (DR_REG_RTCCNTL_BASE + 0x104)
/** RTC_CNTL_DIG_PAD_HOLD1 : R/W; bitpos: [8:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DIG_PAD_HOLD1    0x000001FFU
#define RTC_CNTL_DIG_PAD_HOLD1_M  (RTC_CNTL_DIG_PAD_HOLD1_V << RTC_CNTL_DIG_PAD_HOLD1_S)
#define RTC_CNTL_DIG_PAD_HOLD1_V  0x000001FFU
#define RTC_CNTL_DIG_PAD_HOLD1_S  0

/** RTC_CNTL_BROWN_OUT_REG register
 *  register description
 */
#define RTC_CNTL_BROWN_OUT_REG (DR_REG_RTCCNTL_BASE + 0x108)
/** RTC_CNTL_BROWN_OUT_INT_WAIT : R/W; bitpos: [13:4]; default: 1;
 *  brown out interrupt wait cycles
 */
#define RTC_CNTL_BROWN_OUT_INT_WAIT    0x000003FFU
#define RTC_CNTL_BROWN_OUT_INT_WAIT_M  (RTC_CNTL_BROWN_OUT_INT_WAIT_V << RTC_CNTL_BROWN_OUT_INT_WAIT_S)
#define RTC_CNTL_BROWN_OUT_INT_WAIT_V  0x000003FFU
#define RTC_CNTL_BROWN_OUT_INT_WAIT_S  4
/** RTC_CNTL_BROWN_OUT_CLOSE_FLASH_ENA : R/W; bitpos: [14]; default: 0;
 *  enable close flash when brown out happens
 */
#define RTC_CNTL_BROWN_OUT_CLOSE_FLASH_ENA    (BIT(14))
#define RTC_CNTL_BROWN_OUT_CLOSE_FLASH_ENA_M  (RTC_CNTL_BROWN_OUT_CLOSE_FLASH_ENA_V << RTC_CNTL_BROWN_OUT_CLOSE_FLASH_ENA_S)
#define RTC_CNTL_BROWN_OUT_CLOSE_FLASH_ENA_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_CLOSE_FLASH_ENA_S  14
/** RTC_CNTL_BROWN_OUT_PD_RF_ENA : R/W; bitpos: [15]; default: 0;
 *  enable power down RF when brown out happens
 */
#define RTC_CNTL_BROWN_OUT_PD_RF_ENA    (BIT(15))
#define RTC_CNTL_BROWN_OUT_PD_RF_ENA_M  (RTC_CNTL_BROWN_OUT_PD_RF_ENA_V << RTC_CNTL_BROWN_OUT_PD_RF_ENA_S)
#define RTC_CNTL_BROWN_OUT_PD_RF_ENA_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_PD_RF_ENA_S  15
/** RTC_CNTL_BROWN_OUT_RST_WAIT : R/W; bitpos: [25:16]; default: 1023;
 *  brown out reset wait cycles
 */
#define RTC_CNTL_BROWN_OUT_RST_WAIT    0x000003FFU
#define RTC_CNTL_BROWN_OUT_RST_WAIT_M  (RTC_CNTL_BROWN_OUT_RST_WAIT_V << RTC_CNTL_BROWN_OUT_RST_WAIT_S)
#define RTC_CNTL_BROWN_OUT_RST_WAIT_V  0x000003FFU
#define RTC_CNTL_BROWN_OUT_RST_WAIT_S  16
/** RTC_CNTL_BROWN_OUT_RST_ENA : R/W; bitpos: [26]; default: 0;
 *  enable brown out reset
 */
#define RTC_CNTL_BROWN_OUT_RST_ENA    (BIT(26))
#define RTC_CNTL_BROWN_OUT_RST_ENA_M  (RTC_CNTL_BROWN_OUT_RST_ENA_V << RTC_CNTL_BROWN_OUT_RST_ENA_S)
#define RTC_CNTL_BROWN_OUT_RST_ENA_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_RST_ENA_S  26
/** RTC_CNTL_BROWN_OUT_RST_SEL : R/W; bitpos: [27]; default: 0;
 *  1:  4-pos reset,    0:  sys_reset
 */
#define RTC_CNTL_BROWN_OUT_RST_SEL    (BIT(27))
#define RTC_CNTL_BROWN_OUT_RST_SEL_M  (RTC_CNTL_BROWN_OUT_RST_SEL_V << RTC_CNTL_BROWN_OUT_RST_SEL_S)
#define RTC_CNTL_BROWN_OUT_RST_SEL_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_RST_SEL_S  27
/** RTC_CNTL_BROWN_OUT_ANA_RST_EN : R/W; bitpos: [28]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BROWN_OUT_ANA_RST_EN    (BIT(28))
#define RTC_CNTL_BROWN_OUT_ANA_RST_EN_M  (RTC_CNTL_BROWN_OUT_ANA_RST_EN_V << RTC_CNTL_BROWN_OUT_ANA_RST_EN_S)
#define RTC_CNTL_BROWN_OUT_ANA_RST_EN_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_ANA_RST_EN_S  28
/** RTC_CNTL_BROWN_OUT_CNT_CLR : WO; bitpos: [29]; default: 0;
 *  clear brown out counter
 */
#define RTC_CNTL_BROWN_OUT_CNT_CLR    (BIT(29))
#define RTC_CNTL_BROWN_OUT_CNT_CLR_M  (RTC_CNTL_BROWN_OUT_CNT_CLR_V << RTC_CNTL_BROWN_OUT_CNT_CLR_S)
#define RTC_CNTL_BROWN_OUT_CNT_CLR_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_CNT_CLR_S  29
/** RTC_CNTL_BROWN_OUT_ENA : R/W; bitpos: [30]; default: 1;
 *  enable brown out
 */
#define RTC_CNTL_BROWN_OUT_ENA    (BIT(30))
#define RTC_CNTL_BROWN_OUT_ENA_M  (RTC_CNTL_BROWN_OUT_ENA_V << RTC_CNTL_BROWN_OUT_ENA_S)
#define RTC_CNTL_BROWN_OUT_ENA_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_ENA_S  30
/** RTC_CNTL_BROWN_OUT_DET : RO; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BROWN_OUT_DET    (BIT(31))
#define RTC_CNTL_BROWN_OUT_DET_M  (RTC_CNTL_BROWN_OUT_DET_V << RTC_CNTL_BROWN_OUT_DET_S)
#define RTC_CNTL_BROWN_OUT_DET_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_DET_S  31

/** RTC_CNTL_TIME_LOW1_REG register
 *  register description
 */
#define RTC_CNTL_TIME_LOW1_REG (DR_REG_RTCCNTL_BASE + 0x10c)
/** RTC_CNTL_TIMER_VALUE1_LOW : RO; bitpos: [31:0]; default: 0;
 *  RTC timer low 32 bits
 */
#define RTC_CNTL_TIMER_VALUE1_LOW    0xFFFFFFFFU
#define RTC_CNTL_TIMER_VALUE1_LOW_M  (RTC_CNTL_TIMER_VALUE1_LOW_V << RTC_CNTL_TIMER_VALUE1_LOW_S)
#define RTC_CNTL_TIMER_VALUE1_LOW_V  0xFFFFFFFFU
#define RTC_CNTL_TIMER_VALUE1_LOW_S  0

/** RTC_CNTL_TIME_HIGH1_REG register
 *  register description
 */
#define RTC_CNTL_TIME_HIGH1_REG (DR_REG_RTCCNTL_BASE + 0x110)
/** RTC_CNTL_TIMER_VALUE1_HIGH : RO; bitpos: [15:0]; default: 0;
 *  RTC timer high 16 bits
 */
#define RTC_CNTL_TIMER_VALUE1_HIGH    0x0000FFFFU
#define RTC_CNTL_TIMER_VALUE1_HIGH_M  (RTC_CNTL_TIMER_VALUE1_HIGH_V << RTC_CNTL_TIMER_VALUE1_HIGH_S)
#define RTC_CNTL_TIMER_VALUE1_HIGH_V  0x0000FFFFU
#define RTC_CNTL_TIMER_VALUE1_HIGH_S  0

