espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_XTAL32K_CLK_FACTOR_REG register
 *  register description
 */
#define RTC_CNTL_XTAL32K_CLK_FACTOR_REG (DR_REG_RTCCNTL_BASE + 0x114)
/** RTC_CNTL_XTAL32K_CLK_FACTOR : R/W; bitpos: [31:0]; default: 0;
 *  xtal 32k watch dog backup clock factor
 */
#define RTC_CNTL_XTAL32K_CLK_FACTOR    0xFFFFFFFFU
#define RTC_CNTL_XTAL32K_CLK_FACTOR_M  (RTC_CNTL_XTAL32K_CLK_FACTOR_V << RTC_CNTL_XTAL32K_CLK_FACTOR_S)
#define RTC_CNTL_XTAL32K_CLK_FACTOR_V  0xFFFFFFFFU
#define RTC_CNTL_XTAL32K_CLK_FACTOR_S  0

/** RTC_CNTL_XTAL32K_CONF_REG register
 *  register description
 */
#define RTC_CNTL_XTAL32K_CONF_REG (DR_REG_RTCCNTL_BASE + 0x118)
/** RTC_CNTL_XTAL32K_RETURN_WAIT : R/W; bitpos: [3:0]; default: 0;
 *  cycles to wait to return noral xtal 32k
 */
#define RTC_CNTL_XTAL32K_RETURN_WAIT    0x0000000FU
#define RTC_CNTL_XTAL32K_RETURN_WAIT_M  (RTC_CNTL_XTAL32K_RETURN_WAIT_V << RTC_CNTL_XTAL32K_RETURN_WAIT_S)
#define RTC_CNTL_XTAL32K_RETURN_WAIT_V  0x0000000FU
#define RTC_CNTL_XTAL32K_RETURN_WAIT_S  0
/** RTC_CNTL_XTAL32K_RESTART_WAIT : R/W; bitpos: [19:4]; default: 0;
 *  cycles to wait to repower on xtal 32k
 */
#define RTC_CNTL_XTAL32K_RESTART_WAIT    0x0000FFFFU
#define RTC_CNTL_XTAL32K_RESTART_WAIT_M  (RTC_CNTL_XTAL32K_RESTART_WAIT_V << RTC_CNTL_XTAL32K_RESTART_WAIT_S)
#define RTC_CNTL_XTAL32K_RESTART_WAIT_V  0x0000FFFFU
#define RTC_CNTL_XTAL32K_RESTART_WAIT_S  4
/** RTC_CNTL_XTAL32K_WDT_TIMEOUT : R/W; bitpos: [27:20]; default: 255;
 *  If no clock detected for this amount of time, 32k is regarded as dead
 */
#define RTC_CNTL_XTAL32K_WDT_TIMEOUT    0x000000FFU
#define RTC_CNTL_XTAL32K_WDT_TIMEOUT_M  (RTC_CNTL_XTAL32K_WDT_TIMEOUT_V << RTC_CNTL_XTAL32K_WDT_TIMEOUT_S)
#define RTC_CNTL_XTAL32K_WDT_TIMEOUT_V  0x000000FFU
#define RTC_CNTL_XTAL32K_WDT_TIMEOUT_S  20
/** RTC_CNTL_XTAL32K_STABLE_THRES : R/W; bitpos: [31:28]; default: 0;
 *  if restarted xtal32k period is smaller than this, it is regarded as stable
 */
#define RTC_CNTL_XTAL32K_STABLE_THRES    0x0000000FU
#define RTC_CNTL_XTAL32K_STABLE_THRES_M  (RTC_CNTL_XTAL32K_STABLE_THRES_V << RTC_CNTL_XTAL32K_STABLE_THRES_S)
#define RTC_CNTL_XTAL32K_STABLE_THRES_V  0x0000000FU
#define RTC_CNTL_XTAL32K_STABLE_THRES_S  28

/** RTC_CNTL_USB_CONF_REG register
 *  register description
 */
#define RTC_CNTL_USB_CONF_REG (DR_REG_RTCCNTL_BASE + 0x11c)
/** RTC_CNTL_IO_MUX_RESET_DISABLE : R/W; bitpos: [18]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_IO_MUX_RESET_DISABLE    (BIT(18))
#define RTC_CNTL_IO_MUX_RESET_DISABLE_M  (RTC_CNTL_IO_MUX_RESET_DISABLE_V << RTC_CNTL_IO_MUX_RESET_DISABLE_S)
#define RTC_CNTL_IO_MUX_RESET_DISABLE_V  0x00000001U
#define RTC_CNTL_IO_MUX_RESET_DISABLE_S  18

/** RTC_CNTL_SLP_REJECT_CAUSE_REG register
 *  register description
 */
#define RTC_CNTL_SLP_REJECT_CAUSE_REG (DR_REG_RTCCNTL_BASE + 0x120)
/** RTC_CNTL_REJECT_CAUSE : RO; bitpos: [18:0]; default: 0;
 *  sleep reject cause
 */
#define RTC_CNTL_REJECT_CAUSE    0x0007FFFFU
#define RTC_CNTL_REJECT_CAUSE_M  (RTC_CNTL_REJECT_CAUSE_V << RTC_CNTL_REJECT_CAUSE_S)
#define RTC_CNTL_REJECT_CAUSE_V  0x0007FFFFU
#define RTC_CNTL_REJECT_CAUSE_S  0

/** RTC_CNTL_OPTION1_REG register
 *  register description
 */
#define RTC_CNTL_OPTION1_REG (DR_REG_RTCCNTL_BASE + 0x124)
/** RTC_CNTL_FORCE_DOWNLOAD_BOOT : R/W; bitpos: [0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_FORCE_DOWNLOAD_BOOT    (BIT(0))
#define RTC_CNTL_FORCE_DOWNLOAD_BOOT_M  (RTC_CNTL_FORCE_DOWNLOAD_BOOT_V << RTC_CNTL_FORCE_DOWNLOAD_BOOT_S)
#define RTC_CNTL_FORCE_DOWNLOAD_BOOT_V  0x00000001U
#define RTC_CNTL_FORCE_DOWNLOAD_BOOT_S  0

/** RTC_CNTL_SLP_WAKEUP_CAUSE_REG register
 *  register description
 */
#define RTC_CNTL_SLP_WAKEUP_CAUSE_REG (DR_REG_RTCCNTL_BASE + 0x128)
/** RTC_CNTL_WAKEUP_CAUSE : RO; bitpos: [18:0]; default: 0;
 *  sleep wakeup cause
 */
#define RTC_CNTL_WAKEUP_CAUSE    0x0007FFFFU
#define RTC_CNTL_WAKEUP_CAUSE_M  (RTC_CNTL_WAKEUP_CAUSE_V << RTC_CNTL_WAKEUP_CAUSE_S)
#define RTC_CNTL_WAKEUP_CAUSE_V  0x0007FFFFU
#define RTC_CNTL_WAKEUP_CAUSE_S  0

/** RTC_CNTL_ULP_CP_TIMER_1_REG register
 *  register description
 */
#define RTC_CNTL_ULP_CP_TIMER_1_REG (DR_REG_RTCCNTL_BASE + 0x12c)
/** RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE : R/W; bitpos: [31:8]; default: 200;
 *  sleep cycles for ULP-coprocessor timer
 */
#define RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE    0x00FFFFFFU
#define RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_M  (RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_V << RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_S)
#define RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_V  0x00FFFFFFU
#define RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_S  8

/** RTC_CNTL_INT_ENA_RTC_W1TS_REG register
 *  register description
 */
#define RTC_CNTL_INT_ENA_RTC_W1TS_REG (DR_REG_RTCCNTL_BASE + 0x130)
/** RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS : WO; bitpos: [0]; default: 0;
 *  enable sleep wakeup interrupt
 */
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_M  (RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_V << RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_S)
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_S  0
/** RTC_CNTL_SLP_REJECT_INT_ENA_W1TS : WO; bitpos: [1]; default: 0;
 *  enable sleep reject interrupt
 */
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_M  (RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_V << RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_S)
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_S  1
/** RTC_CNTL_WDT_INT_ENA_W1TS : WO; bitpos: [3]; default: 0;
 *  enable RTC WDT interrupt
 */
#define RTC_CNTL_WDT_INT_ENA_W1TS    (BIT(3))
#define RTC_CNTL_WDT_INT_ENA_W1TS_M  (RTC_CNTL_WDT_INT_ENA_W1TS_V << RTC_CNTL_WDT_INT_ENA_W1TS_S)
#define RTC_CNTL_WDT_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_WDT_INT_ENA_W1TS_S  3
/** RTC_CNTL_BROWN_OUT_INT_ENA_W1TS : WO; bitpos: [9]; default: 0;
 *  enable brown out interrupt
 */
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TS    (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TS_M  (RTC_CNTL_BROWN_OUT_INT_ENA_W1TS_V << RTC_CNTL_BROWN_OUT_INT_ENA_W1TS_S)
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TS_S  9
/** RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS : WO; bitpos: [10]; default: 0;
 *  enable RTC main timer interrupt
 */
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS    (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS_M  (RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS_V << RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS_S)
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS_S  10
/** RTC_CNTL_SWD_INT_ENA_W1TS : WO; bitpos: [15]; default: 0;
 *  enable super watch dog interrupt
 */
#define RTC_CNTL_SWD_INT_ENA_W1TS    (BIT(15))
#define RTC_CNTL_SWD_INT_ENA_W1TS_M  (RTC_CNTL_SWD_INT_ENA_W1TS_V << RTC_CNTL_SWD_INT_ENA_W1TS_S)
#define RTC_CNTL_SWD_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_SWD_INT_ENA_W1TS_S  15
/** RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS : WO; bitpos: [16]; default: 0;
 *  enable xtal32k_dead  interrupt
 */
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS    (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS_M  (RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS_V << RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS_S)
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS_S  16
/** RTC_CNTL_GLITCH_DET_INT_ENA_W1TS : WO; bitpos: [19]; default: 0;
 *  enbale gitch det interrupt
 */
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TS    (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TS_M  (RTC_CNTL_GLITCH_DET_INT_ENA_W1TS_V << RTC_CNTL_GLITCH_DET_INT_ENA_W1TS_S)
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TS_S  19
/** RTC_CNTL_BBPLL_CAL_INT_ENA_W1TS : WO; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BBPLL_CAL_INT_ENA_W1TS    (BIT(20))
#define RTC_CNTL_BBPLL_CAL_INT_ENA_W1TS_M  (RTC_CNTL_BBPLL_CAL_INT_ENA_W1TS_V << RTC_CNTL_BBPLL_CAL_INT_ENA_W1TS_S)
#define RTC_CNTL_BBPLL_CAL_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_BBPLL_CAL_INT_ENA_W1TS_S  20
/** RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TS : WO; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TS    (BIT(21))
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TS_M  (RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TS_V << RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TS_S)
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TS_S  21
/** RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TS : WO; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TS    (BIT(22))
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TS_M  (RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TS_V << RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TS_S)
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TS_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TS_S  22

/** RTC_CNTL_INT_ENA_RTC_W1TC_REG register
 *  register description
 */
#define RTC_CNTL_INT_ENA_RTC_W1TC_REG (DR_REG_RTCCNTL_BASE + 0x134)
/** RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC : WO; bitpos: [0]; default: 0;
 *  enable sleep wakeup interrupt
 */
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_M  (RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_V << RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_S)
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_S  0
/** RTC_CNTL_SLP_REJECT_INT_ENA_W1TC : WO; bitpos: [1]; default: 0;
 *  enable sleep reject interrupt
 */
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_M  (RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_V << RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_S)
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_S  1
/** RTC_CNTL_WDT_INT_ENA_W1TC : WO; bitpos: [3]; default: 0;
 *  enable RTC WDT interrupt
 */
#define RTC_CNTL_WDT_INT_ENA_W1TC    (BIT(3))
#define RTC_CNTL_WDT_INT_ENA_W1TC_M  (RTC_CNTL_WDT_INT_ENA_W1TC_V << RTC_CNTL_WDT_INT_ENA_W1TC_S)
#define RTC_CNTL_WDT_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_WDT_INT_ENA_W1TC_S  3
/** RTC_CNTL_BROWN_OUT_INT_ENA_W1TC : WO; bitpos: [9]; default: 0;
 *  enable brown out interrupt
 */
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TC    (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TC_M  (RTC_CNTL_BROWN_OUT_INT_ENA_W1TC_V << RTC_CNTL_BROWN_OUT_INT_ENA_W1TC_S)
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TC_S  9
/** RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC : WO; bitpos: [10]; default: 0;
 *  enable RTC main timer interrupt
 */
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC    (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC_M  (RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC_V << RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC_S)
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC_S  10
/** RTC_CNTL_SWD_INT_ENA_W1TC : WO; bitpos: [15]; default: 0;
 *  enable super watch dog interrupt
 */
#define RTC_CNTL_SWD_INT_ENA_W1TC    (BIT(15))
#define RTC_CNTL_SWD_INT_ENA_W1TC_M  (RTC_CNTL_SWD_INT_ENA_W1TC_V << RTC_CNTL_SWD_INT_ENA_W1TC_S)
#define RTC_CNTL_SWD_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_SWD_INT_ENA_W1TC_S  15
/** RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC : WO; bitpos: [16]; default: 0;
 *  enable xtal32k_dead  interrupt
 */
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC    (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC_M  (RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC_V << RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC_S)
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC_S  16
/** RTC_CNTL_GLITCH_DET_INT_ENA_W1TC : WO; bitpos: [19]; default: 0;
 *  enbale gitch det interrupt
 */
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TC    (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TC_M  (RTC_CNTL_GLITCH_DET_INT_ENA_W1TC_V << RTC_CNTL_GLITCH_DET_INT_ENA_W1TC_S)
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TC_S  19
/** RTC_CNTL_BBPLL_CAL_INT_ENA_W1TC : WO; bitpos: [20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BBPLL_CAL_INT_ENA_W1TC    (BIT(20))
#define RTC_CNTL_BBPLL_CAL_INT_ENA_W1TC_M  (RTC_CNTL_BBPLL_CAL_INT_ENA_W1TC_V << RTC_CNTL_BBPLL_CAL_INT_ENA_W1TC_S)
#define RTC_CNTL_BBPLL_CAL_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_BBPLL_CAL_INT_ENA_W1TC_S  20
/** RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TC : WO; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TC    (BIT(21))
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TC_M  (RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TC_V << RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TC_S)
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_BLE_COMPARE_WAKE_INT_ENA_W1TC_S  21
/** RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TC : WO; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TC    (BIT(22))
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TC_M  (RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TC_V << RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TC_S)
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TC_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_DONE_INT_ENA_W1TC_S  22

/** RTC_CNTL_RETENTION_CTRL_REG register
 *  register description
 */
#define RTC_CNTL_RETENTION_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x138)
/** RTC_CNTL_CLK_EN : R/W; bitpos: [17]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_CLK_EN    (BIT(17))
#define RTC_CNTL_CLK_EN_M  (RTC_CNTL_CLK_EN_V << RTC_CNTL_CLK_EN_S)
#define RTC_CNTL_CLK_EN_V  0x00000001U
#define RTC_CNTL_CLK_EN_S  17
/** RTC_CNTL_RETENTION_CLK_SEL : R/W; bitpos: [18]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_RETENTION_CLK_SEL    (BIT(18))
#define RTC_CNTL_RETENTION_CLK_SEL_M  (RTC_CNTL_RETENTION_CLK_SEL_V << RTC_CNTL_RETENTION_CLK_SEL_S)
#define RTC_CNTL_RETENTION_CLK_SEL_V  0x00000001U
#define RTC_CNTL_RETENTION_CLK_SEL_S  18
/** RTC_CNTL_RETENTION_DONE_WAIT : R/W; bitpos: [21:19]; default: 2;
 *  Need add description
 */
#define RTC_CNTL_RETENTION_DONE_WAIT    0x00000007U
#define RTC_CNTL_RETENTION_DONE_WAIT_M  (RTC_CNTL_RETENTION_DONE_WAIT_V << RTC_CNTL_RETENTION_DONE_WAIT_S)
#define RTC_CNTL_RETENTION_DONE_WAIT_V  0x00000007U
#define RTC_CNTL_RETENTION_DONE_WAIT_S  19
/** RTC_CNTL_RETENTION_CLKOFF_WAIT : R/W; bitpos: [25:22]; default: 3;
 *  Need add description
 */
#define RTC_CNTL_RETENTION_CLKOFF_WAIT    0x0000000FU
#define RTC_CNTL_RETENTION_CLKOFF_WAIT_M  (RTC_CNTL_RETENTION_CLKOFF_WAIT_V << RTC_CNTL_RETENTION_CLKOFF_WAIT_S)
#define RTC_CNTL_RETENTION_CLKOFF_WAIT_V  0x0000000FU
#define RTC_CNTL_RETENTION_CLKOFF_WAIT_S  22
/** RTC_CNTL_RETENTION_EN : R/W; bitpos: [26]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_RETENTION_EN    (BIT(26))
#define RTC_CNTL_RETENTION_EN_M  (RTC_CNTL_RETENTION_EN_V << RTC_CNTL_RETENTION_EN_S)
#define RTC_CNTL_RETENTION_EN_V  0x00000001U
#define RTC_CNTL_RETENTION_EN_S  26
/** RTC_CNTL_RETENTION_WAIT : R/W; bitpos: [31:27]; default: 20;
 *  wait cycles for rention operation
 */
#define RTC_CNTL_RETENTION_WAIT    0x0000001FU
#define RTC_CNTL_RETENTION_WAIT_M  (RTC_CNTL_RETENTION_WAIT_V << RTC_CNTL_RETENTION_WAIT_S)
#define RTC_CNTL_RETENTION_WAIT_V  0x0000001FU
#define RTC_CNTL_RETENTION_WAIT_S  27

/** RTC_CNTL_RETENTION_CTRL1_REG register
 *  register description
 */
#define RTC_CNTL_RETENTION_CTRL1_REG (DR_REG_RTCCNTL_BASE + 0x13c)
/** RTC_CNTL_RETENTION_LINK_ADDR : R/W; bitpos: [26:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_RETENTION_LINK_ADDR    0x07FFFFFFU
#define RTC_CNTL_RETENTION_LINK_ADDR_M  (RTC_CNTL_RETENTION_LINK_ADDR_V << RTC_CNTL_RETENTION_LINK_ADDR_S)
#define RTC_CNTL_RETENTION_LINK_ADDR_V  0x07FFFFFFU
#define RTC_CNTL_RETENTION_LINK_ADDR_S  0

/** RTC_CNTL_FIB_SEL_REG register
 *  register description
 */
#define RTC_CNTL_FIB_SEL_REG (DR_REG_RTCCNTL_BASE + 0x140)
/** RTC_CNTL_FIB_SEL : R/W; bitpos: [2:0]; default: 7;
 *  select use analog fib signal
 */
#define RTC_CNTL_FIB_SEL    0x00000007U
#define RTC_CNTL_FIB_SEL_M  (RTC_CNTL_FIB_SEL_V << RTC_CNTL_FIB_SEL_S)
#define RTC_CNTL_FIB_SEL_V  0x00000007U
#define RTC_CNTL_FIB_SEL_S  0

#define RTC_CNTL_FIB_GLITCH_RST BIT(0)
#define RTC_CNTL_FIB_BOD_RST BIT(1)
#define RTC_CNTL_FIB_SUPER_WDT_RST BIT(2)

/** RTC_CNTL_GPIO_WAKEUP_REG register
 *  register description
 */
#define RTC_CNTL_GPIO_WAKEUP_REG (DR_REG_RTCCNTL_BASE + 0x144)
/** RTC_CNTL_GPIO_WAKEUP_STATUS : RO; bitpos: [5:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_WAKEUP_STATUS    0x0000003FU
#define RTC_CNTL_GPIO_WAKEUP_STATUS_M  (RTC_CNTL_GPIO_WAKEUP_STATUS_V << RTC_CNTL_GPIO_WAKEUP_STATUS_S)
#define RTC_CNTL_GPIO_WAKEUP_STATUS_V  0x0000003FU
#define RTC_CNTL_GPIO_WAKEUP_STATUS_S  0
/** RTC_CNTL_GPIO_WAKEUP_STATUS_CLR : R/W; bitpos: [6]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_WAKEUP_STATUS_CLR    (BIT(6))
#define RTC_CNTL_GPIO_WAKEUP_STATUS_CLR_M  (RTC_CNTL_GPIO_WAKEUP_STATUS_CLR_V << RTC_CNTL_GPIO_WAKEUP_STATUS_CLR_S)
#define RTC_CNTL_GPIO_WAKEUP_STATUS_CLR_V  0x00000001U
#define RTC_CNTL_GPIO_WAKEUP_STATUS_CLR_S  6
/** RTC_CNTL_GPIO_PIN_CLK_GATE : R/W; bitpos: [7]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN_CLK_GATE    (BIT(7))
#define RTC_CNTL_GPIO_PIN_CLK_GATE_M  (RTC_CNTL_GPIO_PIN_CLK_GATE_V << RTC_CNTL_GPIO_PIN_CLK_GATE_S)
#define RTC_CNTL_GPIO_PIN_CLK_GATE_V  0x00000001U
#define RTC_CNTL_GPIO_PIN_CLK_GATE_S  7
/** RTC_CNTL_GPIO_PIN5_INT_TYPE : R/W; bitpos: [10:8]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN5_INT_TYPE    0x00000007U
#define RTC_CNTL_GPIO_PIN5_INT_TYPE_M  (RTC_CNTL_GPIO_PIN5_INT_TYPE_V << RTC_CNTL_GPIO_PIN5_INT_TYPE_S)
#define RTC_CNTL_GPIO_PIN5_INT_TYPE_V  0x00000007U
#define RTC_CNTL_GPIO_PIN5_INT_TYPE_S  8
/** RTC_CNTL_GPIO_PIN4_INT_TYPE : R/W; bitpos: [13:11]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN4_INT_TYPE    0x00000007U
#define RTC_CNTL_GPIO_PIN4_INT_TYPE_M  (RTC_CNTL_GPIO_PIN4_INT_TYPE_V << RTC_CNTL_GPIO_PIN4_INT_TYPE_S)
#define RTC_CNTL_GPIO_PIN4_INT_TYPE_V  0x00000007U
#define RTC_CNTL_GPIO_PIN4_INT_TYPE_S  11
/** RTC_CNTL_GPIO_PIN3_INT_TYPE : R/W; bitpos: [16:14]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN3_INT_TYPE    0x00000007U
#define RTC_CNTL_GPIO_PIN3_INT_TYPE_M  (RTC_CNTL_GPIO_PIN3_INT_TYPE_V << RTC_CNTL_GPIO_PIN3_INT_TYPE_S)
#define RTC_CNTL_GPIO_PIN3_INT_TYPE_V  0x00000007U
#define RTC_CNTL_GPIO_PIN3_INT_TYPE_S  14
/** RTC_CNTL_GPIO_PIN2_INT_TYPE : R/W; bitpos: [19:17]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN2_INT_TYPE    0x00000007U
#define RTC_CNTL_GPIO_PIN2_INT_TYPE_M  (RTC_CNTL_GPIO_PIN2_INT_TYPE_V << RTC_CNTL_GPIO_PIN2_INT_TYPE_S)
#define RTC_CNTL_GPIO_PIN2_INT_TYPE_V  0x00000007U
#define RTC_CNTL_GPIO_PIN2_INT_TYPE_S  17
/** RTC_CNTL_GPIO_PIN1_INT_TYPE : R/W; bitpos: [22:20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN1_INT_TYPE    0x00000007U
#define RTC_CNTL_GPIO_PIN1_INT_TYPE_M  (RTC_CNTL_GPIO_PIN1_INT_TYPE_V << RTC_CNTL_GPIO_PIN1_INT_TYPE_S)
#define RTC_CNTL_GPIO_PIN1_INT_TYPE_V  0x00000007U
#define RTC_CNTL_GPIO_PIN1_INT_TYPE_S  20
/** RTC_CNTL_GPIO_PIN0_INT_TYPE : R/W; bitpos: [25:23]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN0_INT_TYPE    0x00000007U
#define RTC_CNTL_GPIO_PIN0_INT_TYPE_M  (RTC_CNTL_GPIO_PIN0_INT_TYPE_V << RTC_CNTL_GPIO_PIN0_INT_TYPE_S)
#define RTC_CNTL_GPIO_PIN0_INT_TYPE_V  0x00000007U
#define RTC_CNTL_GPIO_PIN0_INT_TYPE_S  23
/** RTC_CNTL_GPIO_PIN5_WAKEUP_ENABLE : R/W; bitpos: [26]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN5_WAKEUP_ENABLE    (BIT(26))
#define RTC_CNTL_GPIO_PIN5_WAKEUP_ENABLE_M  (RTC_CNTL_GPIO_PIN5_WAKEUP_ENABLE_V << RTC_CNTL_GPIO_PIN5_WAKEUP_ENABLE_S)
#define RTC_CNTL_GPIO_PIN5_WAKEUP_ENABLE_V  0x00000001U
#define RTC_CNTL_GPIO_PIN5_WAKEUP_ENABLE_S  26
/** RTC_CNTL_GPIO_PIN4_WAKEUP_ENABLE : R/W; bitpos: [27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN4_WAKEUP_ENABLE    (BIT(27))
#define RTC_CNTL_GPIO_PIN4_WAKEUP_ENABLE_M  (RTC_CNTL_GPIO_PIN4_WAKEUP_ENABLE_V << RTC_CNTL_GPIO_PIN4_WAKEUP_ENABLE_S)
#define RTC_CNTL_GPIO_PIN4_WAKEUP_ENABLE_V  0x00000001U
#define RTC_CNTL_GPIO_PIN4_WAKEUP_ENABLE_S  27
/** RTC_CNTL_GPIO_PIN3_WAKEUP_ENABLE : R/W; bitpos: [28]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN3_WAKEUP_ENABLE    (BIT(28))
#define RTC_CNTL_GPIO_PIN3_WAKEUP_ENABLE_M  (RTC_CNTL_GPIO_PIN3_WAKEUP_ENABLE_V << RTC_CNTL_GPIO_PIN3_WAKEUP_ENABLE_S)
#define RTC_CNTL_GPIO_PIN3_WAKEUP_ENABLE_V  0x00000001U
#define RTC_CNTL_GPIO_PIN3_WAKEUP_ENABLE_S  28
/** RTC_CNTL_GPIO_PIN2_WAKEUP_ENABLE : R/W; bitpos: [29]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN2_WAKEUP_ENABLE    (BIT(29))
#define RTC_CNTL_GPIO_PIN2_WAKEUP_ENABLE_M  (RTC_CNTL_GPIO_PIN2_WAKEUP_ENABLE_V << RTC_CNTL_GPIO_PIN2_WAKEUP_ENABLE_S)
#define RTC_CNTL_GPIO_PIN2_WAKEUP_ENABLE_V  0x00000001U
#define RTC_CNTL_GPIO_PIN2_WAKEUP_ENABLE_S  29
/** RTC_CNTL_GPIO_PIN1_WAKEUP_ENABLE : R/W; bitpos: [30]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN1_WAKEUP_ENABLE    (BIT(30))
#define RTC_CNTL_GPIO_PIN1_WAKEUP_ENABLE_M  (RTC_CNTL_GPIO_PIN1_WAKEUP_ENABLE_V << RTC_CNTL_GPIO_PIN1_WAKEUP_ENABLE_S)
#define RTC_CNTL_GPIO_PIN1_WAKEUP_ENABLE_V  0x00000001U
#define RTC_CNTL_GPIO_PIN1_WAKEUP_ENABLE_S  30
/** RTC_CNTL_GPIO_PIN0_WAKEUP_ENABLE : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN0_WAKEUP_ENABLE    (BIT(31))
#define RTC_CNTL_GPIO_PIN0_WAKEUP_ENABLE_M  (RTC_CNTL_GPIO_PIN0_WAKEUP_ENABLE_V << RTC_CNTL_GPIO_PIN0_WAKEUP_ENABLE_S)
#define RTC_CNTL_GPIO_PIN0_WAKEUP_ENABLE_V  0x00000001U
#define RTC_CNTL_GPIO_PIN0_WAKEUP_ENABLE_S  31

