espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_DBG_SEL_REG register
 *  register description
 */
#define RTC_CNTL_DBG_SEL_REG (DR_REG_RTCCNTL_BASE + 0x148)
/** RTC_CNTL_MTDI_ENAMUX : R/W; bitpos: [0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_MTDI_ENAMUX    (BIT(0))
#define RTC_CNTL_MTDI_ENAMUX_M  (RTC_CNTL_MTDI_ENAMUX_V << RTC_CNTL_MTDI_ENAMUX_S)
#define RTC_CNTL_MTDI_ENAMUX_V  0x00000001U
#define RTC_CNTL_MTDI_ENAMUX_S  0
/** RTC_CNTL_DEBUG_12M_NO_GATING : R/W; bitpos: [1]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DEBUG_12M_NO_GATING    (BIT(1))
#define RTC_CNTL_DEBUG_12M_NO_GATING_M  (RTC_CNTL_DEBUG_12M_NO_GATING_V << RTC_CNTL_DEBUG_12M_NO_GATING_S)
#define RTC_CNTL_DEBUG_12M_NO_GATING_V  0x00000001U
#define RTC_CNTL_DEBUG_12M_NO_GATING_S  1
/** RTC_CNTL_DEBUG_BIT_SEL : R/W; bitpos: [6:2]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DEBUG_BIT_SEL    0x0000001FU
#define RTC_CNTL_DEBUG_BIT_SEL_M  (RTC_CNTL_DEBUG_BIT_SEL_V << RTC_CNTL_DEBUG_BIT_SEL_S)
#define RTC_CNTL_DEBUG_BIT_SEL_V  0x0000001FU
#define RTC_CNTL_DEBUG_BIT_SEL_S  2
/** RTC_CNTL_DEBUG_SEL0 : R/W; bitpos: [11:7]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DEBUG_SEL0    0x0000001FU
#define RTC_CNTL_DEBUG_SEL0_M  (RTC_CNTL_DEBUG_SEL0_V << RTC_CNTL_DEBUG_SEL0_S)
#define RTC_CNTL_DEBUG_SEL0_V  0x0000001FU
#define RTC_CNTL_DEBUG_SEL0_S  7
/** RTC_CNTL_DEBUG_SEL1 : R/W; bitpos: [16:12]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DEBUG_SEL1    0x0000001FU
#define RTC_CNTL_DEBUG_SEL1_M  (RTC_CNTL_DEBUG_SEL1_V << RTC_CNTL_DEBUG_SEL1_S)
#define RTC_CNTL_DEBUG_SEL1_V  0x0000001FU
#define RTC_CNTL_DEBUG_SEL1_S  12
/** RTC_CNTL_DEBUG_SEL2 : R/W; bitpos: [21:17]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DEBUG_SEL2    0x0000001FU
#define RTC_CNTL_DEBUG_SEL2_M  (RTC_CNTL_DEBUG_SEL2_V << RTC_CNTL_DEBUG_SEL2_S)
#define RTC_CNTL_DEBUG_SEL2_V  0x0000001FU
#define RTC_CNTL_DEBUG_SEL2_S  17
/** RTC_CNTL_DEBUG_SEL3 : R/W; bitpos: [26:22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DEBUG_SEL3    0x0000001FU
#define RTC_CNTL_DEBUG_SEL3_M  (RTC_CNTL_DEBUG_SEL3_V << RTC_CNTL_DEBUG_SEL3_S)
#define RTC_CNTL_DEBUG_SEL3_V  0x0000001FU
#define RTC_CNTL_DEBUG_SEL3_S  22
/** RTC_CNTL_DEBUG_SEL4 : R/W; bitpos: [31:27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DEBUG_SEL4    0x0000001FU
#define RTC_CNTL_DEBUG_SEL4_M  (RTC_CNTL_DEBUG_SEL4_V << RTC_CNTL_DEBUG_SEL4_S)
#define RTC_CNTL_DEBUG_SEL4_V  0x0000001FU
#define RTC_CNTL_DEBUG_SEL4_S  27

/** RTC_CNTL_DBG_MAP_REG register
 *  register description
 */
#define RTC_CNTL_DBG_MAP_REG (DR_REG_RTCCNTL_BASE + 0x14c)
/** RTC_CNTL_VDD_DIG_TEST : R/W; bitpos: [1:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VDD_DIG_TEST    0x00000003U
#define RTC_CNTL_VDD_DIG_TEST_M  (RTC_CNTL_VDD_DIG_TEST_V << RTC_CNTL_VDD_DIG_TEST_S)
#define RTC_CNTL_VDD_DIG_TEST_V  0x00000003U
#define RTC_CNTL_VDD_DIG_TEST_S  0
/** RTC_CNTL_GPIO_PIN5_MUX_SEL : R/W; bitpos: [2]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN5_MUX_SEL    (BIT(2))
#define RTC_CNTL_GPIO_PIN5_MUX_SEL_M  (RTC_CNTL_GPIO_PIN5_MUX_SEL_V << RTC_CNTL_GPIO_PIN5_MUX_SEL_S)
#define RTC_CNTL_GPIO_PIN5_MUX_SEL_V  0x00000001U
#define RTC_CNTL_GPIO_PIN5_MUX_SEL_S  2
/** RTC_CNTL_GPIO_PIN4_MUX_SEL : R/W; bitpos: [3]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN4_MUX_SEL    (BIT(3))
#define RTC_CNTL_GPIO_PIN4_MUX_SEL_M  (RTC_CNTL_GPIO_PIN4_MUX_SEL_V << RTC_CNTL_GPIO_PIN4_MUX_SEL_S)
#define RTC_CNTL_GPIO_PIN4_MUX_SEL_V  0x00000001U
#define RTC_CNTL_GPIO_PIN4_MUX_SEL_S  3
/** RTC_CNTL_GPIO_PIN3_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN3_MUX_SEL    (BIT(4))
#define RTC_CNTL_GPIO_PIN3_MUX_SEL_M  (RTC_CNTL_GPIO_PIN3_MUX_SEL_V << RTC_CNTL_GPIO_PIN3_MUX_SEL_S)
#define RTC_CNTL_GPIO_PIN3_MUX_SEL_V  0x00000001U
#define RTC_CNTL_GPIO_PIN3_MUX_SEL_S  4
/** RTC_CNTL_GPIO_PIN2_MUX_SEL : R/W; bitpos: [5]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN2_MUX_SEL    (BIT(5))
#define RTC_CNTL_GPIO_PIN2_MUX_SEL_M  (RTC_CNTL_GPIO_PIN2_MUX_SEL_V << RTC_CNTL_GPIO_PIN2_MUX_SEL_S)
#define RTC_CNTL_GPIO_PIN2_MUX_SEL_V  0x00000001U
#define RTC_CNTL_GPIO_PIN2_MUX_SEL_S  5
/** RTC_CNTL_GPIO_PIN1_MUX_SEL : R/W; bitpos: [6]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN1_MUX_SEL    (BIT(6))
#define RTC_CNTL_GPIO_PIN1_MUX_SEL_M  (RTC_CNTL_GPIO_PIN1_MUX_SEL_V << RTC_CNTL_GPIO_PIN1_MUX_SEL_S)
#define RTC_CNTL_GPIO_PIN1_MUX_SEL_V  0x00000001U
#define RTC_CNTL_GPIO_PIN1_MUX_SEL_S  6
/** RTC_CNTL_GPIO_PIN0_MUX_SEL : R/W; bitpos: [7]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN0_MUX_SEL    (BIT(7))
#define RTC_CNTL_GPIO_PIN0_MUX_SEL_M  (RTC_CNTL_GPIO_PIN0_MUX_SEL_V << RTC_CNTL_GPIO_PIN0_MUX_SEL_S)
#define RTC_CNTL_GPIO_PIN0_MUX_SEL_V  0x00000001U
#define RTC_CNTL_GPIO_PIN0_MUX_SEL_S  7
/** RTC_CNTL_GPIO_PIN5_FUN_SEL : R/W; bitpos: [11:8]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN5_FUN_SEL    0x0000000FU
#define RTC_CNTL_GPIO_PIN5_FUN_SEL_M  (RTC_CNTL_GPIO_PIN5_FUN_SEL_V << RTC_CNTL_GPIO_PIN5_FUN_SEL_S)
#define RTC_CNTL_GPIO_PIN5_FUN_SEL_V  0x0000000FU
#define RTC_CNTL_GPIO_PIN5_FUN_SEL_S  8
/** RTC_CNTL_GPIO_PIN4_FUN_SEL : R/W; bitpos: [15:12]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN4_FUN_SEL    0x0000000FU
#define RTC_CNTL_GPIO_PIN4_FUN_SEL_M  (RTC_CNTL_GPIO_PIN4_FUN_SEL_V << RTC_CNTL_GPIO_PIN4_FUN_SEL_S)
#define RTC_CNTL_GPIO_PIN4_FUN_SEL_V  0x0000000FU
#define RTC_CNTL_GPIO_PIN4_FUN_SEL_S  12
/** RTC_CNTL_GPIO_PIN3_FUN_SEL : R/W; bitpos: [19:16]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN3_FUN_SEL    0x0000000FU
#define RTC_CNTL_GPIO_PIN3_FUN_SEL_M  (RTC_CNTL_GPIO_PIN3_FUN_SEL_V << RTC_CNTL_GPIO_PIN3_FUN_SEL_S)
#define RTC_CNTL_GPIO_PIN3_FUN_SEL_V  0x0000000FU
#define RTC_CNTL_GPIO_PIN3_FUN_SEL_S  16
/** RTC_CNTL_GPIO_PIN2_FUN_SEL : R/W; bitpos: [23:20]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN2_FUN_SEL    0x0000000FU
#define RTC_CNTL_GPIO_PIN2_FUN_SEL_M  (RTC_CNTL_GPIO_PIN2_FUN_SEL_V << RTC_CNTL_GPIO_PIN2_FUN_SEL_S)
#define RTC_CNTL_GPIO_PIN2_FUN_SEL_V  0x0000000FU
#define RTC_CNTL_GPIO_PIN2_FUN_SEL_S  20
/** RTC_CNTL_GPIO_PIN1_FUN_SEL : R/W; bitpos: [27:24]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN1_FUN_SEL    0x0000000FU
#define RTC_CNTL_GPIO_PIN1_FUN_SEL_M  (RTC_CNTL_GPIO_PIN1_FUN_SEL_V << RTC_CNTL_GPIO_PIN1_FUN_SEL_S)
#define RTC_CNTL_GPIO_PIN1_FUN_SEL_V  0x0000000FU
#define RTC_CNTL_GPIO_PIN1_FUN_SEL_S  24
/** RTC_CNTL_GPIO_PIN0_FUN_SEL : R/W; bitpos: [31:28]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_GPIO_PIN0_FUN_SEL    0x0000000FU
#define RTC_CNTL_GPIO_PIN0_FUN_SEL_M  (RTC_CNTL_GPIO_PIN0_FUN_SEL_V << RTC_CNTL_GPIO_PIN0_FUN_SEL_S)
#define RTC_CNTL_GPIO_PIN0_FUN_SEL_V  0x0000000FU
#define RTC_CNTL_GPIO_PIN0_FUN_SEL_S  28

