espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/rtc_cntl_reg.h
/** RTC_CNTL_DBG_SAR_SEL_REG register
 *  register description
 */
#define RTC_CNTL_DBG_SAR_SEL_REG (DR_REG_RTCCNTL_BASE + 0x150)
/** RTC_CNTL_SAR_DEBUG_SEL : R/W; bitpos: [31:27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SAR_DEBUG_SEL    0x0000001FU
#define RTC_CNTL_SAR_DEBUG_SEL_M  (RTC_CNTL_SAR_DEBUG_SEL_V << RTC_CNTL_SAR_DEBUG_SEL_S)
#define RTC_CNTL_SAR_DEBUG_SEL_V  0x0000001FU
#define RTC_CNTL_SAR_DEBUG_SEL_S  27

/** RTC_CNTL_PG_CTRL_REG register
 *  register description
 */
#define RTC_CNTL_PG_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x154)
/** RTC_CNTL_POWER_GLITCH_DSENSE : R/W; bitpos: [27:26]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_POWER_GLITCH_DSENSE    0x00000003U
#define RTC_CNTL_POWER_GLITCH_DSENSE_M  (RTC_CNTL_POWER_GLITCH_DSENSE_V << RTC_CNTL_POWER_GLITCH_DSENSE_S)
#define RTC_CNTL_POWER_GLITCH_DSENSE_V  0x00000003U
#define RTC_CNTL_POWER_GLITCH_DSENSE_S  26
/** RTC_CNTL_POWER_GLITCH_FORCE_PD : R/W; bitpos: [28]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_POWER_GLITCH_FORCE_PD    (BIT(28))
#define RTC_CNTL_POWER_GLITCH_FORCE_PD_M  (RTC_CNTL_POWER_GLITCH_FORCE_PD_V << RTC_CNTL_POWER_GLITCH_FORCE_PD_S)
#define RTC_CNTL_POWER_GLITCH_FORCE_PD_V  0x00000001U
#define RTC_CNTL_POWER_GLITCH_FORCE_PD_S  28
/** RTC_CNTL_POWER_GLITCH_FORCE_PU : R/W; bitpos: [29]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_POWER_GLITCH_FORCE_PU    (BIT(29))
#define RTC_CNTL_POWER_GLITCH_FORCE_PU_M  (RTC_CNTL_POWER_GLITCH_FORCE_PU_V << RTC_CNTL_POWER_GLITCH_FORCE_PU_S)
#define RTC_CNTL_POWER_GLITCH_FORCE_PU_V  0x00000001U
#define RTC_CNTL_POWER_GLITCH_FORCE_PU_S  29
/** RTC_CNTL_POWER_GLITCH_EFUSE_SEL : R/W; bitpos: [30]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_POWER_GLITCH_EFUSE_SEL    (BIT(30))
#define RTC_CNTL_POWER_GLITCH_EFUSE_SEL_M  (RTC_CNTL_POWER_GLITCH_EFUSE_SEL_V << RTC_CNTL_POWER_GLITCH_EFUSE_SEL_S)
#define RTC_CNTL_POWER_GLITCH_EFUSE_SEL_V  0x00000001U
#define RTC_CNTL_POWER_GLITCH_EFUSE_SEL_S  30
/** RTC_CNTL_POWER_GLITCH_EN : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_POWER_GLITCH_EN    (BIT(31))
#define RTC_CNTL_POWER_GLITCH_EN_M  (RTC_CNTL_POWER_GLITCH_EN_V << RTC_CNTL_POWER_GLITCH_EN_S)
#define RTC_CNTL_POWER_GLITCH_EN_V  0x00000001U
#define RTC_CNTL_POWER_GLITCH_EN_S  31

/** RTC_CNTL_DCDC_CTRL0_REG register
 *  register description
 */
#define RTC_CNTL_DCDC_CTRL0_REG (DR_REG_RTCCNTL_BASE + 0x158)
/** RTC_CNTL_VSET_DCDC_VALUE : RO; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_VALUE    0x0000001FU
#define RTC_CNTL_VSET_DCDC_VALUE_M  (RTC_CNTL_VSET_DCDC_VALUE_V << RTC_CNTL_VSET_DCDC_VALUE_S)
#define RTC_CNTL_VSET_DCDC_VALUE_V  0x0000001FU
#define RTC_CNTL_VSET_DCDC_VALUE_S  0
/** RTC_CNTL_POWER_GOOD_DCDC : RO; bitpos: [5]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_POWER_GOOD_DCDC    (BIT(5))
#define RTC_CNTL_POWER_GOOD_DCDC_M  (RTC_CNTL_POWER_GOOD_DCDC_V << RTC_CNTL_POWER_GOOD_DCDC_S)
#define RTC_CNTL_POWER_GOOD_DCDC_V  0x00000001U
#define RTC_CNTL_POWER_GOOD_DCDC_S  5
/** RTC_CNTL_PMU_MODE : R/W; bitpos: [20:19]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_PMU_MODE    0x00000003U
#define RTC_CNTL_PMU_MODE_M  (RTC_CNTL_PMU_MODE_V << RTC_CNTL_PMU_MODE_S)
#define RTC_CNTL_PMU_MODE_V  0x00000003U
#define RTC_CNTL_PMU_MODE_S  19
/** RTC_CNTL_RAMPLEVEL_DCDC : R/W; bitpos: [21]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_RAMPLEVEL_DCDC    (BIT(21))
#define RTC_CNTL_RAMPLEVEL_DCDC_M  (RTC_CNTL_RAMPLEVEL_DCDC_V << RTC_CNTL_RAMPLEVEL_DCDC_S)
#define RTC_CNTL_RAMPLEVEL_DCDC_V  0x00000001U
#define RTC_CNTL_RAMPLEVEL_DCDC_S  21
/** RTC_CNTL_RAMP_DCDC : R/W; bitpos: [22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_RAMP_DCDC    (BIT(22))
#define RTC_CNTL_RAMP_DCDC_M  (RTC_CNTL_RAMP_DCDC_V << RTC_CNTL_RAMP_DCDC_S)
#define RTC_CNTL_RAMP_DCDC_V  0x00000001U
#define RTC_CNTL_RAMP_DCDC_S  22
/** RTC_CNTL_DCM2ENB_DCDC : R/W; bitpos: [23]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DCM2ENB_DCDC    (BIT(23))
#define RTC_CNTL_DCM2ENB_DCDC_M  (RTC_CNTL_DCM2ENB_DCDC_V << RTC_CNTL_DCM2ENB_DCDC_S)
#define RTC_CNTL_DCM2ENB_DCDC_V  0x00000001U
#define RTC_CNTL_DCM2ENB_DCDC_S  23
/** RTC_CNTL_DCMLEVEL_DCDC : R/W; bitpos: [25:24]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_DCMLEVEL_DCDC    0x00000003U
#define RTC_CNTL_DCMLEVEL_DCDC_M  (RTC_CNTL_DCMLEVEL_DCDC_V << RTC_CNTL_DCMLEVEL_DCDC_S)
#define RTC_CNTL_DCMLEVEL_DCDC_V  0x00000003U
#define RTC_CNTL_DCMLEVEL_DCDC_S  24
/** RTC_CNTL_FSW_DCDC : R/W; bitpos: [28:26]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_FSW_DCDC    0x00000007U
#define RTC_CNTL_FSW_DCDC_M  (RTC_CNTL_FSW_DCDC_V << RTC_CNTL_FSW_DCDC_S)
#define RTC_CNTL_FSW_DCDC_V  0x00000007U
#define RTC_CNTL_FSW_DCDC_S  26
/** RTC_CNTL_CCM_DCDC : R/W; bitpos: [29]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_CCM_DCDC    (BIT(29))
#define RTC_CNTL_CCM_DCDC_M  (RTC_CNTL_CCM_DCDC_V << RTC_CNTL_CCM_DCDC_S)
#define RTC_CNTL_CCM_DCDC_V  0x00000001U
#define RTC_CNTL_CCM_DCDC_S  29
/** RTC_CNTL_SSTIME_DCDC : R/W; bitpos: [30]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_SSTIME_DCDC    (BIT(30))
#define RTC_CNTL_SSTIME_DCDC_M  (RTC_CNTL_SSTIME_DCDC_V << RTC_CNTL_SSTIME_DCDC_S)
#define RTC_CNTL_SSTIME_DCDC_V  0x00000001U
#define RTC_CNTL_SSTIME_DCDC_S  30
/** RTC_CNTL_POCPENB_DCDC : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_POCPENB_DCDC    (BIT(31))
#define RTC_CNTL_POCPENB_DCDC_M  (RTC_CNTL_POCPENB_DCDC_V << RTC_CNTL_POCPENB_DCDC_S)
#define RTC_CNTL_POCPENB_DCDC_V  0x00000001U
#define RTC_CNTL_POCPENB_DCDC_S  31

/** RTC_CNTL_DCDC_CTRL1_REG register
 *  register description
 */
#define RTC_CNTL_DCDC_CTRL1_REG (DR_REG_RTCCNTL_BASE + 0x15c)
/** RTC_CNTL_DCDC_MODE_SLP : R/W; bitpos: [25:23]; default: 4;
 *  Need add description
 */
#define RTC_CNTL_DCDC_MODE_SLP    0x00000007U
#define RTC_CNTL_DCDC_MODE_SLP_M  (RTC_CNTL_DCDC_MODE_SLP_V << RTC_CNTL_DCDC_MODE_SLP_S)
#define RTC_CNTL_DCDC_MODE_SLP_V  0x00000007U
#define RTC_CNTL_DCDC_MODE_SLP_S  23
/** RTC_CNTL_DCDC_MODE_MONITOR : R/W; bitpos: [28:26]; default: 4;
 *  Need add description
 */
#define RTC_CNTL_DCDC_MODE_MONITOR    0x00000007U
#define RTC_CNTL_DCDC_MODE_MONITOR_M  (RTC_CNTL_DCDC_MODE_MONITOR_V << RTC_CNTL_DCDC_MODE_MONITOR_S)
#define RTC_CNTL_DCDC_MODE_MONITOR_V  0x00000007U
#define RTC_CNTL_DCDC_MODE_MONITOR_S  26
/** RTC_CNTL_DCDC_MODE_IDLE : R/W; bitpos: [31:29]; default: 4;
 *  Need add description
 */
#define RTC_CNTL_DCDC_MODE_IDLE    0x00000007U
#define RTC_CNTL_DCDC_MODE_IDLE_M  (RTC_CNTL_DCDC_MODE_IDLE_V << RTC_CNTL_DCDC_MODE_IDLE_S)
#define RTC_CNTL_DCDC_MODE_IDLE_V  0x00000007U
#define RTC_CNTL_DCDC_MODE_IDLE_S  29

/** RTC_CNTL_DCDC_CTRL2_REG register
 *  register description
 */
#define RTC_CNTL_DCDC_CTRL2_REG (DR_REG_RTCCNTL_BASE + 0x160)
/** RTC_CNTL_VSET_DCDC_TARGET_VALUE1 : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_TARGET_VALUE1    0x0000001FU
#define RTC_CNTL_VSET_DCDC_TARGET_VALUE1_M  (RTC_CNTL_VSET_DCDC_TARGET_VALUE1_V << RTC_CNTL_VSET_DCDC_TARGET_VALUE1_S)
#define RTC_CNTL_VSET_DCDC_TARGET_VALUE1_V  0x0000001FU
#define RTC_CNTL_VSET_DCDC_TARGET_VALUE1_S  0
/** RTC_CNTL_VSET_DCDC_TARGET_VALUE0 : R/W; bitpos: [9:5]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_TARGET_VALUE0    0x0000001FU
#define RTC_CNTL_VSET_DCDC_TARGET_VALUE0_M  (RTC_CNTL_VSET_DCDC_TARGET_VALUE0_V << RTC_CNTL_VSET_DCDC_TARGET_VALUE0_S)
#define RTC_CNTL_VSET_DCDC_TARGET_VALUE0_V  0x0000001FU
#define RTC_CNTL_VSET_DCDC_TARGET_VALUE0_S  5
/** RTC_CNTL_VSET_DCDC_INIT_VALUE : R/W; bitpos: [14:10]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_INIT_VALUE    0x0000001FU
#define RTC_CNTL_VSET_DCDC_INIT_VALUE_M  (RTC_CNTL_VSET_DCDC_INIT_VALUE_V << RTC_CNTL_VSET_DCDC_INIT_VALUE_S)
#define RTC_CNTL_VSET_DCDC_INIT_VALUE_V  0x0000001FU
#define RTC_CNTL_VSET_DCDC_INIT_VALUE_S  10
/** RTC_CNTL_VSET_DCDC_INIT : WO; bitpos: [15]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_INIT    (BIT(15))
#define RTC_CNTL_VSET_DCDC_INIT_M  (RTC_CNTL_VSET_DCDC_INIT_V << RTC_CNTL_VSET_DCDC_INIT_S)
#define RTC_CNTL_VSET_DCDC_INIT_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_INIT_S  15
/** RTC_CNTL_VSET_DCDC_FIX : R/W; bitpos: [16]; default: 1;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_FIX    (BIT(16))
#define RTC_CNTL_VSET_DCDC_FIX_M  (RTC_CNTL_VSET_DCDC_FIX_V << RTC_CNTL_VSET_DCDC_FIX_S)
#define RTC_CNTL_VSET_DCDC_FIX_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_FIX_S  16
/** RTC_CNTL_VSET_DCDC_STEP : R/W; bitpos: [21:17]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_STEP    0x0000001FU
#define RTC_CNTL_VSET_DCDC_STEP_M  (RTC_CNTL_VSET_DCDC_STEP_V << RTC_CNTL_VSET_DCDC_STEP_S)
#define RTC_CNTL_VSET_DCDC_STEP_V  0x0000001FU
#define RTC_CNTL_VSET_DCDC_STEP_S  17
/** RTC_CNTL_VSET_DCDC_GAP : R/W; bitpos: [26:22]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_GAP    0x0000001FU
#define RTC_CNTL_VSET_DCDC_GAP_M  (RTC_CNTL_VSET_DCDC_GAP_V << RTC_CNTL_VSET_DCDC_GAP_S)
#define RTC_CNTL_VSET_DCDC_GAP_V  0x0000001FU
#define RTC_CNTL_VSET_DCDC_GAP_S  22
/** RTC_CNTL_VSET_DCDC_SEL_HW_SW : R/W; bitpos: [27]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_SEL_HW_SW    (BIT(27))
#define RTC_CNTL_VSET_DCDC_SEL_HW_SW_M  (RTC_CNTL_VSET_DCDC_SEL_HW_SW_V << RTC_CNTL_VSET_DCDC_SEL_HW_SW_S)
#define RTC_CNTL_VSET_DCDC_SEL_HW_SW_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_SEL_HW_SW_S  27
/** RTC_CNTL_VSET_DCDC_SW_SEL : R/W; bitpos: [28]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_VSET_DCDC_SW_SEL    (BIT(28))
#define RTC_CNTL_VSET_DCDC_SW_SEL_M  (RTC_CNTL_VSET_DCDC_SW_SEL_V << RTC_CNTL_VSET_DCDC_SW_SEL_S)
#define RTC_CNTL_VSET_DCDC_SW_SEL_V  0x00000001U
#define RTC_CNTL_VSET_DCDC_SW_SEL_S  28

/** RTC_CNTL_RC32K_CTRL_REG register
 *  register description
 */
#define RTC_CNTL_RC32K_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x164)
/** RTC_CNTL_RC32K_DFREQ : R/W; bitpos: [30:21]; default: 511;
 *  Need add description
 */
#define RTC_CNTL_RC32K_DFREQ    0x000003FFU
#define RTC_CNTL_RC32K_DFREQ_M  (RTC_CNTL_RC32K_DFREQ_V << RTC_CNTL_RC32K_DFREQ_S)
#define RTC_CNTL_RC32K_DFREQ_V  0x000003FFU
#define RTC_CNTL_RC32K_DFREQ_S  21
/** RTC_CNTL_RC32K_XPD : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_RC32K_XPD    (BIT(31))
#define RTC_CNTL_RC32K_XPD_M  (RTC_CNTL_RC32K_XPD_V << RTC_CNTL_RC32K_XPD_S)
#define RTC_CNTL_RC32K_XPD_V  0x00000001U
#define RTC_CNTL_RC32K_XPD_S  31

/** RTC_CNTL_PLL8M_REG register
 *  register description
 */
#define RTC_CNTL_PLL8M_REG (DR_REG_RTCCNTL_BASE + 0x168)
/** RTC_CNTL_CKREF_PLL8M_SEL : R/W; bitpos: [30]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_CKREF_PLL8M_SEL    (BIT(30))
#define RTC_CNTL_CKREF_PLL8M_SEL_M  (RTC_CNTL_CKREF_PLL8M_SEL_V << RTC_CNTL_CKREF_PLL8M_SEL_S)
#define RTC_CNTL_CKREF_PLL8M_SEL_V  0x00000001U
#define RTC_CNTL_CKREF_PLL8M_SEL_S  30
/** RTC_CNTL_XPD_PLL8M : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define RTC_CNTL_XPD_PLL8M    (BIT(31))
#define RTC_CNTL_XPD_PLL8M_M  (RTC_CNTL_XPD_PLL8M_V << RTC_CNTL_XPD_PLL8M_S)
#define RTC_CNTL_XPD_PLL8M_V  0x00000001U
#define RTC_CNTL_XPD_PLL8M_S  31

/** RTC_CNTL_DATE_REG register
 *  register description
 */
#define RTC_CNTL_DATE_REG (DR_REG_RTCCNTL_BASE + 0x1fc)
/** RTC_CNTL_DATE : R/W; bitpos: [27:0]; default: 34640480;
 *  Need add description
 */
#define RTC_CNTL_DATE    0x0FFFFFFFU
#define RTC_CNTL_DATE_M  (RTC_CNTL_DATE_V << RTC_CNTL_DATE_S)
#define RTC_CNTL_DATE_V  0x0FFFFFFFU
#define RTC_CNTL_DATE_S  0

#ifdef __cplusplus
}
#endif
